[
  {
    "FrontEN": "What is the intent of the Composite pattern?",
    "BackEN": "Compose objects into tree structures to represent part-whole hierarchies. Composite lets clients treat individual objects and compositions of objects uniformly.",
    "FrontES": "¿Cuál es la intención del patrón Composite?",
    "BackES": "Componer objetos en estructuras de árbol para representar jerarquías parte-todo. Composite permite a los clientes tratar objetos individuales y composiciones de objetos de manera uniforme.",
    "Tags": "intent composite structural",
    "Category": "Structural",
    "Page": "43"
  },
  {
    "FrontEN": "When would you use the Composite pattern?",
    "BackEN": "• You want to represent part-whole hierarchies of objects\n• You want clients to be able to ignore the difference between compositions of objects and individual objects\n• You need to treat single elements and groups of elements uniformly",
    "FrontES": "¿Cuándo usarías el patrón Composite?",
    "BackES": "• Quieres representar jerarquías parte-todo de objetos\n• Quieres que los clientes puedan ignorar la diferencia entre composiciones de objetos y objetos individuales\n• Necesitas tratar elementos individuales y grupos de elementos de manera uniforme",
    "Tags": "use-case composite structural",
    "Category": "Structural",
    "Page": "43"
  },
  {
    "FrontEN": "What are the key participants in the Composite pattern?",
    "BackEN": "• Glyph: Abstract class for all objects in document structure\n• Character/Rectangle: Leaf primitive elements\n• Row/Column: Composite structural elements\n• Composition: Special composite using formatting algorithm",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Composite?",
    "BackES": "• Glyph: Clase abstracta para todos los objetos en la estructura del documento\n• Character/Rectangle: Elementos primitivos hoja\n• Row/Column: Elementos estructurales compuestos\n• Composition: Compuesto especial que usa algoritmo de formato",
    "Tags": "key-concepts composite structural",
    "Category": "Structural",
    "Page": "46"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Composite pattern?",
    "BackEN": "Benefits:\n• Makes client code simpler by treating primitives and composites uniformly\n• Makes it easy to add new kinds of components\n• Provides flexibility at the finest levels of design\n\nDrawbacks:\n• Can make the design overly general\n• Can make it harder to restrict components of a composite",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Composite?",
    "BackES": "Beneficios:\n• Hace el código cliente más simple al tratar primitivas y compuestos de manera uniforme\n• Facilita agregar nuevos tipos de componentes\n• Proporciona flexibilidad en los niveles más finos del diseño\n\nDesventajas:\n• Puede hacer el diseño excesivamente general\n• Puede dificultar la restricción de componentes de un compuesto",
    "Tags": "benefits-drawbacks composite structural",
    "Category": "Structural",
    "Page": "47"
  },
  {
    "FrontEN": "What patterns are related to the Composite pattern?",
    "BackEN": "• Iterator: Often used together to traverse composite structures\n• Visitor: Can be used to apply operations over composite structures\n• Decorator: Similar structure but different intent - Decorator adds responsibilities",
    "FrontES": "¿Qué patrones están relacionados con el patrón Composite?",
    "BackES": "• Iterator: A menudo se usa junto con Composite para recorrer estructuras compuestas\n• Visitor: Se puede usar para aplicar operaciones sobre estructuras compuestas\n• Decorator: Estructura similar pero intención diferente - Decorator añade responsabilidades",
    "Tags": "related-patterns composite structural",
    "Category": "Structural",
    "Page": "47"
  },
  {
    "FrontEN": "What are key implementation considerations for the Composite pattern?",
    "BackEN": "• Use inheritance to define common interface for all components\n• Components should implement operations like Draw that work recursively\n• Parent references let you traverse structure up and down\n• Child management operations (Insert, Remove, Child) should be in common interface",
    "FrontES": "¿Cuáles son las consideraciones de implementación clave para el patrón Composite?",
    "BackES": "• Usar herencia para definir interfaz común para todos los componentes\n• Los componentes deben implementar operaciones como Draw que funcionen recursivamente\n• Las referencias padre permiten recorrer la estructura hacia arriba y hacia abajo\n• Las operaciones de gestión de hijos (Insert, Remove, Child) deben estar en la interfaz común",
    "Tags": "implementation composite structural",
    "Category": "Structural",
    "Page": "47"
  },
  {
    "FrontEN": "What are real-world examples of the Composite pattern?",
    "BackEN": "• Document editors with text and graphics\n• UI frameworks with nested components\n• File system directories and files",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Composite?",
    "BackES": "• Editores de documentos con texto y gráficos\n• Frameworks de UI con componentes anidados\n• Directorios y archivos del sistema de archivos",
    "Tags": "real-world composite structural",
    "Category": "Structural",
    "Page": "47"
  },
  {
    "FrontEN": "What is the intent of the Strategy pattern?",
    "BackEN": "Define a family of algorithms, encapsulate each one, and make them interchangeable. Strategy lets the algorithm vary independently from clients that use it.",
    "FrontES": "¿Cuál es la intención del patrón Strategy?",
    "BackES": "Definir una familia de algoritmos, encapsular cada uno y hacerlos intercambiables. Strategy permite que el algoritmo varíe independientemente de los clientes que lo usan.",
    "Tags": "intent strategy behavioral",
    "Category": "Behavioral",
    "Page": "48"
  },
  {
    "FrontEN": "When would you use the Strategy pattern?",
    "BackEN": "• Many related classes differ only in their behavior\n• You need different variants of an algorithm\n• An algorithm uses data that clients shouldn't know about\n• A class defines many behaviors that appear as multiple conditional statements",
    "FrontES": "¿Cuándo usarías el patrón Strategy?",
    "BackES": "• Muchas clases relacionadas difieren solo en su comportamiento\n• Necesitas diferentes variantes de un algoritmo\n• Un algoritmo usa datos que los clientes no deberían conocer\n• Una clase define muchos comportamientos que aparecen como múltiples declaraciones condicionales",
    "Tags": "use-case strategy behavioral",
    "Category": "Behavioral",
    "Page": "48"
  },
  {
    "FrontEN": "What are the key participants in the Strategy pattern?",
    "BackEN": "• Strategy (Compositor): Declares interface common to all supported algorithms\n• ConcreteStrategy (SimpleCompositor, TeXCompositor): Implements the algorithm using the Strategy interface\n• Context (Composition): Maintains reference to a Strategy object and may define interface for Strategy to access its data",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Strategy?",
    "BackES": "• Strategy (Compositor): Declara la interfaz común a todos los algoritmos soportados\n• ConcreteStrategy (SimpleCompositor, TeXCompositor): Implementa el algoritmo usando la interfaz Strategy\n• Context (Composition): Mantiene una referencia a un objeto Strategy y puede definir una interfaz para que Strategy acceda a sus datos",
    "Tags": "key-concepts strategy behavioral",
    "Category": "Behavioral",
    "Page": "49"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Strategy pattern?",
    "BackEN": "Benefits:\n• Families of related algorithms can be defined\n• Alternative to subclassing for providing different behaviors\n• Eliminates conditional statements\n• Provides different implementations of same behavior\n\nDrawbacks:\n• Clients must be aware of different Strategies\n• Communication overhead between Strategy and Context\n• Increased number of objects",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Strategy?",
    "BackES": "Beneficios:\n• Se pueden definir familias de algoritmos relacionados\n• Alternativa a la subclasificación para proporcionar diferentes comportamientos\n• Elimina declaraciones condicionales\n• Proporciona diferentes implementaciones del mismo comportamiento\n\nDesventajas:\n• Los clientes deben conocer las diferentes Strategies\n• Sobrecarga de comunicación entre Strategy y Context\n• Mayor número de objetos",
    "Tags": "benefits-drawbacks strategy behavioral",
    "Category": "Behavioral",
    "Page": "50"
  },
  {
    "FrontEN": "What patterns are related to the Strategy pattern?",
    "BackEN": "• State: Similar structure but Strategy is about algorithms while State is about states\n• Flyweight: Strategy objects often make good flyweights",
    "FrontES": "¿Qué patrones están relacionados con el patrón Strategy?",
    "BackES": "• State: Estructura similar pero Strategy trata sobre algoritmos mientras que State trata sobre estados\n• Flyweight: Los objetos Strategy a menudo son buenos flyweights",
    "Tags": "related-patterns strategy behavioral",
    "Category": "Behavioral",
    "Page": "50"
  },
  {
    "FrontEN": "What are key implementation considerations for the Strategy pattern?",
    "BackEN": "• Define interfaces for Strategy and Context that are general enough to support range of algorithms\n• Strategy interface should give ConcreteStrategies access to data they need from Context\n• Make Strategy objects good Flyweights if they have no state",
    "FrontES": "¿Cuáles son las consideraciones de implementación clave para el patrón Strategy?",
    "BackES": "• Definir interfaces para Strategy y Context que sean lo suficientemente generales para soportar un rango de algoritmos\n• La interfaz Strategy debe dar a las ConcreteStrategies acceso a los datos que necesitan del Context\n• Hacer que los objetos Strategy sean buenos Flyweights si no tienen estado",
    "Tags": "implementation strategy behavioral",
    "Category": "Behavioral",
    "Page": "50"
  },
  {
    "FrontEN": "What are real-world examples of the Strategy pattern?",
    "BackEN": "• Text formatting algorithms (TeX, simple line breaking)\n• Sorting algorithms that can be swapped\n• Compression strategies\n• Validation strategies",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Strategy?",
    "BackES": "• Algoritmos de formato de texto (TeX, salto de línea simple)\n• Algoritmos de ordenamiento que pueden intercambiarse\n• Estrategias de compresión\n• Estrategias de validación",
    "Tags": "real-world strategy behavioral",
    "Category": "Behavioral",
    "Page": "50"
  },
  {
    "FrontEN": "What is the intent of the Decorator pattern?",
    "BackEN": "Attach additional responsibilities to an object dynamically. Decorators provide a flexible alternative to subclassing for extending functionality.",
    "FrontES": "¿Cuál es la intención del patrón Decorator?",
    "BackES": "Adjuntar responsabilidades adicionales a un objeto dinámicamente. Los Decorators proporcionan una alternativa flexible a la subclasificación para extender funcionalidad.",
    "Tags": "intent decorator structural",
    "Category": "Structural",
    "Page": "51"
  },
  {
    "FrontEN": "When would you use the Decorator pattern?",
    "BackEN": "• Add responsibilities to individual objects dynamically and transparently\n• Responsibilities can be withdrawn\n• Extension by subclassing is impractical due to explosion of subclasses\n• You want to add functionality without affecting other objects",
    "FrontES": "¿Cuándo usarías el patrón Decorator?",
    "BackES": "• Añadir responsabilidades a objetos individuales de forma dinámica y transparente\n• Las responsabilidades pueden retirarse\n• La extensión por subclasificación es impráctica debido a la explosión de subclases\n• Quieres añadir funcionalidad sin afectar a otros objetos",
    "Tags": "use-case decorator structural",
    "Category": "Structural",
    "Page": "51"
  },
  {
    "FrontEN": "What are the key participants in the Decorator pattern?",
    "BackEN": "• Component (Glyph): Defines interface for objects that can have responsibilities added\n• ConcreteComponent (Composition): Defines object to which additional responsibilities can be attached\n• Decorator (MonoGlyph): Maintains reference to Component object and defines interface that conforms to Component\n• ConcreteDecorator (Border, Scroller): Adds responsibilities to the component",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Decorator?",
    "BackES": "• Component (Glyph): Define la interfaz para objetos que pueden tener responsabilidades añadidas\n• ConcreteComponent (Composition): Define el objeto al que se pueden adjuntar responsabilidades adicionales\n• Decorator (MonoGlyph): Mantiene referencia a objeto Component y define interfaz que se ajusta a Component\n• ConcreteDecorator (Border, Scroller): Añade responsabilidades al componente",
    "Tags": "key-concepts decorator structural",
    "Category": "Structural",
    "Page": "52"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Decorator pattern?",
    "BackEN": "Benefits:\n• More flexibility than static inheritance\n• Avoids feature-laden classes high up in the hierarchy\n• Responsibilities can be added and removed at run-time\n• Functionality can be composed from simple pieces\n\nDrawbacks:\n• Decorator and its component aren't identical\n• Lots of little objects that differ only in how they're interconnected\n• Can complicate debugging",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Decorator?",
    "BackES": "Beneficios:\n• Más flexibilidad que la herencia estática\n• Evita clases con muchas características en la parte superior de la jerarquía\n• Las responsabilidades pueden añadirse y eliminarse en tiempo de ejecución\n• Se pueden combinar múltiples decoradores\n\nDesventajas:\n• Muchos objetos pequeños en el sistema\n• Puede ser difícil distinguir los decoradores entre sí\n• Dificulta la configuración inicial",
    "Tags": "benefits-drawbacks decorator structural",
    "Category": "Structural",
    "Page": "53"
  },
  {
    "FrontEN": "What patterns are related to the Decorator pattern?",
    "BackEN": "• Adapter: Adapter changes interface, Decorator enhances responsibilities\n• Composite: Decorator can be viewed as degenerate composite with one component\n• Strategy: Decorator changes skin of object, Strategy changes guts",
    "FrontES": "¿Qué patrones están relacionados con el patrón Decorator?",
    "BackES": "• Adapter: Cambia la interfaz de un objeto; Decorator mejora las responsabilidades\n• Composite: Estructura similar pero intención diferente - Composite representa jerarquías parte-todo\n• Strategy: Cambia el interior de un objeto; Decorator cambia el exterior",
    "Tags": "related-patterns decorator structural",
    "Category": "Structural",
    "Page": "53"
  },
  {
    "FrontEN": "What are key implementation considerations for the Decorator pattern?",
    "BackEN": "• Decorator must have same interface as component it decorates\n• Keep Component classes lightweight - focus on interface not storage\n• Use transparent enclosure - decorator forwards all requests by default\n• Decorator can add operations before/after forwarding",
    "FrontES": "¿Cuáles son las consideraciones de implementación clave para el patrón Decorator?",
    "BackES": "• Mantener interfaz del componente simple para permitir decoración flexible\n• Omitir la clase Decorator abstracta si solo necesitas un decorador\n• Mantener ligeras las clases Component para evitar sobrecarga por decoración\n• Los decoradores deben actuar como proxies transparentes",
    "Tags": "implementation decorator structural",
    "Category": "Structural",
    "Page": "53"
  },
  {
    "FrontEN": "What are real-world examples of the Decorator pattern?",
    "BackEN": "• Scrollable and bordered windows\n• Stream decorators (BufferedInputStream, etc.)\n• UI component embellishments",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Decorator?",
    "BackES": "• Añadir bordes y barras de desplazamiento a componentes de UI\n• Flujos de E/S con características como buffering, compresión, encriptación\n• Embellecimientos de texto con diferentes estilos de formato",
    "Tags": "real-world decorator structural",
    "Category": "Structural",
    "Page": "53"
  },
  {
    "FrontEN": "What is the intent of the Abstract Factory pattern?",
    "BackEN": "Provide an interface for creating families of related or dependent objects without specifying their concrete classes.",
    "FrontES": "¿Cuál es la intención del patrón Abstract Factory?",
    "BackES": "Proporcionar una interfaz para crear familias de objetos relacionados o dependientes sin especificar sus clases concretas.",
    "Tags": "intent abstract-factory creational",
    "Category": "Creational",
    "Page": "54"
  },
  {
    "FrontEN": "When would you use the Abstract Factory pattern?",
    "BackEN": "• System should be independent of how its products are created\n• System should be configured with one of multiple families of products\n• Family of related product objects is designed to be used together\n• You want to provide class library of products and reveal only interfaces",
    "FrontES": "¿Cuándo usarías el patrón Abstract Factory?",
    "BackES": "• Un sistema debe ser independiente de cómo se crean, componen y representan sus productos\n• Un sistema debe configurarse con una de múltiples familias de productos\n• Una familia de objetos de producto relacionados está diseñada para usarse juntos\n• Quieres proporcionar una biblioteca de productos y solo revelar sus interfaces, no sus implementaciones",
    "Tags": "use-case abstract-factory creational",
    "Category": "Creational",
    "Page": "54"
  },
  {
    "FrontEN": "What are the key participants in the Abstract Factory pattern?",
    "BackEN": "• AbstractFactory (GUIFactory): Declares interface for operations that create abstract product objects\n• ConcreteFactory (MotifFactory, PMFactory): Implements operations to create concrete product objects\n• AbstractProduct (ScrollBar, Button): Declares interface for a type of product object\n• ConcreteProduct (MotifScrollBar, PMButton): Defines product object to be created by corresponding concrete factory\n• Client: Uses only interfaces declared by AbstractFactory and AbstractProduct",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Abstract Factory?",
    "BackES": "• AbstractFactory (WidgetFactory): Declara interfaz para operaciones que crean objetos producto abstractos\n• ConcreteFactory (MotifWidgetFactory, PMWidgetFactory): Implementa operaciones para crear objetos producto concretos\n• AbstractProduct (ScrollBar, Window): Declara interfaz para un tipo de objeto producto\n• ConcreteProduct (MotifScrollBar, PMWindow): Define un objeto producto para ser creado por la fábrica correspondiente\n• Client: Usa solo interfaces declaradas por AbstractFactory y AbstractProduct",
    "Tags": "key-concepts abstract-factory creational",
    "Category": "Creational",
    "Page": "55"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Abstract Factory pattern?",
    "BackEN": "Benefits:\n• Isolates concrete classes from clients\n• Makes exchanging product families easy\n• Promotes consistency among products\n• Supports different look-and-feel standards\n\nDrawbacks:\n• Supporting new kinds of products is difficult\n• Abstract factory interface must be extended to create new products",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Abstract Factory?",
    "BackES": "Beneficios:\n• Aísla clases concretas de los clientes\n• Facilita el intercambio de familias de productos\n• Promueve la consistencia entre productos\n• Soporta configuración flexible\n\nDesventajas:\n• Difícil de extender para soportar nuevos tipos de productos\n• Puede llevar a muchas clases pequeñas",
    "Tags": "benefits-drawbacks abstract-factory creational",
    "Category": "Creational",
    "Page": "58"
  },
  {
    "FrontEN": "What patterns are related to the Abstract Factory pattern?",
    "BackEN": "• Factory Method: Abstract Factory classes often implemented with Factory Methods\n• Prototype: Concrete factory can be implemented using Prototype\n• Singleton: Concrete factory is often a Singleton",
    "FrontES": "¿Qué patrones están relacionados con el patrón Abstract Factory?",
    "BackES": "• Factory Method: A menudo implementado usando métodos factory\n• Singleton: Las fábricas concretas a menudo son singletons\n• Prototype: Las fábricas pueden usar Prototype para clonar productos predefinidos",
    "Tags": "related-patterns abstract-factory creational",
    "Category": "Creational",
    "Page": "58"
  },
  {
    "FrontEN": "What are key implementation considerations for the Abstract Factory pattern?",
    "BackEN": "• Factories are often singletons\n• Creating products - usually use Factory Method\n• Can use Prototype to eliminate need for new ConcreteFactory class\n• Define extensible factories using parameters to specify products",
    "FrontES": "¿Cuáles son las consideraciones de implementación clave para el patrón Abstract Factory?",
    "BackES": "• Las fábricas suelen implementarse como singletons\n• Crear productos usando Factory Method o Prototype\n• Definir fábrica extensible añadiendo parámetro a operaciones de creación\n• AbstractFactory solo declara interfaz para crear productos; responsabilidad del ConcreteProduct crearlos",
    "Tags": "implementation abstract-factory creational",
    "Category": "Creational",
    "Page": "58"
  },
  {
    "FrontEN": "What are real-world examples of the Abstract Factory pattern?",
    "BackEN": "• UI toolkit widgets for different look-and-feel standards (Motif, Windows, Mac)\n• Database access layers supporting multiple database vendors\n• Cross-platform UI frameworks",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Abstract Factory?",
    "BackES": "• Widgets de toolkit de UI para diferentes estándares de apariencia (Motif, Windows, Mac)\n• Capas de acceso a base de datos que soportan múltiples proveedores de base de datos\n• Frameworks de UI multiplataforma",
    "Tags": "real-world abstract-factory creational",
    "Category": "Creational",
    "Page": "58"
  },
  {
    "FrontEN": "What is the intent of the Bridge pattern?",
    "BackEN": "Decouple an abstraction from its implementation so that the two can vary independently.",
    "FrontES": "¿Cuál es la intención del patrón Bridge?",
    "BackES": "Desacoplar una abstracción de su implementación para que ambas puedan variar independientemente.",
    "Tags": "intent bridge structural",
    "Category": "Structural",
    "Page": "58"
  },
  {
    "FrontEN": "When would you use the Bridge pattern?",
    "BackEN": "• Want to avoid permanent binding between abstraction and implementation\n• Both abstractions and implementations should be extensible by subclassing\n• Changes in implementation should not impact clients\n• Want to hide implementation from clients\n• Want to share implementation among multiple objects",
    "FrontES": "¿Cuándo usarías el patrón Bridge?",
    "BackES": "• Quieres evitar un enlace permanente entre abstracción e implementación\n• Tanto las abstracciones como las implementaciones deben ser extensibles mediante subclasificación\n• Los cambios en la implementación no deben impactar a los clientes\n• Quieres ocultar la implementación de los clientes\n• Quieres compartir implementación entre múltiples objetos",
    "Tags": "use-case bridge structural",
    "Category": "Structural",
    "Page": "59"
  },
  {
    "FrontEN": "What are the key participants in the Bridge pattern?",
    "BackEN": "• Abstraction (Window): Defines abstraction's interface and maintains reference to Implementor\n• RefinedAbstraction (ApplicationWindow, IconWindow): Extends interface defined by Abstraction\n• Implementor (WindowImp): Defines interface for implementation classes\n• ConcreteImplementor (XWindowImp, PMWindowImp): Implements Implementor interface and defines concrete implementation",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Bridge?",
    "BackES": "• Abstraction (Window): Define la interfaz de la abstracción y mantiene referencia al Implementor\n• RefinedAbstraction (ApplicationWindow, IconWindow): Extiende la interfaz definida por Abstraction\n• Implementor (WindowImp): Define la interfaz para las clases de implementación\n• ConcreteImplementor (XWindowImp, PMWindowImp): Implementa la interfaz Implementor y define la implementación concreta",
    "Tags": "key-concepts bridge structural",
    "Category": "Structural",
    "Page": "61"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Bridge pattern?",
    "BackEN": "Benefits:\n• Decouples interface and implementation\n• Improves extensibility - abstraction and implementation hierarchies can vary independently\n• Hides implementation details from clients\n• Allows run-time binding of implementation\n\nDrawbacks:\n• Increased complexity due to additional indirection",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Bridge?",
    "BackES": "Beneficios:\n• Desacopla interfaz e implementación\n• Mejora la extensibilidad - las jerarquías de abstracción e implementación pueden variar independientemente\n• Oculta los detalles de implementación de los clientes\n• Permite enlace de implementación en tiempo de ejecución\n\nDesventajas:\n• Mayor complejidad debido a la indirección adicional",
    "Tags": "benefits-drawbacks bridge structural",
    "Category": "Structural",
    "Page": "64"
  },
  {
    "FrontEN": "What patterns are related to the Bridge pattern?",
    "BackEN": "• Abstract Factory: Can create and configure particular Bridge\n• Adapter: Makes unrelated classes work together; Bridge designed up-front",
    "FrontES": "¿Qué patrones están relacionados con el patrón Bridge?",
    "BackES": "• Abstract Factory: Puede crear y configurar un Bridge particular\n• Adapter: Hace que clases no relacionadas funcionen juntas; Bridge se diseña desde el principio",
    "Tags": "related-patterns bridge structural",
    "Category": "Structural",
    "Page": "64"
  },
  {
    "FrontEN": "What are key implementation considerations for the Bridge pattern?",
    "BackEN": "• Create Implementor when Abstraction is created, or choose from existing implementations\n• Share Implementors among multiple Abstractions\n• Use Abstract Factory to create and configure particular Bridge\n• Window's interface caters to application programmers while WindowImp caters to window systems",
    "FrontES": "¿Cuáles son las consideraciones de implementación clave para el patrón Bridge?",
    "BackES": "• Crear Implementor cuando se crea Abstraction, o elegir de implementaciones existentes\n• Compartir Implementors entre múltiples Abstractions\n• Usar Abstract Factory para crear y configurar un Bridge particular\n• La interfaz de Window atiende a programadores de aplicaciones mientras que WindowImp atiende a sistemas de ventanas",
    "Tags": "implementation bridge structural",
    "Category": "Structural",
    "Page": "63"
  },
  {
    "FrontEN": "What are real-world examples of the Bridge pattern?",
    "BackEN": "• Window abstractions with platform-specific implementations (X11, Windows, Mac)\n• Device-independent graphics libraries\n• Persistent object stores with different back-ends",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Bridge?",
    "BackES": "• Abstracciones de ventanas con implementaciones específicas de plataforma (X11, Windows, Mac)\n• Bibliotecas gráficas independientes de dispositivo\n• Almacenes de objetos persistentes con diferentes backends",
    "Tags": "real-world bridge structural",
    "Category": "Structural",
    "Page": "64"
  },
  {
    "FrontEN": "Which patterns use the concept 'Encapsulation of Variation'?",
    "BackEN": "Identify the aspects that vary and separate them from what stays the same.\n\nPatterns: Strategy, Abstract Factory, Bridge, Decorator\n\nStrategy encapsulates formatting algorithms, Abstract Factory encapsulates widget families, Bridge encapsulates window implementations, and Decorator encapsulates embellishments.",
    "FrontES": "¿Qué patrones usan el concepto 'Encapsulación de la Variación'?",
    "BackES": "Identificar los aspectos que varían y separarlos de lo que permanece igual.\n\nPatrones: Strategy, Abstract Factory, Bridge, Decorator\n\nStrategy encapsula algoritmos de formato, Abstract Factory encapsula familias de widgets, Bridge encapsula implementaciones de ventanas y Decorator encapsula embellecimientos.",
    "Tags": "cross-cutting encapsulation-of-variation",
    "Category": "Cross-Cutting",
    "Page": "42"
  },
  {
    "FrontEN": "Which patterns use the concept 'Composition over Inheritance'?",
    "BackEN": "Favor object composition over class inheritance to achieve flexibility. New functionality is added by composing objects in new ways rather than defining new subclasses. Reduces class explosion and enables run-time configuration.\n\nPatterns: Composite, Decorator, Strategy, Bridge",
    "FrontES": "¿Qué patrones usan el concepto 'Composición sobre Herencia'?",
    "BackES": "Favorecer la composición de objetos sobre la herencia de clases para lograr flexibilidad. La nueva funcionalidad se añade componiendo objetos de nuevas formas en lugar de definir nuevas subclases. Reduce la explosión de clases y permite configuración en tiempo de ejecución.\n\nPatrones: Composite, Decorator, Strategy, Bridge",
    "Tags": "cross-cutting composition-over-inheritance",
    "Category": "Cross-Cutting",
    "Page": "42"
  },
  {
    "FrontEN": "Which patterns use the concept 'Program to Interface, not Implementation'?",
    "BackEN": "Clients should remain unaware of specific types and classes of objects they use. Declare variables to be instances of abstract classes and commit only to interfaces defined by abstract classes.\n\nPatterns: Abstract Factory, Strategy, Bridge, Composite",
    "FrontES": "¿Qué patrones usan el concepto 'Programar a Interfaz, no a Implementación'?",
    "BackES": "Los clientes deben permanecer sin conocimiento de los tipos y clases específicos de objetos que usan. Declarar variables para que sean instancias de clases abstractas y comprometerse solo a interfaces definidas por clases abstractas.\n\nPatrones: Abstract Factory, Strategy, Bridge, Composite",
    "Tags": "cross-cutting program-to-interface",
    "Category": "Cross-Cutting",
    "Page": "42"
  },
  {
    "FrontEN": "Which patterns use the concept 'Separation of Concerns'?",
    "BackEN": "Separate different aspects of a design into independent parts.\n\nPatterns: Bridge, Strategy, Abstract Factory\n\nBridge separates window abstraction from implementation, Strategy separates formatting from document structure, Abstract Factory separates product creation from use.",
    "FrontES": "¿Qué patrones usan el concepto 'Separación de Preocupaciones'?",
    "BackES": "Separar diferentes aspectos de un diseño en partes independientes.\n\nPatrones: Bridge, Strategy, Abstract Factory\n\nBridge separa la abstracción de ventana de la implementación, Strategy separa el formato de la estructura del documento, Abstract Factory separa la creación de productos del uso.",
    "Tags": "cross-cutting separation-of-concerns",
    "Category": "Cross-Cutting",
    "Page": "42"
  },
  {
    "FrontEN": "Which patterns use the concept 'Delegation'?",
    "BackEN": "Make composition as powerful as inheritance by having receiving object delegate operations to its delegate.\n\nPatterns: Decorator, Strategy, Bridge\n\nDecorator delegates to component, Strategy context delegates to strategy object, Bridge abstraction delegates to implementor.",
    "FrontES": "¿Qué patrones usan el concepto 'Delegación'?",
    "BackES": "Hacer que la composición sea tan poderosa como la herencia haciendo que el objeto receptor delegue operaciones a su delegado.\n\nPatrones: Decorator, Strategy, Bridge\n\nDecorator delega al componente, el contexto de Strategy delega al objeto strategy, la abstracción de Bridge delega al implementor.",
    "Tags": "cross-cutting delegation",
    "Category": "Cross-Cutting",
    "Page": "42"
  },
  {
    "FrontEN": "Compare Composite vs Decorator",
    "BackEN": "Similarities:\n• Both use recursive composition\n• Similar structure with component references\n• Both part of Structural patterns\n\nDifferences:\n• Composite: Treats groups uniformly, can have multiple children, represents part-whole hierarchies\n• Decorator: Adds responsibilities, single child (transparent enclosure), enhances behavior\n\nWhen to use each:\n• Composite: When you need hierarchical tree structures\n• Decorator: When you need to add responsibilities dynamically",
    "FrontES": "Comparar Composite vs Decorator",
    "BackES": "Similitudes:\n• Ambos usan composición recursiva\n• Estructura similar con referencias a componentes\n• Ambos son patrones estructurales\n\nDiferencias:\n• Composite: Trata grupos uniformemente, puede tener múltiples hijos, representa jerarquías parte-todo\n• Decorator: Añade responsabilidades, un solo hijo (envoltura transparente), mejora el comportamiento\n\nCuándo usar cada uno:\n• Composite: Cuando necesitas estructuras jerárquicas de árbol\n• Decorator: Cuando necesitas añadir responsabilidades dinámicamente",
    "Tags": "comparison composite decorator structural",
    "Category": "Comparison",
    "Page": "47"
  },
  {
    "FrontEN": "Compare Strategy vs State",
    "BackEN": "Similarities:\n• Similar structure with context and strategy/state object\n• Both encapsulate behavior in separate objects\n• Both allow behavior changes at runtime\n\nDifferences:\n• Strategy: About interchangeable algorithms, client usually specifies which strategy\n• State: About object's internal state, state transitions often automatic\n\nWhen to use each:\n• Strategy: When you have multiple algorithms for same task\n• State: When object behavior depends on its state",
    "FrontES": "Comparar Strategy vs State",
    "BackES": "Similitudes:\n• Estructura similar con contexto y objeto strategy/state\n• Ambos encapsulan comportamiento en objetos separados\n• Ambos permiten cambios de comportamiento en tiempo de ejecución\n\nDiferencias:\n• Strategy: Sobre algoritmos intercambiables, el cliente usualmente especifica qué strategy\n• State: Sobre el estado interno del objeto, las transiciones de estado a menudo son automáticas\n\nCuándo usar cada uno:\n• Strategy: Cuando tienes múltiples algoritmos para la misma tarea\n• State: Cuando el comportamiento del objeto depende de su estado",
    "Tags": "comparison strategy state behavioral",
    "Category": "Comparison",
    "Page": "50"
  },
  {
    "FrontEN": "Compare Abstract Factory vs Factory Method",
    "BackEN": "Similarities:\n• Both are Creational patterns\n• Both defer object creation\n• Both work with families of related objects\n\nDifferences:\n• Abstract Factory: Creates families of related products through object composition\n• Factory Method: Creates one product using inheritance/subclassing\n\nWhen to use each:\n• Abstract Factory: When you need to create families of related objects\n• Factory Method: When you need to defer instantiation to subclasses",
    "FrontES": "Comparar Abstract Factory vs Factory Method",
    "BackES": "Similitudes:\n• Ambos son patrones creacionales\n• Ambos difieren la creación de objetos\n• Ambos trabajan con familias de objetos relacionados\n\nDiferencias:\n• Abstract Factory: Crea familias de productos relacionados a través de composición de objetos\n• Factory Method: Crea un producto usando herencia/subclasificación\n\nCuándo usar cada uno:\n• Abstract Factory: Cuando necesitas crear familias de objetos relacionados\n• Factory Method: Cuando necesitas diferir la instanciación a subclases",
    "Tags": "comparison abstract-factory factory-method creational",
    "Category": "Comparison",
    "Page": "58"
  },
  {
    "FrontEN": "Compare Bridge vs Adapter",
    "BackEN": "Similarities:\n• Both separate interface from implementation\n• Both use composition\n• Both are Structural patterns\n\nDifferences:\n• Bridge: Designed up-front to let abstractions and implementations vary independently\n• Adapter: Makes unrelated classes work together after they're designed, changes interface\n\nWhen to use each:\n• Bridge: When designing new code to support multiple implementations\n• Adapter: When integrating existing incompatible interfaces",
    "FrontES": "Comparar Bridge vs Adapter",
    "BackES": "Similitudes:\n• Ambos separan interfaz de implementación\n• Ambos usan composición\n• Ambos son patrones estructurales\n\nDiferencias:\n• Bridge: Diseñado desde el principio para permitir que abstracciones e implementaciones varíen independientemente\n• Adapter: Hace que clases no relacionadas funcionen juntas después de que están diseñadas, cambia la interfaz\n\nCuándo usar cada uno:\n• Bridge: Al diseñar código nuevo para soportar múltiples implementaciones\n• Adapter: Al integrar interfaces incompatibles existentes",
    "Tags": "comparison bridge adapter structural",
    "Category": "Comparison",
    "Page": "64"
  },
  {
    "FrontEN": "What is the intent of the Command pattern?",
    "BackEN": "Encapsulate a request as an object, thereby letting you parameterize clients with different requests, queue or log requests, and support undoable operations.",
    "FrontES": "¿Cuál es la intención del patrón Command?",
    "BackES": "Encapsular una solicitud como un objeto, permitiendo así parametrizar clientes con diferentes solicitudes, poner en cola o registrar solicitudes, y soportar operaciones que se puedan deshacer.",
    "Tags": "intent command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "When would you use the Command pattern?",
    "BackEN": "• Parameterize objects by an action to perform (callback-like mechanism)\n• Specify, queue, and execute requests at different times\n• Support undo/redo with Execute and Unexecute operations\n• Support logging changes for crash recovery\n• Structure a system around high-level operations built on primitive operations",
    "FrontES": "¿Cuándo usarías el patrón Command?",
    "BackES": "• Parametrizar objetos por una acción a realizar (mecanismo similar a callback)\n• Especificar, poner en cola y ejecutar solicitudes en diferentes momentos\n• Soportar deshacer/rehacer con operaciones Execute y Unexecute\n• Soportar registro de cambios para recuperación de fallos\n• Estructurar un sistema alrededor de operaciones de alto nivel construidas sobre operaciones primitivas",
    "Tags": "use-case command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What are the key participants in the Command pattern?",
    "BackEN": "• Command: Declares interface for executing an operation with Execute() method\n• ConcreteCommand: Implements Execute by invoking operations on Receiver, stores state for undo\n• Client: Creates ConcreteCommand object and sets its receiver\n• Invoker: Asks the command to carry out the request by calling Execute\n• Receiver: Knows how to perform the operations to carry out the request",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Command?",
    "BackES": "• Command: Declara interfaz para ejecutar una operación con método Execute()\n• ConcreteCommand: Implementa Execute invocando operaciones en Receiver, almacena estado para deshacer\n• Client: Crea objeto ConcreteCommand y establece su receptor\n• Invoker: Pide al comando que ejecute la solicitud llamando a Execute\n• Receiver: Sabe cómo realizar las operaciones para llevar a cabo la solicitud",
    "Tags": "key-concepts command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Command pattern?",
    "BackEN": "Benefits:\n• Decouples object that invokes operation from one that knows how to perform it\n• Commands are first-class objects that can be manipulated and extended\n• Can assemble commands into composite commands using Composite pattern\n• Easy to add new Commands without changing existing classes\n\nDrawbacks:\n• Can result in many small command classes\n• Complexity increases with command history and undo/redo mechanisms",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Command?",
    "BackES": "Beneficios:\n• Desacopla el objeto que invoca la operación de aquel que sabe cómo realizarla\n• Los comandos son objetos de primera clase que pueden ser manipulados y extendidos\n• Puede ensamblar comandos en comandos compuestos usando el patrón Composite\n• Fácil añadir nuevos Commands sin cambiar clases existentes\n\nDesventajas:\n• Puede resultar en muchas clases de comando pequeñas\n• La complejidad aumenta con el historial de comandos y mecanismos de deshacer/rehacer",
    "Tags": "benefits-drawbacks command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What patterns are related to the Command pattern?",
    "BackEN": "• Composite: Can be used to implement MacroCommands\n• Memento: Can keep state for undoing effects\n• Prototype: Commands that must be copied before being placed on history list act as prototypes",
    "FrontES": "¿Qué patrones están relacionados con el patrón Command?",
    "BackES": "• Composite: Puede usarse para implementar MacroCommands\n• Memento: Puede mantener el estado para deshacer efectos\n• Prototype: Los comandos que deben ser copiados antes de colocarse en la lista de historial actúan como prototipos",
    "Tags": "related-patterns command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What are key implementation considerations for the Command pattern?",
    "BackEN": "• Add Unexecute operation to Command interface for undo/redo support\n• Add Reversible operation to determine if command is undoable at runtime\n• Maintain command history as list of executed/unexecuted commands\n• Track present position in history for undo (move left) and redo (move right)\n• Commands may delegate all, part, or none of implementation to other objects",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Command?",
    "BackES": "• Añadir operación Unexecute a la interfaz Command para soporte de deshacer/rehacer\n• Añadir operación Reversible para determinar si el comando es deshacible en tiempo de ejecución\n• Mantener historial de comandos como lista de comandos ejecutados/no ejecutados\n• Rastrear posición actual en el historial para deshacer (mover a la izquierda) y rehacer (mover a la derecha)\n• Los comandos pueden delegar toda, parte o ninguna implementación a otros objetos",
    "Tags": "implementation command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What are real-world examples of the Command pattern?",
    "BackEN": "• Menu items and buttons in GUI applications\n• Undo/redo functionality in document editors\n• Transaction systems and logging mechanisms\n• Request queuing and scheduling systems",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Command?",
    "BackES": "• Elementos de menú y botones en aplicaciones GUI\n• Funcionalidad de deshacer/rehacer en editores de documentos\n• Sistemas de transacciones y mecanismos de registro\n• Sistemas de cola de solicitudes y planificación",
    "Tags": "real-world command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What are common misuses of the Command pattern?",
    "BackEN": "• Creating too many small command classes without justification\n• Implementing complex undo/redo without proper command history management\n• Not properly managing state in commands, making undo operations unreliable\n• Overcomplicating simple operations that don't need the full command infrastructure",
    "FrontES": "¿Cuáles son los usos incorrectos comunes del patrón Command?",
    "BackES": "• Crear demasiadas clases de comando pequeñas sin justificación\n• Implementar deshacer/rehacer complejo sin gestión adecuada del historial de comandos\n• No gestionar correctamente el estado en los comandos, haciendo que las operaciones de deshacer no sean confiables\n• Sobrecomplicar operaciones simples que no necesitan toda la infraestructura de comandos",
    "Tags": "anti-pattern command behavioral",
    "Category": "Behavioral",
    "Page": "66"
  },
  {
    "FrontEN": "What is the intent of the Iterator pattern?",
    "BackEN": "Provide a way to access the elements of an aggregate object sequentially without exposing its underlying representation.",
    "FrontES": "¿Cuál es la intención del patrón Iterator?",
    "BackES": "Proporcionar una forma de acceder a los elementos de un objeto agregado secuencialmente sin exponer su representación subyacente.",
    "Tags": "intent iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "When would you use the Iterator pattern?",
    "BackEN": "• Access aggregate object's contents without exposing internal representation\n• Support multiple traversals of aggregate objects\n• Provide uniform interface for traversing different aggregate structures",
    "FrontES": "¿Cuándo usarías el patrón Iterator?",
    "BackES": "• Acceder al contenido de un objeto agregado sin exponer su representación interna\n• Soportar múltiples recorridos de objetos agregados\n• Proporcionar una interfaz uniforme para recorrer diferentes estructuras agregadas",
    "Tags": "use-case iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What are the key participants in the Iterator pattern?",
    "BackEN": "• Iterator: Defines interface for accessing and traversing elements with First(), Next(), IsDone(), CurrentItem()\n• ConcreteIterator: Implements Iterator interface and keeps track of current position in traversal\n• Aggregate: Defines interface for creating Iterator object via CreateIterator()\n• ConcreteAggregate: Implements CreateIterator to return instance of proper ConcreteIterator based on internal structure",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Iterator?",
    "BackES": "• Iterator: Define interfaz para acceder y recorrer elementos con First(), Next(), IsDone(), CurrentItem()\n• ConcreteIterator: Implementa interfaz Iterator y mantiene seguimiento de la posición actual en el recorrido\n• Aggregate: Define interfaz para crear objeto Iterator mediante CreateIterator()\n• ConcreteAggregate: Implementa CreateIterator para devolver instancia del ConcreteIterator apropiado basado en estructura interna",
    "Tags": "key-concepts iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Iterator pattern?",
    "BackEN": "Benefits:\n• Supports variations in traversal of aggregate\n• Iterators simplify Aggregate interface\n• More than one traversal can be active on aggregate simultaneously\n• Hides internal structure of aggregate from clients\n\nDrawbacks:\n• Additional complexity from iterator class hierarchy\n• Cursor handling can be tricky with concurrent modifications",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Iterator?",
    "BackES": "Beneficios:\n• Soporta variaciones en el recorrido del agregado\n• Los iteradores simplifican la interfaz del Aggregate\n• Puede haber más de un recorrido activo en el agregado simultáneamente\n• Oculta la estructura interna del agregado de los clientes\n\nDesventajas:\n• Complejidad adicional por la jerarquía de clases de iteradores\n• El manejo de cursores puede ser complicado con modificaciones concurrentes",
    "Tags": "benefits-drawbacks iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What patterns are related to the Iterator pattern?",
    "BackEN": "• Composite: Iterators often used to traverse Composite structures\n• Factory Method: Polymorphic iterators rely on factory methods to instantiate appropriate iterator\n• Memento: Can be used with Iterator to capture state of iteration",
    "FrontES": "¿Qué patrones están relacionados con el patrón Iterator?",
    "BackES": "• Composite: Los iteradores a menudo se usan para recorrer estructuras Composite\n• Factory Method: Los iteradores polimórficos dependen de métodos de fábrica para instanciar el iterador apropiado\n• Memento: Puede usarse con Iterator para capturar el estado de la iteración",
    "Tags": "related-patterns iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What are key implementation considerations for the Iterator pattern?",
    "BackEN": "• CreateIterator returns appropriate iterator type based on aggregate's internal structure\n• NullIterator for leaf elements (IsDone always returns true)\n• ListIterator/ArrayIterator for containers storing children in lists/arrays\n• PreorderIterator uses stack to maintain iterator state during traversal\n• Iterators can be parameterized by type in C++ using templates for reuse",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Iterator?",
    "BackES": "• CreateIterator devuelve el tipo de iterador apropiado basado en la estructura interna del agregado\n• NullIterator para elementos hoja (IsDone siempre devuelve true)\n• ListIterator/ArrayIterator para contenedores que almacenan hijos en listas/arrays\n• PreorderIterator usa pila para mantener el estado del iterador durante el recorrido\n• Los iteradores pueden ser parametrizados por tipo en C++ usando plantillas para reutilización",
    "Tags": "implementation iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "Iterator<Glyph*>* i = g->CreateIterator();\n\nfor (i->First(); !i->IsDone(); i->Next()) {\n  Glyph* child = i->CurrentItem();\n  // do something with current child\n}",
    "BackEN": "Pattern: Iterator\nKey elements: Basic iteration pattern using Iterator interface with First(), IsDone(), Next(), and CurrentItem() operations to traverse aggregate without exposing internal structure",
    "FrontES": "Iterator<Glyph*>* i = g->CreateIterator();\n\nfor (i->First(); !i->IsDone(); i->Next()) {\n  Glyph* child = i->CurrentItem();\n  // hacer algo con el hijo actual\n}",
    "BackES": "Patrón: Iterator\nElementos clave: Patrón de iteración básico usando interfaz Iterator con operaciones First(), IsDone(), Next() y CurrentItem() para recorrer agregado sin exponer estructura interna",
    "Tags": "code-example iterator behavioral cpp",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What are real-world examples of the Iterator pattern?",
    "BackEN": "• Traversing UI component hierarchies\n• Iterating over document structures\n• Collection iteration in standard libraries (STL, Java Collections)\n• Tree and graph traversal algorithms",
    "FrontES": "¿Cuál es la intención del patrón Visitor?",
    "BackES": "Representar una operación a realizar sobre los elementos de una estructura de objetos. Visitor permite definir una nueva operación sin cambiar las clases de los elementos sobre los que opera.",
    "Tags": "real-world iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What are common misuses of the Iterator pattern?",
    "BackEN": "• Not handling concurrent modifications to the collection during iteration\n• Creating overly complex iterator hierarchies when simple iteration suffices\n• Exposing internal collection structure through iterator implementation\n• Failing to provide consistent iteration semantics across different aggregate types",
    "FrontES": "¿Cuándo usarías el patrón Visitor?",
    "BackES": "• Una estructura de objetos contiene muchas clases con diferentes interfaces y deseas realizar operaciones que dependen de sus clases concretas\n• Muchas operaciones distintas y no relacionadas deben realizarse sobre objetos en una estructura y quieres evitar contaminar sus clases\n• Las clases que definen la estructura de objetos raramente cambian, pero frecuentemente quieres definir nuevas operaciones sobre la estructura",
    "Tags": "anti-pattern iterator behavioral",
    "Category": "Behavioral",
    "Page": "70"
  },
  {
    "FrontEN": "What is the intent of the Visitor pattern?",
    "BackEN": "Represent an operation to be performed on elements of an object structure. Visitor lets you define a new operation without changing the classes of the elements on which it operates.",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Visitor?",
    "BackES": "• Visitor: Declara operación Visit para cada clase de ConcreteElement en la estructura de objetos\n• ConcreteVisitor: Implementa cada operación declarada por Visitor, proporciona el contexto y almacena estado local\n• Element: Define operación Accept que toma un visitor como argumento\n• ConcreteElement: Implementa operación Accept que invoca operación Visit del visitor correspondiente a su clase\n• ObjectStructure: Puede enumerar sus elementos, puede proporcionar interfaz de alto nivel para permitir al visitor visitar sus elementos",
    "Tags": "intent visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "When would you use the Visitor pattern?",
    "BackEN": "• Object structure contains many classes with differing interfaces, and you want to perform operations that depend on concrete classes\n• Many distinct and unrelated operations need to be performed on objects in structure\n• Classes defining object structure rarely change, but you want to define new operations\n• Algorithm needs to access objects without exposing internal structure",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Visitor?",
    "BackES": "Beneficios:\n• Facilita añadir nuevas operaciones - simplemente añade un nuevo visitor\n• Un visitor reúne operaciones relacionadas y separa las no relacionadas\n• Visitor puede acumular estado mientras recorre la estructura\n• Permite romper encapsulación para acceder al estado interno de elementos\n\nDesventajas:\n• Dificulta añadir nuevas clases ConcreteElement - requiere cambiar interfaz Visitor y todos sus visitantes concretos\n• Puede romper encapsulación de elementos\n• Visitor puede necesitar atravesar estructuras complejas, aumentando el acoplamiento",
    "Tags": "use-case visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What are the key participants in the Visitor pattern?",
    "BackEN": "• Visitor: Declares Visit operation for each ConcreteElement class\n• ConcreteVisitor: Implements each Visit operation to perform algorithm fragment for corresponding element class\n• Element: Defines Accept operation that takes visitor as argument\n• ConcreteElement: Implements Accept to call appropriate visitor's Visit method for its class\n• ObjectStructure: Can enumerate elements and provide interface for visitor to visit elements",
    "FrontES": "¿Qué patrones están relacionados con el patrón Visitor?",
    "BackES": "• Composite: Los visitors pueden usarse para aplicar una operación sobre una estructura Composite\n• Interpreter: Visitor puede aplicarse para realizar interpretación\n• Iterator: Visitor puede usar Iterator para recorrer la estructura de objetos",
    "Tags": "key-concepts visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Visitor pattern?",
    "BackEN": "Benefits:\n• Makes adding new operations easy - just add new visitor\n• Gathers related operations and separates unrelated ones\n• Visitor can accumulate state as it traverses structure\n• Can work across class hierarchies without common parent\n\nDrawbacks:\n• Adding new ConcreteElement classes is hard - requires updating all visitors\n• Breaking encapsulation - visitor may need access to element's private state\n• Dependency between visitor and elements increases coupling",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Visitor?",
    "BackES": "• Doble despacho: Element llama Accept con visitor, que llama de vuelta al método Visit específico del tipo del elemento\n• Visitor puede ser responsable de recorrer la estructura o la estructura puede proporcionar un iterador\n• Cada ConcreteElement llama a la operación Visit con su tipo (VisitCharacter, VisitRow, etc.)\n• CheckMe puede devolver resultado booleano a través de estado del visitor\n• Visitor acumula resultados en variables de instancia a medida que recorre\n• Element::Accept puede implementarse simplemente como: void Element::Accept(Visitor& v) { v.VisitElement(this); }",
    "Tags": "benefits-drawbacks visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What patterns are related to the Visitor pattern?",
    "BackEN": "• Composite: Visitors can be used to apply operation over Composite structure\n• Interpreter: Visitor may be used to do interpretation",
    "FrontES": "void Character::Accept(Visitor& v) {\n  v.VisitCharacter(this);\n}\n\nvoid Rectangle::Accept(Visitor& v) {\n  v.VisitRectangle(this);\n}\n\nvoid Row::Accept(Visitor& v) {\n  v.VisitRow(this);\n}",
    "BackES": "Patrón: Visitor\nElementos clave: Cada ConcreteElement implementa Accept() que llama a la operación Visit específica de su tipo, habilitando doble despacho donde la operación depende tanto del tipo de visitor como del tipo de elemento",
    "Tags": "related-patterns visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What are key implementation considerations for the Visitor pattern?",
    "BackEN": "• Accept operation calls visitor's VisitConcreteElement(this) method\n• Visitor can accumulate state (e.g., SpellingCheckingVisitor accumulates characters and checks words)\n• Visitor interface has VisitX method for each element type X\n• Element passes itself to visitor enabling double-dispatch mechanism",
    "FrontES": "class SpellingCheckingVisitor : public Visitor {\npublic:\n  SpellingCheckingVisitor();\n  \n  virtual void VisitCharacter(Character*);\n  virtual void VisitRow(Row*);\n  virtual void VisitImage(Image*);\n  // ... otros elementos\n  \n  list<char*>& GetMisspellings();\nprivate:\n  char _currentWord[MAX_WORD_SIZE];\n  list<char*> _misspellings;\n};",
    "BackES": "Patrón: Visitor\nElementos clave: ConcreteVisitor implementa operaciones Visit para cada tipo de elemento, acumula resultados (palabras mal escritas) en estado, proporciona método para recuperar resultados después del recorrido",
    "Tags": "implementation visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "void SpellingChecker::CheckCharacter(Character* c) {\n  const char ch = c->GetCharCode();\n  if (isalpha(ch)) {\n    // append to _currentWord\n  } else {\n    if (IsMisspelled(_currentWord)) {\n      _misspellings.Append(strdup(_currentWord));\n    }\n    _currentWord[0] = '\\0';\n  }\n}",
    "BackEN": "Pattern: Visitor\nKey elements: Visitor accumulates state (_currentWord, _misspellings) and performs analysis on Character elements, demonstrating how visitors can maintain context across multiple element visits",
    "FrontES": "void SpellingCheckingVisitor::VisitCharacter(Character* c) {\n  const char ch = c->GetCharCode();\n  \n  if (isalpha(ch)) {\n    // añadir a palabra actual\n  } else {\n    // encontrado no-letra, revisar palabra actual\n    if (IsMisspelled(_currentWord)) {\n      _misspellings.Append(strdup(_currentWord));\n    }\n    _currentWord[0] = '\\0';\n  }\n}",
    "BackES": "Patrón: Visitor\nElementos clave: VisitCharacter acumula caracteres en palabra, verifica ortografía cuando encuentra límite de palabra, almacena errores ortográficos en lista, mantiene estado a través de múltiples visitas de elementos",
    "Tags": "code-example visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What are real-world examples of the Visitor pattern?",
    "BackEN": "• Spell checking and hyphenation in document editors\n• Compiler AST traversal for type checking and code generation\n• XML/HTML document processing and transformation\n• Scene graph traversal in graphics applications",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Visitor?",
    "BackES": "• Compiladores que recorren árboles de sintaxis abstracta (verificación de tipos, optimización, generación de código)\n• Verificación ortográfica en editores de texto\n• Operaciones de formato e impresión en estructuras de documentos\n• Herramientas de análisis de código que realizan múltiples análisis sobre el mismo AST",
    "Tags": "real-world visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What are common misuses of the Visitor pattern?",
    "BackEN": "• Using it when the element class hierarchy changes frequently\n• Breaking encapsulation by giving visitors excessive access to element internals\n• Creating visitors that are too tightly coupled to element implementation details\n• Not considering simpler alternatives when only one or two operations are needed",
    "FrontES": "¿Cuál es la intención del patrón Abstract Factory?",
    "BackES": "Proporcionar una interfaz para crear familias de objetos relacionados o dependientes sin especificar sus clases concretas.",
    "Tags": "anti-pattern visitor behavioral",
    "Category": "Behavioral",
    "Page": "75"
  },
  {
    "FrontEN": "What is the intent of the Abstract Factory pattern?",
    "BackEN": "Provide an interface for creating families of related or dependent objects without specifying their concrete classes.",
    "FrontES": "¿Cuándo usarías el patrón Abstract Factory?",
    "BackES": "• Un sistema debe ser independiente de cómo se crean, componen y representan sus productos\n• Un sistema debe configurarse con una de múltiples familias de productos\n• Una familia de objetos de producto relacionados está diseñada para usarse juntos, y necesitas hacer cumplir esta restricción\n• Quieres proporcionar una biblioteca de clases de productos y solo quieres revelar sus interfaces, no sus implementaciones",
    "Tags": "intent abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "When would you use the Abstract Factory pattern?",
    "BackEN": "• System should be independent of how its products are created, composed, and represented\n• System should be configured with one of multiple families of products\n• Family of related product objects is designed to be used together and you need to enforce this constraint\n• You want to provide class library of products and reveal just their interfaces, not implementations",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Abstract Factory?",
    "BackES": "• AbstractFactory: Declara una interfaz para operaciones que crean objetos de producto abstractos\n• ConcreteFactory: Implementa las operaciones para crear objetos de producto concretos\n• AbstractProduct: Declara una interfaz para un tipo de objeto de producto\n• ConcreteProduct: Define un objeto de producto a ser creado por la fábrica concreta correspondiente; implementa la interfaz AbstractProduct\n• Client: Usa solo interfaces declaradas por clases AbstractFactory y AbstractProduct",
    "Tags": "use-case abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What are the key participants in the Abstract Factory pattern?",
    "BackEN": "• AbstractFactory: Declares interface for operations that create abstract product objects\n• ConcreteFactory: Implements operations to create concrete product objects\n• AbstractProduct: Declares interface for a type of product object\n• ConcreteProduct: Defines product object to be created by corresponding concrete factory, implements AbstractProduct interface\n• Client: Uses only interfaces declared by AbstractFactory and AbstractProduct classes",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Abstract Factory?",
    "BackES": "Beneficios:\n• Aísla clases concretas - los clientes manipulan instancias a través de sus interfaces abstractas\n• Facilita el intercambio de familias de productos - la clase de una fábrica concreta aparece solo una vez en una aplicación\n• Promueve consistencia entre productos - objetos de producto diseñados para trabajar juntos\n\nDesventajas:\n• Dificulta el soporte de nuevos tipos de productos - requiere extender la interfaz de fábrica, lo que implica cambiar AbstractFactory y todas sus subclases",
    "Tags": "key-concepts abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Abstract Factory pattern?",
    "BackEN": "Benefits:\n• Isolates concrete classes from clients\n• Makes exchanging product families easy\n• Promotes consistency among products\n• Supports different look-and-feel standards\n\nDrawbacks:\n• Supporting new kinds of products is difficult\n• Abstract factory interface must be extended to create new products, requiring changes to AbstractFactory and all subclasses",
    "FrontES": "¿Qué patrones están relacionados con el patrón Abstract Factory?",
    "BackES": "• Factory Method: AbstractFactory a menudo se implementa con factory methods (pero también puede implementarse usando Prototype)\n• Singleton: Una fábrica concreta a menudo es un singleton\n• Prototype: AbstractFactory puede usar Prototype para crear objetos de producto",
    "Tags": "benefits-drawbacks abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What patterns are related to the Abstract Factory pattern?",
    "BackEN": "• Factory Method: Abstract Factory classes often implemented with Factory Methods\n• Prototype: Concrete factory can be implemented using Prototype\n• Singleton: Concrete factory is often a Singleton",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Abstract Factory?",
    "BackES": "• Las fábricas como singletons - una aplicación típicamente necesita solo una instancia de ConcreteFactory por familia de productos\n• Crear los productos - AbstractFactory solo declara interfaz para crear productos, ConcreteFactory debe especificar el producto concreto\n• Dos enfoques comunes: (1) Factory Method - requiere nueva subclase de fábrica concreta para cada familia, (2) Prototype - fábrica se inicializa con instancia prototipo, crea productos clonando prototipos\n• Definir fábricas extensibles - añadir parámetro a operaciones de creación que especifica el tipo de objeto a crear\n• Ventaja: no necesita cambiar interfaz de fábrica al añadir nuevos productos\n• Desventaja: todos los productos deben devolver el mismo tipo base, pierde seguridad de tipos",
    "Tags": "related-patterns abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What are key implementation considerations for the Abstract Factory pattern?",
    "BackEN": "• Factories are often singletons\n• Creating products - usually use Factory Method pattern\n• Can use Prototype to eliminate need for new ConcreteFactory class\n• Define extensible factories using parameters to specify products\n• Prototype-based: factory stores prototypes and clones them\n• Class-based (Smalltalk): factory stores classes and instantiates them",
    "FrontES": "class WidgetFactory {\npublic:\n  virtual ScrollBar* CreateScrollBar() = 0;\n  virtual Window* CreateWindow() = 0;\n};\n\nclass MotifWidgetFactory : public WidgetFactory {\npublic:\n  ScrollBar* CreateScrollBar() { return new MotifScrollBar; }\n  Window* CreateWindow() { return new MotifWindow; }\n};",
    "BackES": "Patrón: Abstract Factory\nElementos clave: AbstractFactory declara métodos de creación para cada tipo de producto, ConcreteFactory implementa estos métodos devolviendo productos concretos de la misma familia (Motif)",
    "Tags": "implementation abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "Maze* MazeGame::CreateMaze(MazeFactory& factory) {\n  Maze* aMaze = factory.MakeMaze();\n  Room* r1 = factory.MakeRoom(1);\n  Room* r2 = factory.MakeRoom(2);\n  Door* aDoor = factory.MakeDoor(r1, r2);\n  // ...\n}",
    "BackEN": "Pattern: Abstract Factory\nKey elements: Client creates maze using factory interface (MakeMaze, MakeRoom, MakeDoor) without knowing concrete classes, allowing different maze styles (enchanted, bombed) by swapping factory",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Abstract Factory?",
    "BackES": "• Kits de widgets de interfaz de usuario (Motif, Windows, Mac)\n• Temas/skins de aplicaciones\n• Soporte multiplataforma para componentes UI\n• Familias de productos en frameworks de juegos",
    "Tags": "code-example abstract-factory creational cpp",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What are real-world examples of the Abstract Factory pattern?",
    "BackEN": "• UI toolkit widgets for different look-and-feel standards (Motif, Windows, Mac)\n• Database access layers supporting multiple database vendors\n• Cross-platform UI frameworks",
    "FrontES": "¿Cuál es la intención del patrón Builder?",
    "BackES": "Separar la construcción de un objeto complejo de su representación para que el mismo proceso de construcción pueda crear diferentes representaciones.",
    "Tags": "real-world abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What are common misuses of the Abstract Factory pattern?",
    "BackEN": "• Using it when product families don't vary or only one implementation exists\n• Creating factory hierarchies that are too complex for the problem domain\n• Not properly enforcing that products from same family are used together\n• Adding too many product types to factory interface, making it unwieldy",
    "FrontES": "¿Cuándo usarías el patrón Builder?",
    "BackES": "• El algoritmo para crear un objeto complejo debe ser independiente de las partes que componen el objeto y cómo se ensamblan\n• El proceso de construcción debe permitir diferentes representaciones para el objeto que se construye\n• Necesitas construir objetos compuestos o agregados con diferentes implementaciones internas",
    "Tags": "anti-pattern abstract-factory creational",
    "Category": "Creational",
    "Page": "87"
  },
  {
    "FrontEN": "What is the intent of the Builder pattern?",
    "BackEN": "Separate the construction of a complex object from its representation so that the same construction process can create different representations.",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Builder?",
    "BackES": "• Builder: Especifica una interfaz abstracta para crear partes de un objeto Product\n• ConcreteBuilder: Construye y ensambla partes del producto implementando la interfaz Builder; define y mantiene la representación que crea; proporciona interfaz para recuperar el producto\n• Director: Construye un objeto usando la interfaz Builder\n• Product: Representa el objeto complejo bajo construcción; ConcreteBuilder construye la representación interna del producto y define el proceso por el cual se ensambla",
    "Tags": "intent builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "When would you use the Builder pattern?",
    "BackEN": "• Algorithm for creating complex object should be independent of parts that make up object and how they're assembled\n• Construction process must allow different representations for object that's constructed",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Builder?",
    "BackES": "Beneficios:\n• Permite variar la representación interna de un producto\n• Aísla el código para construcción y representación\n• Da control más fino sobre el proceso de construcción - construye el objeto paso a paso\n• Puede reutilizar el mismo proceso de construcción para crear diferentes representaciones\n\nDesventajas:\n• Requiere crear un ConcreteBuilder específico para cada tipo diferente de producto\n• Las clases Builder deben ser mutables\n• Puede complicar el código si el objeto de construcción es simple",
    "Tags": "use-case builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What are the key participants in the Builder pattern?",
    "BackEN": "• Builder: Specifies abstract interface for creating parts of Product object\n• ConcreteBuilder: Constructs and assembles parts of product by implementing Builder interface, defines and keeps track of representation it creates, provides interface for retrieving product\n• Director: Constructs object using Builder interface\n• Product: Represents complex object under construction, includes classes defining constituent parts and interfaces for assembling parts into final result",
    "FrontES": "¿Qué patrones están relacionados con el patrón Builder?",
    "BackES": "• Abstract Factory: Similar a Builder en que puede construir objetos complejos. La diferencia principal es que Builder se centra en construir un objeto complejo paso a paso, mientras Abstract Factory se centra en familias de objetos de producto\n• Composite: Lo que el builder a menudo construye es un composite",
    "Tags": "key-concepts builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Builder pattern?",
    "BackEN": "Benefits:\n• Lets you vary product's internal representation\n• Isolates code for construction and representation\n• Gives finer control over construction process than other creational patterns\n\nDrawbacks:\n• Requires creating ConcreteBuilder for each type of product\n• Builder classes can be complex if products are significantly different",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Builder?",
    "BackES": "• Interfaz de ensamblaje y construcción - builders construyen sus productos en pasos; por lo tanto, la interfaz de la clase Builder debe ser lo suficientemente general para permitir la construcción de productos para todos los tipos de builders concretos\n• Sin clase abstracta para productos - productos construidos por builders concretos difieren tanto en representación que hay poco que ganar de una clase padre común\n• Métodos vacíos como predeterminados en Builder - permite a los clientes anular solo las operaciones en las que están interesados\n• Director puede tomar Builder como argumento del constructor o tener un método para establecer el Builder",
    "Tags": "benefits-drawbacks builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What patterns are related to the Builder pattern?",
    "BackEN": "• Abstract Factory: Similar but Builder focuses on constructing complex object step by step while Abstract Factory emphasizes families of product objects\n• Composite: What the builder often builds",
    "FrontES": "class TextConverter {\npublic:\n  virtual void ConvertCharacter(char) { }\n  virtual void ConvertParagraph() { }\n};\n\nclass TeXConverter : public TextConverter {\npublic:\n  void ConvertCharacter(char c) {\n    // implementación específica de TeX\n  }\n  TeXText* GetTeXText() { return _texText; }\nprivate:\n  TeXText* _texText;\n};",
    "BackES": "Patrón: Builder\nElementos clave: Builder (TextConverter) define interfaz para construir partes, ConcreteBuilder (TeXConverter) implementa operaciones de construcción, proporciona método para recuperar producto construido",
    "Tags": "related-patterns builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What are key implementation considerations for the Builder pattern?",
    "BackEN": "• Builder interface must be general enough to construct products for all kinds of concrete builders\n• Products produced by builders often differ greatly, so little to gain from common parent class\n• Build methods intentionally not pure virtual in C++ - defined as empty methods so clients override only operations they're interested in\n• Example operations: BuildMaze(), BuildRoom(int), BuildDoor(int, int)",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Builder?",
    "BackES": "• Convertidores de formato de documentos (RTF a ASCII, HTML, TeX)\n• Constructores de consultas SQL\n• Constructores de objetos de configuración complejos\n• Generadores de formularios o interfaces de usuario",
    "Tags": "implementation builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "Maze* MazeGame::CreateMaze(MazeBuilder& builder) {\n  builder.BuildMaze();\n  builder.BuildRoom(1);\n  builder.BuildRoom(2);\n  builder.BuildDoor(1, 2);\n  return builder.GetMaze();\n}",
    "BackEN": "Pattern: Builder\nKey elements: Director uses builder interface to construct maze step by step (BuildMaze, BuildRoom, BuildDoor), allowing different builders to create different maze representations from same construction process",
    "FrontES": "¿Cuál es la intención del patrón Factory Method?",
    "BackES": "Definir una interfaz para crear un objeto, pero dejar que las subclases decidan qué clase instanciar. Factory Method permite que una clase difiera la instanciación a subclases.",
    "Tags": "code-example builder creational cpp",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What are real-world examples of the Builder pattern?",
    "BackEN": "• RTF document converters\n• Parser builders (Smalltalk-80 Parser and ProgramNodeBuilder)\n• Network service configuration (Adaptive Communications Environment)\n• UI form builders",
    "FrontES": "¿Cuándo usarías el patrón Factory Method?",
    "BackES": "• Una clase no puede anticipar la clase de objetos que debe crear\n• Una clase quiere que sus subclases especifiquen los objetos que crea\n• Las clases delegan responsabilidad a una de varias subclases auxiliares, y quieres localizar el conocimiento de qué subclase auxiliar es el delegado",
    "Tags": "real-world builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "What are common misuses of the Builder pattern?",
    "BackEN": "• Using it for simple objects where a constructor or factory method would suffice\n• Creating builders that are too tightly coupled to specific product implementations\n• Not providing default implementations for optional build steps\n• Confusing it with Abstract Factory when product families (not construction steps) are the main concern",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Factory Method?",
    "BackES": "• Product: Define la interfaz de objetos que el factory method crea\n• ConcreteProduct: Implementa la interfaz Product\n• Creator: Declara el factory method que devuelve un objeto de tipo Product; puede definir implementación predeterminada que devuelve un objeto ConcreteProduct predeterminado; puede llamar al factory method para crear un objeto Product\n• ConcreteCreator: Sobrescribe el factory method para devolver una instancia de ConcreteProduct",
    "Tags": "anti-pattern builder creational",
    "Category": "Creational",
    "Page": "97"
  },
  {
    "FrontEN": "Compare Abstract Factory vs Builder",
    "BackEN": "Similarities:\n• Both are creational patterns\n• Both create complex objects\n• Both abstract object creation from clients\n\nDifferences:\n• Intent: Abstract Factory creates families of related objects, Builder constructs complex object step by step\n• Focus: Abstract Factory emphasizes product families, Builder emphasizes construction process\n• Return: Abstract Factory returns product immediately, Builder constructs product gradually\n\nWhen to use each:\n• Abstract Factory: When you need families of related objects\n• Builder: When construction process is complex with many steps",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Factory Method?",
    "BackES": "Beneficios:\n• Elimina la necesidad de vincular clases específicas de la aplicación en tu código - el código solo trata con la interfaz Product\n• Proporciona ganchos para subclases - crear objetos dentro de una clase con factory method siempre es más flexible que crear directamente\n• Conecta jerarquías de clases paralelas\n\nDesventajas:\n• Puede requerir crear subclases solo para crear objetos de producto particulares\n• Los clientes podrían tener que subclasificar la clase Creator solo para crear un objeto ConcreteProduct particular",
    "Tags": "comparison abstract-factory builder",
    "Category": "Comparison",
    "Page": "87"
  },
  {
    "FrontEN": "What is the intent of the Factory Method pattern?",
    "BackEN": "Define an interface for creating an object, but let subclasses decide which class to instantiate. Factory Method lets a class defer instantiation to subclasses.",
    "FrontES": "¿Qué patrones están relacionados con el patrón Factory Method?",
    "BackES": "• Abstract Factory: A menudo se implementa con factory methods\n• Template Method: Factory methods usualmente se llaman dentro de template methods\n• Prototype: No requiere subclasificar Creator, pero a menudo requiere operación Initialize en Product; Factory Method no requiere tal inicialización",
    "Tags": "intent factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "When would you use the Factory Method pattern?",
    "BackEN": "• Class can't anticipate the class of objects it must create\n• Class wants its subclasses to specify the objects it creates\n• Classes delegate responsibility to one of several helper subclasses, and you want to localize knowledge of which helper subclass is delegate",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Factory Method?",
    "BackES": "• Dos variedades principales: (1) Creator es clase abstracta y no proporciona implementación para factory method, (2) Creator es clase concreta y proporciona implementación predeterminada para factory method\n• Factory methods parametrizados - factory method toma parámetro que identifica el tipo de objeto a crear\n• Factory method puede usar plantillas para evitar subclasificación\n• Convenciones de nomenclatura: usar nombres como \"CreateProduct\" o \"NewProduct\" para factory methods",
    "Tags": "use-case factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What are the key participants in the Factory Method pattern?",
    "BackEN": "• Product: Defines interface of objects the factory method creates\n• ConcreteProduct: Implements Product interface\n• Creator: Declares factory method returning object of type Product, may define default implementation, may call factory method to create Product object\n• ConcreteCreator: Overrides factory method to return instance of ConcreteProduct",
    "FrontES": "class Document {\npublic:\n  Document();\n  virtual void Open();\n  virtual void Close();\n  // ... otros\n  \n  virtual void Save();\n  \nprotected:\n  virtual Page* CreatePage() = 0;\n};",
    "BackES": "Patrón: Factory Method\nElementos clave: Creator (Document) declara factory method abstracto CreatePage() que las subclases sobrescriben para devolver subclases específicas de Product (Page)",
    "Tags": "key-concepts factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Factory Method pattern?",
    "BackEN": "Benefits:\n• Eliminates need to bind application-specific classes into code\n• Provides hooks for subclasses - creating objects inside class with factory method is more flexible than creating directly\n• Connects parallel class hierarchies (e.g., Figure-Manipulator hierarchies)\n\nDrawbacks:\n• Clients might have to subclass Creator just to create particular ConcreteProduct\n• Can cause proliferation of subclasses",
    "FrontES": "void Document::Save() {\n  Page* page = CreatePage();\n  // guardar página en disco\n}\n\nclass MyDocument : public Document {\nprotected:\n  Page* CreatePage() {\n    return new MyPage;\n  }\n};",
    "BackES": "Patrón: Factory Method\nElementos clave: Creator usa factory method (CreatePage) en sus operaciones, ConcreteCreator (MyDocument) sobrescribe factory method para devolver ConcreteProduct específico (MyPage)",
    "Tags": "benefits-drawbacks factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What patterns are related to the Factory Method pattern?",
    "BackEN": "• Abstract Factory: Often implemented with factory methods\n• Template Methods: Factory methods usually called within template methods\n• Prototype: Prototypes don't require subclassing Creator but often require Initialize operation",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Factory Method?",
    "BackES": "• Frameworks de aplicaciones (Application, Document)\n• Creadores de controles UI (Button, Checkbox creados por WidgetFactory)\n• Frameworks de persistencia (creación de objetos de almacenamiento)\n• Creación de objetos de conexión en capas de acceso a datos",
    "Tags": "related-patterns factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What are key implementation considerations for the Factory Method pattern?",
    "BackEN": "• Two main varieties: (1) Creator is abstract with no implementation, (2) Creator is concrete with default implementation\n• Parameterized factory methods can create multiple kinds of products based on parameter\n• Language-specific: C++ factory methods are virtual functions, Smalltalk uses class methods\n• Use lazy initialization to avoid calling factory methods in constructor\n• Naming conventions: use DoMakeClass() pattern (e.g., MacApp framework)\n• Templates can avoid subclassing in C++",
    "FrontES": "¿Cuál es la intención del patrón Prototype?",
    "BackES": "Especificar los tipos de objetos a crear usando una instancia prototípica, y crear nuevos objetos copiando este prototipo.",
    "Tags": "implementation factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "class MazeGame {\npublic:\n  Maze* CreateMaze();\n  virtual Maze* MakeMaze() const { return new Maze; }\n  virtual Room* MakeRoom(int n) const { return new Room(n); }\n  virtual Wall* MakeWall() const { return new Wall; }\n  virtual Door* MakeDoor(Room* r1, Room* r2) const { return new Door(r1, r2); }\n};",
    "BackEN": "Pattern: Factory Method\nKey elements: Creator class with factory methods (MakeMaze, MakeRoom, MakeWall, MakeDoor) that subclasses can override to change product types without modifying construction logic in CreateMaze",
    "FrontES": "¿Cuándo usarías el patrón Prototype?",
    "BackES": "• Cuando las clases a instanciar se especifican en tiempo de ejecución\n• Para evitar construir una jerarquía de clases de fábricas paralela a la jerarquía de clases de productos\n• Cuando las instancias de una clase pueden tener solo unas pocas combinaciones diferentes de estado\n• Cuando la creación de objetos es costosa",
    "Tags": "code-example factory-method creational cpp",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What are real-world examples of the Factory Method pattern?",
    "BackEN": "• Document creation in application frameworks (MacApp, ET++)\n• Figure manipulation tools in drawing editors (Unidraw)\n• View controllers in Smalltalk-80 MVC framework\n• Parser classes in compiler frameworks\n• Remote object proxies (Orbix ORB system)",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Prototype?",
    "BackES": "• Prototype: Declara una interfaz para clonarse a sí mismo\n• ConcretePrototype: Implementa una operación para clonarse a sí mismo\n• Client: Crea un nuevo objeto pidiendo a un prototipo que se clone a sí mismo",
    "Tags": "real-world factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What are common misuses of the Factory Method pattern?",
    "BackEN": "• Creating unnecessary subclasses when a simple parameter to constructor would suffice\n• Overusing it for simple object creation that doesn't need flexibility\n• Not providing sensible default implementation in Creator class\n• Confusing it with Simple Factory (which is not a design pattern)",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Prototype?",
    "BackES": "Beneficios:\n• Oculta las clases de producto concreto del cliente\n• Puede añadir y eliminar productos en tiempo de ejecución\n• Especificar nuevos objetos variando valores (por ejemplo, composición de objetos)\n• Especificar nuevos objetos variando estructura (crear objetos a partir de partes y subpartes)\n• Reduce el número de subclases - clona en lugar de pedir a factory method que cree\n\nDesventajas:\n• Cada subclase debe implementar operación Clone\n• Implementar Clone puede ser difícil si las clases ya existen o incluyen objetos que no soportan copia\n• Clonación profunda vs superficial puede ser compleja",
    "Tags": "anti-pattern factory-method creational",
    "Category": "Creational",
    "Page": "106"
  },
  {
    "FrontEN": "What is the intent of the Prototype pattern?",
    "BackEN": "Specify the kinds of objects to create using a prototypical instance, and create new objects by copying this prototype.",
    "FrontES": "¿Qué patrones están relacionados con el patrón Prototype?",
    "BackES": "• Abstract Factory: Puede usar Prototype para crear familias de productos\n• Composite: Prototype a menudo útil con Composite\n• Decorator: Prototype útil con Decorator",
    "Tags": "intent prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "When would you use the Prototype pattern?",
    "BackEN": "• Classes to instantiate are specified at run-time (e.g., by dynamic loading)\n• To avoid building class hierarchy of factories that parallels product class hierarchy\n• When instances of class can have one of only a few different combinations of state (install prototypes and clone rather than instantiate manually)",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Prototype?",
    "BackES": "• Usar un gestor de prototipos - cuando los prototipos del sistema se crean y destruyen dinámicamente, mantener un registro de prototipos disponibles\n• Operaciones Clone vs Copy - Clone es como un constructor y puede necesitar inicializar estados internos después de la copia\n• Clonación profunda vs superficial - Clone debe decidir si clonar toda la estructura (profunda) o compartir parte de ella (superficial)\n• Inicializar clones - algunos clientes querrán inicializar estado interno después de clonar; considerar pasar parámetros a Clone o añadir operación Initialize\n• En C++, proporcionar operación Clone virtual en clase base, usar copy constructor para implementación",
    "Tags": "use-case prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What are the key participants in the Prototype pattern?",
    "BackEN": "• Prototype: Declares interface for cloning itself\n• ConcretePrototype: Implements operation for cloning itself\n• Client: Creates new object by asking prototype to clone itself",
    "FrontES": "class Graphic {\npublic:\n  virtual Graphic* Clone() = 0;\n};\n\nclass Staff : public Graphic {\npublic:\n  Graphic* Clone() {\n    return new Staff(*this);\n  }\n};",
    "BackES": "Patrón: Prototype\nElementos clave: Prototype declara método Clone abstracto, ConcretePrototype implementa Clone típicamente usando copy constructor para crear una copia de sí mismo",
    "Tags": "key-concepts prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Prototype pattern?",
    "BackEN": "Benefits:\n• Adding and removing products at run-time\n• Specifying new objects by varying values\n• Specifying new objects by varying structure\n• Reduced subclassing - lets you clone prototype instead of asking factory method\n• Configuring application with classes dynamically\n\nDrawbacks:\n• Each subclass of Prototype must implement Clone operation which may be difficult\n• Implementing Clone is difficult when internals include objects that don't support copying or have circular references",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Prototype?",
    "BackES": "• Editor de partituras musicales (clonar notas musicales, pentagramas)\n• Editores gráficos (clonar formas, símbolos)\n• Sistemas CAD (clonar componentes)\n• Juegos (clonar enemigos, objetos con configuraciones complejas)",
    "Tags": "benefits-drawbacks prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What patterns are related to the Prototype pattern?",
    "BackEN": "• Abstract Factory: Competing patterns but can be used together - Abstract Factory might store prototypes to clone\n• Composite: Designs using Composite often benefit from Prototype\n• Decorator: Designs using Decorator often benefit from Prototype",
    "FrontES": "¿Cuál es la intención del patrón Singleton?",
    "BackES": "Asegurar que una clase tenga solo una instancia y proporcionar un punto de acceso global a ella.",
    "Tags": "related-patterns prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What are key implementation considerations for the Prototype pattern?",
    "BackEN": "• Use prototype manager (registry) when number of prototypes isn't fixed\n• Implementing Clone operation - shallow copy vs deep copy decision\n• Shallow copy is simple and often sufficient (Smalltalk default)\n• Deep copy needed when clone and original must be independent\n• Can use Save/Load to implement Clone (save to memory buffer, load back)\n• Initializing clones - may need Initialize operation to set internal state after cloning\n• Prototype manager is associative store that returns prototype matching given key",
    "FrontES": "¿Cuándo usarías el patrón Singleton?",
    "BackES": "• Debe haber exactamente una instancia de una clase, y debe ser accesible a los clientes desde un punto de acceso conocido\n• Cuando la instancia única debe ser extensible mediante subclasificación, y los clientes deben poder usar una instancia extendida sin modificar su código",
    "Tags": "implementation prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "class MazePrototypeFactory : public MazeFactory {\npublic:\n  MazePrototypeFactory(Maze*, Wall*, Room*, Door*);\n  virtual Wall* MakeWall() const { return _prototypeWall->Clone(); }\n  virtual Door* MakeDoor(Room* r1, Room* r2) const {\n    Door* door = _prototypeDoor->Clone();\n    door->Initialize(r1, r2);\n    return door;\n  }\n};",
    "BackEN": "Pattern: Prototype\nKey elements: Factory initialized with prototypes which are cloned to create products (MakeWall clones _prototypeWall), with Initialize method to set state after cloning",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Singleton?",
    "BackES": "• Singleton: Define operación Instance que permite a los clientes acceder a su instancia única (método de clase en Smalltalk, función miembro estática en C++), puede ser responsable de crear su propia instancia única",
    "Tags": "code-example prototype creational cpp",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What are real-world examples of the Prototype pattern?",
    "BackEN": "• Sketchpad system (Ivan Sutherland)\n• ThingLab reusable object library\n• Etgdb debugger front-end with DebuggerAdaptor prototypes\n• Mode Composer interaction technique library\n• Unidraw drawing framework",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Singleton?",
    "BackES": "Beneficios:\n• Acceso controlado a la instancia única\n• Espacio de nombres reducido - evita contaminar el espacio de nombres con variables globales\n• Permite refinamiento de operaciones y representación - la clase Singleton puede ser subclasificada\n• Permite número variable de instancias - fácil de cambiar para permitir más de una\n• Más flexible que operaciones de clase - las funciones miembro estáticas no pueden ser sobrescritas polimórficamente\n\nDesventajas:\n• Puede ser difícil de probar\n• Crea dependencias ocultas\n• Puede violar el Principio de Responsabilidad Única\n• Puede causar problemas en entornos multihilo",
    "Tags": "real-world prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What are common misuses of the Prototype pattern?",
    "BackEN": "• Using shallow copy when deep copy is needed, causing shared state bugs\n• Not properly implementing Clone for objects with circular references\n• Forgetting to provide Initialize method for setting state after cloning\n• Using it when simple constructors with parameters would be clearer\n• Not handling resource ownership properly during cloning",
    "FrontES": "¿Qué patrones están relacionados con el patrón Singleton?",
    "BackES": "• Abstract Factory: Puede ser implementado usando Singleton\n• Builder: Puede ser implementado usando Singleton\n• Prototype: Puede ser implementado usando Singleton",
    "Tags": "anti-pattern prototype creational",
    "Category": "Creational",
    "Page": "115"
  },
  {
    "FrontEN": "What is the intent of the Singleton pattern?",
    "BackEN": "Ensure a class only has one instance, and provide a global point of access to it.",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Singleton?",
    "BackES": "• Ocultar operación que crea instancia detrás de operación de clase (Instance) que garantiza solo una instancia\n• Instance usa inicialización perezosa - el valor no se crea hasta el primer acceso\n• El constructor es protegido para prevenir instanciación directa\n• Variable miembro estática _instance almacena puntero a instancia única\n• Instance puede asignar puntero a subclase, habilitando singletons de subclases\n• No se puede usar inicialización de objeto estático debido a: (1) no hay garantía de instancia única, (2) información insuficiente en tiempo de init estático, (3) orden indefinido de constructores a través de unidades de traducción\n• Subclasificación: usar variables de entorno, registro de singletons, o selección en tiempo de enlace\n• Enfoque de registro: las clases Singleton se registran por nombre, Instance busca por nombre",
    "Tags": "intent singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "When would you use the Singleton pattern?",
    "BackEN": "• There must be exactly one instance of a class, and it must be accessible to clients from well-known access point\n• When sole instance should be extensible by subclassing, and clients should be able to use extended instance without modifying code",
    "FrontES": "class Singleton {\npublic:\n  static Singleton* Instance();\nprotected:\n  Singleton();\nprivate:\n  static Singleton* _instance;\n};\n\nSingleton* Singleton::Instance() {\n  if (_instance == 0) {\n    _instance = new Singleton;\n  }\n  return _instance;\n}",
    "BackES": "Patrón: Singleton\nElementos clave: Método Instance() estático con inicialización perezosa, constructor protegido para prevenir instanciación directa, variable _instance estática para almacenar instancia única",
    "Tags": "use-case singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "What are the key participants in the Singleton pattern?",
    "BackEN": "• Singleton: Defines Instance operation that lets clients access unique instance (class method in Smalltalk, static member function in C++), may be responsible for creating its own unique instance",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Singleton?",
    "BackES": "• ChangeSet current en Smalltalk-80\n• Metaclases en Smalltalk (clase de una clase)\n• Session y WidgetKit en el toolkit InterViews\n• Gestores de configuración de aplicaciones\n• Sistemas de registro (logging)",
    "Tags": "key-concepts singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Singleton pattern?",
    "BackEN": "Benefits:\n• Controlled access to sole instance\n• Reduced name space - avoids polluting name space with global variables\n• Permits refinement of operations and representation - Singleton class may be subclassed\n• Permits variable number of instances - easy to change to allow more than one\n• More flexible than class operations - static member functions can't be overridden polymorphically\n\nDrawbacks:\n• Can be difficult to test\n• Creates hidden dependencies\n• May violate Single Responsibility Principle\n• Can cause issues in multithreaded environments",
    "FrontES": "Compara Factory Method vs Prototype",
    "BackES": "Similitudes:\n• Ambos son patrones creacionales\n• Ambos difieren la creación de objetos\n• Ambos proporcionan flexibilidad en la creación de objetos\n\nDiferencias:\n• Mecanismo: Factory Method usa herencia/subclasificación, Prototype usa clonación\n• Subclasificación: Factory Method requiere subclasificar Creator, Prototype evita subclasificación\n• Configuración: Factory Method es en tiempo de compilación, Prototype puede ser en tiempo de ejecución\n• Inicialización: Prototype a menudo requiere operación Initialize después de clonar\n\nCuándo usar cada uno:\n• Factory Method: Cuando quieres usar herencia para variar productos\n• Prototype: Cuando quieres evitar subclasificación y configurar en tiempo de ejecución",
    "Tags": "benefits-drawbacks singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "What patterns are related to the Singleton pattern?",
    "BackEN": "• Abstract Factory: Can be implemented using Singleton\n• Builder: Can be implemented using Singleton\n• Prototype: Can be implemented using Singleton",
    "FrontES": "¿Qué patrones usan el concepto 'Encapsulación de Variación'?",
    "BackES": "Identificar aspectos que varían y separarlos de lo que permanece igual. Command encapsula solicitudes, Strategy encapsula algoritmos, Abstract Factory encapsula familias de widgets, Bridge encapsula implementaciones de ventanas.\n\nPatrones: Command, Strategy, Abstract Factory, Bridge, State",
    "Tags": "related-patterns singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "What are key implementation considerations for the Singleton pattern?",
    "BackEN": "• Hide operation that creates instance behind class operation (Instance) that guarantees only one instance\n• Instance uses lazy initialization - value isn't created until first accessed\n• Constructor is protected to prevent direct instantiation\n• Static member variable _instance stores pointer to unique instance\n• Instance can assign pointer to subclass, enabling subclass singletons\n• Can't use static object initialization due to: (1) no guarantee of single instance, (2) insufficient info at static init time, (3) undefined order of constructors across translation units\n• Subclassing: use environment variables, registry of singletons, or link-time selection\n• Registry approach: Singleton classes register by name, Instance looks up by name",
    "FrontES": "¿Qué patrones usan el concepto 'Composición sobre Herencia'?",
    "BackES": "Favorecer la composición de objetos sobre la herencia de clases para lograr flexibilidad. Nueva funcionalidad se añade componiendo objetos de nuevas maneras en lugar de definir nuevas subclases. Reduce la explosión de clases y habilita configuración en tiempo de ejecución.\n\nPatrones: Composite, Decorator, Strategy, Bridge",
    "Tags": "implementation singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "class Singleton {\npublic:\n  static Singleton* Instance();\nprotected:\n  Singleton();\nprivate:\n  static Singleton* _instance;\n};\n\nSingleton* Singleton::Instance() {\n  if (_instance == 0) {\n    _instance = new Singleton;\n  }\n  return _instance;\n}",
    "BackEN": "Pattern: Singleton\nKey elements: Static Instance() method with lazy initialization, protected constructor to prevent direct instantiation, static _instance variable to store sole instance",
    "FrontES": "¿Qué patrones usan el concepto 'Programar a Interfaz, no a Implementación'?",
    "BackES": "Los clientes permanecen inconscientes de los tipos y clases específicos de objetos que usan. Declarar variables como instancias de clases abstractas y comprometerse solo con interfaces definidas por clases abstractas.\n\nPatrones: Abstract Factory, Strategy, Bridge, Composite, Command",
    "Tags": "code-example singleton creational cpp",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "What are real-world examples of the Singleton pattern?",
    "BackEN": "• ChangeSet current in Smalltalk-80\n• Metaclasses in Smalltalk (class of a class)\n• Session and WidgetKit in InterViews toolkit\n• Application configuration managers\n• Logging systems",
    "FrontES": "¿Qué patrones usan el concepto 'Delegación'?",
    "BackES": "Hacer la composición tan poderosa como la herencia haciendo que el objeto receptor delegue operaciones a su delegado. Decorator delega a componente, Strategy context delega a objeto strategy, Bridge abstraction delega a implementor.\n\nPatrones: Decorator, Strategy, Bridge, Command",
    "Tags": "real-world singleton creational",
    "Category": "Creational",
    "Page": "124"
  },
  {
    "FrontEN": "Compare Factory Method vs Prototype",
    "BackEN": "Similarities:\n• Both are creational patterns\n• Both defer object creation\n• Both provide flexibility in object creation\n\nDifferences:\n• Mechanism: Factory Method uses inheritance/subclassing, Prototype uses cloning\n• Subclassing: Factory Method requires subclassing Creator, Prototype avoids subclassing\n• Configuration: Factory Method is compile-time, Prototype can be run-time\n• Initialization: Prototype often requires Initialize operation after cloning\n\nWhen to use each:\n• Factory Method: When you want to use inheritance to vary products\n• Prototype: When you want to avoid subclassing and configure at run-time",
    "FrontES": "¿Qué patrones usan el concepto 'Separación de Preocupaciones'?",
    "BackES": "Separar diferentes aspectos de un diseño en partes independientes. Bridge separa abstracción de implementación, Strategy separa algoritmo de contexto, Visitor separa algoritmo de estructura de objetos, Builder separa construcción de representación.\n\nPatrones: Bridge, Strategy, Abstract Factory, Visitor, Builder",
    "Tags": "comparison factory-method prototype",
    "Category": "Comparison",
    "Page": "106"
  },
  {
    "FrontEN": "Which patterns use the concept 'Encapsulation of Variation'?",
    "BackEN": "Identify aspects that vary and separate them from what stays the same. Command encapsulates requests, Strategy encapsulates algorithms, Abstract Factory encapsulates widget families, Bridge encapsulates window implementations.\n\nPatterns: Command, Strategy, Abstract Factory, Bridge, State",
    "FrontES": "¿Qué patrones usan el concepto 'Inicialización Perezosa'?",
    "BackES": "Diferir la creación de objetos hasta que sean realmente necesarios. La operación Instance de Singleton crea instancia solo en el primer acceso. Evita creación innecesaria de objetos y resuelve problemas de orden de inicialización.\n\nPatrones: Singleton, Prototype",
    "Tags": "cross-cutting encapsulation-of-variation",
    "Category": "Cross-Cutting",
    "Page": "66"
  },
  {
    "FrontEN": "Which patterns use the concept 'Composition over Inheritance'?",
    "BackEN": "Favor object composition over class inheritance to achieve flexibility. New functionality added by composing objects in new ways rather than defining new subclasses. Reduces class explosion and enables run-time configuration.\n\nPatterns: Composite, Decorator, Strategy, Bridge",
    "FrontES": "¿Qué patrones usan el concepto 'Doble Despacho'?",
    "BackES": "La operación depende tanto del tipo del receptor como del argumento. Element llama a Accept con visitor, que llama de vuelta al método Visit específico del tipo del elemento. Permite que la operación se determine por ambos tipos de elemento y visitor sin pruebas de tipo.\n\nPatrones: Visitor",
    "Tags": "cross-cutting composition-over-inheritance",
    "Category": "Cross-Cutting",
    "Page": "66"
  },
  {
    "FrontEN": "Which patterns use the concept 'Program to Interface, not Implementation'?",
    "BackEN": "Clients remain unaware of specific types and classes of objects they use. Declare variables as instances of abstract classes and commit only to interfaces defined by abstract classes.\n\nPatterns: Abstract Factory, Strategy, Bridge, Composite, Command",
    "FrontES": "¿Qué patrones usan el concepto 'Flexibilidad de Composición de Objetos'?",
    "BackES": "Los patrones creacionales cambian el énfasis de codificar comportamientos fijos hacia definir comportamientos fundamentales componibles en complejos. Crear objetos con comportamientos particulares requiere más que simplemente instanciar una clase.\n\nPatrones: Abstract Factory, Builder, Prototype, Factory Method",
    "Tags": "cross-cutting program-to-interface",
    "Category": "Cross-Cutting",
    "Page": "66"
  },
  {
    "FrontEN": "What is the intent of the Adapter pattern?",
    "BackEN": "Convert the interface of a class into another interface clients expect. Adapter lets classes work together that couldn't otherwise because of incompatible interfaces.",
    "FrontES": "¿Cuál es la intención del patrón Adapter?",
    "BackES": "Convertir la interfaz de una clase en otra interfaz que los clientes esperan. Adapter permite que clases trabajen juntas que de otra manera no podrían debido a interfaces incompatibles.",
    "Tags": "intent adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "When would you use the Adapter pattern?",
    "BackEN": "- You want to use an existing class, and its interface does not match the one you need\n- You want to create a reusable class that cooperates with unrelated or unforeseen classes, that is, classes that don't necessarily have compatible interfaces\n- You need to use several existing subclasses, but it's impractical to adapt their interface by subclassing every one. An object adapter can adapt the interface of its parent class",
    "FrontES": "¿Cuándo usarías el patrón Adapter?",
    "BackES": "- Quieres usar una clase existente, y su interfaz no coincide con la que necesitas\n- Quieres crear una clase reutilizable que coopere con clases no relacionadas o imprevistas, es decir, clases que no necesariamente tienen interfaces compatibles\n- Necesitas usar varias subclases existentes, pero es impráctico adaptar su interfaz creando subclases de cada una. Un adaptador de objeto puede adaptar la interfaz de su clase padre",
    "Tags": "use-case adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "What are the key participants in the Adapter pattern?",
    "BackEN": "- Target: Defines the domain-specific interface that Client uses\n- Client: Collaborates with objects conforming to the Target interface\n- Adaptee: Defines an existing interface that needs adapting\n- Adapter: Adapts the interface of Adaptee to the Target interface",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Adapter?",
    "BackES": "- Target: Define la interfaz específica del dominio que usa el Cliente\n- Client: Colabora con objetos que cumplen con la interfaz Target\n- Adaptee: Define una interfaz existente que necesita adaptación\n- Adapter: Adapta la interfaz del Adaptee a la interfaz Target",
    "Tags": "key-concepts adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Adapter pattern?",
    "BackEN": "Benefits:\n- Class adapter: Lets Adapter override some of Adaptee's behavior. Introduces only one object, no additional pointer indirection\n- Object adapter: Lets a single Adapter work with many Adaptees. Can add functionality to all Adaptees at once\n\nDrawbacks:\n- Class adapter: Requires multiple inheritance, which isn't available in all languages. Won't work when adapting a class and all its subclasses\n- Object adapter: Makes it harder to override Adaptee behavior since it requires subclassing Adaptee",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Adapter?",
    "BackES": "Beneficios:\n- Adaptador de clase: Permite que Adapter sobrescriba parte del comportamiento del Adaptee. Introduce solo un objeto, sin indirección adicional de punteros\n- Adaptador de objeto: Permite que un solo Adapter funcione con muchos Adaptees. Puede agregar funcionalidad a todos los Adaptees a la vez\n\nDesventajas:\n- Adaptador de clase: Requiere herencia múltiple, que no está disponible en todos los lenguajes. No funcionará al adaptar una clase y todas sus subclases\n- Adaptador de objeto: Hace más difícil sobrescribir el comportamiento del Adaptee ya que requiere crear subclases del Adaptee",
    "Tags": "benefits-drawbacks adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "What patterns are related to the Adapter pattern?",
    "BackEN": "- Bridge: Has a structure similar to an object adapter, but separates interface from implementation. An adapter changes the interface of an existing object\n- Decorator: Enhances another object without changing its interface, more transparent than adapter. Supports recursive composition\n- Proxy: Defines a representative for another object and does not change its interface",
    "FrontES": "¿Qué patrones están relacionados con el patrón Adapter?",
    "BackES": "- Bridge: Tiene una estructura similar a un adaptador de objeto, pero separa la interfaz de la implementación. Un adaptador cambia la interfaz de un objeto existente\n- Decorator: Mejora otro objeto sin cambiar su interfaz, es más transparente que un adaptador. Soporta composición recursiva\n- Proxy: Define un representante para otro objeto y no cambia su interfaz",
    "Tags": "related-patterns adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "class TextShape : public Shape, private TextView {\npublic:\n    TextShape();\n    virtual void BoundingBox(Point& bottomLeft, Point& topRight) const;\n    virtual bool IsEmpty() const;\n};",
    "BackEN": "Pattern: Adapter\nKey elements: Class adapter using multiple inheritance - inherits interface publicly from Shape (Target) and implementation privately from TextView (Adaptee)",
    "FrontES": "class TextShape : public Shape, private TextView {\npublic:\n    TextShape();\n    virtual void BoundingBox(Point& bottomLeft, Point& topRight) const;\n    virtual bool IsEmpty() const;\n};",
    "BackES": "Patrón: Adapter\nElementos clave: Adaptador de clase usando herencia múltiple - hereda la interfaz públicamente de Shape (Target) e implementación privadamente de TextView (Adaptee)",
    "Tags": "code-example adapter structural cpp",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "What are key implementation considerations for the Adapter pattern?",
    "BackEN": "- How much adapting does Adapter do? Ranges from simple interface conversion to complete support of an entirely different set of operations\n- Pluggable adapters: Building interface adaptation into a class minimizes assumptions other classes must make to use it\n- Using two-way adapters to provide transparency: Allows adapted object to be used wherever Adaptee or Target is expected, using multiple inheritance",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Adapter?",
    "BackES": "- ¿Cuánta adaptación hace el Adapter? Varía desde simple conversión de interfaz hasta soporte completo de un conjunto totalmente diferente de operaciones\n- Adaptadores enchufables: Incorporar adaptación de interfaz en una clase minimiza las suposiciones que otras clases deben hacer para usarla\n- Usar adaptadores bidireccionales para proporcionar transparencia: Permite que el objeto adaptado se use donde se espera Adaptee o Target, usando herencia múltiple",
    "Tags": "implementation adapter structural",
    "Category": "Structural",
    "Page": "139"
  },
  {
    "FrontEN": "What is the intent of the Bridge pattern?",
    "BackEN": "Decouple an abstraction from its implementation so that the two can vary independently.",
    "FrontES": "¿Cuál es la intención del patrón Bridge?",
    "BackES": "Desacoplar una abstracción de su implementación de modo que ambas puedan variar independientemente.",
    "Tags": "intent bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "When would you use the Bridge pattern?",
    "BackEN": "- You want to avoid a permanent binding between an abstraction and its implementation\n- Both the abstractions and their implementations should be extensible by subclassing\n- Changes in the implementation of an abstraction should have no impact on clients\n- You want to hide the implementation of an abstraction completely from clients\n- You have a proliferation of classes\n- You want to share an implementation among multiple objects and this fact should be hidden from the client",
    "FrontES": "¿Cuándo usarías el patrón Bridge?",
    "BackES": "- Quieres evitar un vínculo permanente entre una abstracción y su implementación\n- Tanto las abstracciones como sus implementaciones deben ser extensibles mediante subclases\n- Los cambios en la implementación de una abstracción no deben tener impacto en los clientes\n- Quieres ocultar completamente la implementación de una abstracción de los clientes\n- Tienes una proliferación de clases\n- Quieres compartir una implementación entre múltiples objetos y este hecho debe estar oculto del cliente",
    "Tags": "use-case bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "What are the key participants in the Bridge pattern?",
    "BackEN": "- Abstraction: Defines the abstraction's interface and maintains a reference to an object of type Implementor\n- RefinedAbstraction: Extends the interface defined by Abstraction\n- Implementor: Defines the interface for implementation classes. This interface doesn't have to correspond exactly to Abstraction's interface\n- ConcreteImplementor: Implements the Implementor interface and defines its concrete implementation",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Bridge?",
    "BackES": "- Abstraction: Define la interfaz de la abstracción y mantiene una referencia a un objeto de tipo Implementor\n- RefinedAbstraction: Extiende la interfaz definida por Abstraction\n- Implementor: Define la interfaz para clases de implementación. Esta interfaz no tiene que corresponder exactamente a la interfaz de Abstraction\n- ConcreteImplementor: Implementa la interfaz Implementor y define su implementación concreta",
    "Tags": "key-concepts bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Bridge pattern?",
    "BackEN": "Benefits:\n- Decoupling interface and implementation: Implementation not bound permanently to interface, can be configured at run-time\n- Improved extensibility: Can extend Abstraction and Implementor hierarchies independently\n- Hiding implementation details from clients\n\nDrawbacks:\n- Increased complexity: The pattern increases the number of classes in the design",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Bridge?",
    "BackES": "Beneficios:\n- Desacoplamiento de interfaz e implementación: La implementación no está vinculada permanentemente a la interfaz, se puede configurar en tiempo de ejecución\n- Extensibilidad mejorada: Puedes extender las jerarquías de Abstraction e Implementor independientemente\n- Ocultar detalles de implementación de los clientes\n\nDesventajas:\n- Mayor complejidad: El patrón aumenta el número de clases en el diseño",
    "Tags": "benefits-drawbacks bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "What patterns are related to the Bridge pattern?",
    "BackEN": "- Abstract Factory: Can create and configure a particular Bridge\n- Adapter: Adapter makes unrelated classes work together, usually applied after design. Bridge is used up-front to let abstractions and implementations vary independently",
    "FrontES": "¿Qué patrones están relacionados con el patrón Bridge?",
    "BackES": "- Abstract Factory: Puede crear y configurar un Bridge particular\n- Adapter: Adapter hace que clases no relacionadas trabajen juntas, generalmente se aplica después del diseño. Bridge se usa desde el principio para permitir que abstracciones e implementaciones varíen independientemente",
    "Tags": "related-patterns bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "void Window::DrawRect(const Point& p1, const Point& p2) {\n    WindowImp* imp = GetWindowImp();\n    imp->DeviceRect(p1.X(), p1.Y(), p2.X(), p2.Y());\n}",
    "BackEN": "Pattern: Bridge\nKey elements: Window abstraction delegates to WindowImp implementor for platform-specific drawing operations, decoupling abstraction from implementation",
    "FrontES": "void Window::DrawRect(const Point& p1, const Point& p2) {\n    WindowImp* imp = GetWindowImp();\n    imp->DeviceRect(p1.X(), p1.Y(), p2.X(), p2.Y());\n}",
    "BackES": "Patrón: Bridge\nElementos clave: La abstracción Window delega al implementador WindowImp para operaciones de dibujo específicas de la plataforma, desacoplando la abstracción de la implementación",
    "Tags": "code-example bridge structural cpp",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "What are key implementation considerations for the Bridge pattern?",
    "BackEN": "- Only one Implementor: Even with only one implementation, creating an abstract Implementor class isn't necessary (degenerate case)\n- Creating the right Implementor object: Options include Abstraction instantiating one, delegating to factory, or choosing default initially\n- Sharing implementors: Can use Counted Pointer idiom with reference counting when implementors can be shared",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Bridge?",
    "BackES": "- Solo un Implementor: Incluso con solo una implementación, crear una clase Implementor abstracta no es necesario (caso degenerado)\n- Crear el objeto Implementor correcto: Las opciones incluyen que Abstraction instancie uno, delegar a una fábrica, o elegir uno predeterminado inicialmente\n- Compartir implementadores: Se puede usar el idioma Counted Pointer con conteo de referencias cuando los implementadores pueden compartirse",
    "Tags": "implementation bridge structural",
    "Category": "Structural",
    "Page": "151"
  },
  {
    "FrontEN": "What is the intent of the Composite pattern?",
    "BackEN": "Compose objects into tree structures to represent part-whole hierarchies. Composite lets clients treat individual objects and compositions of objects uniformly.",
    "FrontES": "¿Cuál es la intención del patrón Composite?",
    "BackES": "Componer objetos en estructuras de árbol para representar jerarquías parte-todo. Composite permite a los clientes tratar objetos individuales y composiciones de objetos de manera uniforme.",
    "Tags": "intent composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "When would you use the Composite pattern?",
    "BackEN": "- You want to represent part-whole hierarchies of objects\n- You want clients to be able to ignore the difference between compositions of objects and individual objects. Clients will treat all objects in the composite structure uniformly",
    "FrontES": "¿Cuándo usarías el patrón Composite?",
    "BackES": "- Quieres representar jerarquías parte-todo de objetos\n- Quieres que los clientes puedan ignorar la diferencia entre composiciones de objetos y objetos individuales. Los clientes tratarán todos los objetos en la estructura compuesta de manera uniforme",
    "Tags": "use-case composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "What are the key participants in the Composite pattern?",
    "BackEN": "- Component: Declares the interface for objects in the composition and implements default behavior. Declares an interface for accessing and managing its child components\n- Leaf: Represents leaf objects in the composition. A leaf has no children and defines behavior for primitive objects\n- Composite: Defines behavior for components having children, stores child components, and implements child-related operations\n- Client: Manipulates objects in the composition through the Component interface",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Composite?",
    "BackES": "- Component: Declara la interfaz para objetos en la composición. Implementa comportamiento predeterminado. Declara interfaz para acceder y gestionar sus componentes hijos\n- Leaf: Representa objetos hoja en la composición. Una hoja no tiene hijos. Define comportamiento para objetos primitivos\n- Composite: Define comportamiento para componentes que tienen hijos. Almacena componentes hijos. Implementa operaciones relacionadas con hijos en la interfaz Component\n- Client: Manipula objetos en la composición a través de la interfaz Component",
    "Tags": "key-concepts composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Composite pattern?",
    "BackEN": "Benefits:\n- Defines class hierarchies consisting of primitive objects and composite objects\n- Makes the client simple: Clients can treat composite structures and individual objects uniformly\n- Makes it easier to add new kinds of components: Newly defined Composite or Leaf subclasses work automatically with existing structures\n\nDrawbacks:\n- Can make your design overly general: Makes it harder to restrict the components of a composite. Must use run-time checks instead of type system",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Composite?",
    "BackES": "Beneficios:\n- Define jerarquías de clases consistiendo en objetos primitivos y objetos compuestos\n- Hace al cliente simple - los clientes pueden tratar estructuras compuestas y objetos individuales de manera uniforme\n- Facilita agregar nuevos tipos de componentes\n\nDesventajas:\n- Puede hacer tu diseño demasiado general - difícil restringir los componentes de un compuesto\n- Puede requerir verificaciones en tiempo de ejecución en lugar de confiar en el sistema de tipos",
    "Tags": "benefits-drawbacks composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "What patterns are related to the Composite pattern?",
    "BackEN": "- Chain of Responsibility: Component-parent link is often used for a Chain of Responsibility\n- Decorator: Often used with Composite. When used together, they will usually have a common parent class\n- Flyweight: Lets you share components, but they can no longer refer to their parents\n- Iterator: Can be used to traverse composites\n- Visitor: Localizes operations and behavior that would otherwise be distributed across Composite and Leaf classes",
    "FrontES": "¿Qué patrones están relacionados con el patrón Composite?",
    "BackES": "- Chain of Responsibility: A menudo se aplica junto con Composite. Los componentes padre pueden actuar como sucesores\n- Decorator: A menudo se usa con Composite. Cuando decoradores y compuestos se usan juntos, generalmente tendrán una clase padre común\n- Flyweight: Permite compartir componentes, pero ya no pueden referirse a sus padres\n- Iterator: Se puede usar para recorrer compuestos\n- Visitor: Localiza operaciones y comportamiento que de otro modo estarían distribuidos entre clases Composite y Leaf",
    "Tags": "related-patterns composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "Currency CompositeEquipment::NetPrice() {\n    Iterator<Equipment*>* i = CreateIterator();\n    Currency total = 0;\n    for (i->First(); !i->IsDone(); i->Next()) {\n        total += i->CurrentItem()->NetPrice();\n    }\n    delete i;\n    return total;\n}",
    "BackEN": "Pattern: Composite\nKey elements: CompositeEquipment computes its total price by iterating over child Equipment objects and summing their NetPrice(), treating leaves and composites uniformly",
    "FrontES": "class Equipment {\npublic:\n    virtual Watt Power();\n    virtual Currency NetPrice();\n    virtual void Add(Equipment*);\n    virtual Iterator<Equipment*>* CreateIterator();\n};",
    "BackES": "Patrón: Composite\nElementos clave: Clase Component base que define operaciones tanto para hojas como para compuestos. Incluye operaciones de gestión de hijos (Add, CreateIterator) y operaciones de negocio (Power, NetPrice)",
    "Tags": "code-example composite structural cpp",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "What are key implementation considerations for the Composite pattern?",
    "BackEN": "- Explicit parent references: Simplify traversal and management of composite structure\n- Sharing components: Difficult because component can have no more than one parent. Flyweight pattern can help\n- Maximizing the Component interface: Define as many common operations as possible for Composite and Leaf classes\n- Declaring child management operations: Trade-off between safety (only in Composite) and transparency (in Component)\n- Child ordering: Design child access and management interfaces carefully when ordering matters\n- Caching to improve performance: Cache traversal or search information\n- Who should delete components: Usually best to make Composite responsible",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Composite?",
    "BackES": "- Referencias explícitas al padre: Mantener referencias de componentes hijos a padres puede simplificar el recorrido y la gestión de la estructura compuesta\n- Compartir componentes: Flyweight puede ayudar con el intercambio cuando se necesita (componentes sin punteros padre)\n- Maximizar la interfaz Component: Hacer la interfaz Component lo más amplia posible permite que los clientes no sepan si están tratando con hojas o compuestos\n- Declarar operaciones de gestión de hijos: ¿En Component o Composite? Tradeoff entre seguridad y transparencia\n- Component debería implementar una lista de componentes hijos? Depende del equilibrio transparencia vs eficiencia de espacio\n- Orden de los hijos: Si importante, diseñar interfaces de acceso y gestión de hijos cuidadosamente\n- Caché para mejorar el rendimiento: Mantener información atravesada/calculada sobre hijos\n- ¿Quién debería eliminar componentes? Mejor hacerlo en Composite con excepciones cuando es responsabilidad externa\n- ¿Cuál es la mejor estructura de datos para almacenar componentes? Depende de eficiencia: listas enlazadas, árboles, arreglos, tablas hash",
    "Tags": "implementation composite structural",
    "Category": "Structural",
    "Page": "163"
  },
  {
    "FrontEN": "What is the intent of the Decorator pattern?",
    "BackEN": "Attach additional responsibilities to an object dynamically. Decorators provide a flexible alternative to subclassing for extending functionality.",
    "FrontES": "¿Cuál es la intención del patrón Decorator?",
    "BackES": "Adjuntar responsabilidades adicionales a un objeto dinámicamente. Los decoradores proporcionan una alternativa flexible a la creación de subclases para extender funcionalidad.",
    "Tags": "intent decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "When would you use the Decorator pattern?",
    "BackEN": "- To add responsibilities to individual objects dynamically and transparently, that is, without affecting other objects\n- For responsibilities that can be withdrawn\n- When extension by subclassing is impractical. Sometimes a large number of independent extensions are possible and would produce an explosion of subclasses to support every combination",
    "FrontES": "¿Cuándo usarías el patrón Decorator?",
    "BackES": "- Para agregar responsabilidades a objetos individuales de manera dinámica y transparente, sin afectar a otros objetos\n- Para responsabilidades que se pueden retirar\n- Cuando la extensión mediante creación de subclases es imprácticable. A veces, un gran número de extensiones independientes es posible y produciría una explosión de subclases. O una definición de clase puede estar oculta o no disponible para la creación de subclases",
    "Tags": "use-case decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "What are the key participants in the Decorator pattern?",
    "BackEN": "- Component: Defines the interface for objects that can have responsibilities added to them dynamically\n- ConcreteComponent: Defines an object to which additional responsibilities can be attached\n- Decorator: Maintains a reference to a Component object and defines an interface that conforms to Component's interface\n- ConcreteDecorator: Adds responsibilities to the component",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Decorator?",
    "BackES": "- Component: Define la interfaz para objetos que pueden tener responsabilidades agregadas dinámicamente\n- ConcreteComponent: Define un objeto al que se pueden adjuntar responsabilidades adicionales\n- Decorator: Mantiene una referencia a un objeto Component y define una interfaz que se ajusta a la interfaz de Component\n- ConcreteDecorator: Agrega responsabilidades al componente",
    "Tags": "key-concepts decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Decorator pattern?",
    "BackEN": "Benefits:\n- More flexibility than static inheritance: Responsibilities can be added and removed at run-time\n- Avoids feature-laden classes high up in the hierarchy: Pay-as-you-go approach to adding responsibilities\n- A decorator and its component aren't identical: From object identity point of view, decorated component is not identical to the component itself\n\nDrawbacks:\n- Lots of little objects: Design results in systems composed of lots of little objects that all look alike, can be hard to learn and debug",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Decorator?",
    "BackES": "Beneficios:\n- Más flexibilidad que la herencia estática - se pueden agregar y eliminar responsabilidades en tiempo de ejecución\n- Evita clases cargadas de características en lo alto de la jerarquía - puedes agregar funcionalidad incrementalmente\n- Un decorador y su componente no son idénticos - un decorador actúa como un proxy transparente\n\nDesventajas:\n- Muchos objetos pequeños - un diseño que usa Decorator a menudo resulta en sistemas compuestos por muchos objetos pequeños similares\n- Decorator cambia la piel del objeto, no las entrañas - para cambiar el comportamiento interno, considera Strategy",
    "Tags": "benefits-drawbacks decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "What patterns are related to the Decorator pattern?",
    "BackEN": "- Adapter: A decorator only changes an object's responsibilities, not its interface; an adapter gives an object a completely new interface\n- Composite: A decorator can be viewed as a degenerate composite with only one component. However, decorator adds additional responsibilities—it isn't intended for object aggregation\n- Strategy: A decorator lets you change the skin of an object; a strategy lets you change the guts",
    "FrontES": "¿Qué patrones están relacionados con el patrón Decorator?",
    "BackES": "- Adapter: Un decorador es diferente de un adaptador: un decorador solo cambia las responsabilidades de un objeto, no su interfaz. Un adaptador dará a un objeto una interfaz completamente nueva\n- Composite: Un decorador puede verse como un compuesto degenerado con un solo componente. Sin embargo, un decorador agrega responsabilidades adicionales - no está destinado a la agregación de objetos\n- Strategy: Un decorador te permite cambiar la piel de un objeto; una estrategia te permite cambiar las entrañas. Estas son dos formas alternativas de cambiar un objeto",
    "Tags": "related-patterns decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "void BorderDecorator::Draw() {\n    Decorator::Draw();\n    DrawBorder(_width);\n}",
    "BackEN": "Pattern: Decorator\nKey elements: BorderDecorator first calls Decorator::Draw() to draw the component, then adds border drawing on top, dynamically adding visual responsibility",
    "FrontES": "void BorderDecorator::Draw() {\n    VisualComponent::Draw();\n    DrawBorder(_width);\n}",
    "BackES": "Patrón: Decorator\nElementos clave: BorderDecorator extiende el comportamiento de VisualComponent llamando primero al método Draw() del componente, luego agregando su propia funcionalidad de dibujo de borde",
    "Tags": "code-example decorator structural cpp",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "What are key implementation considerations for the Decorator pattern?",
    "BackEN": "- Interface conformance: A decorator object's interface must conform to the interface of the component it decorates\n- Omitting the abstract Decorator class: No need when only adding one responsibility\n- Keeping Component classes lightweight: Focus on defining an interface, not on storing data. Defer data representation to subclasses\n- Changing the skin vs. changing the guts: Decorator changes skin. Strategy pattern is good for changing the guts",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Decorator?",
    "BackES": "- Conformidad de interfaz: La interfaz del decorador debe ajustarse a la del componente que decora\n- Omitir la clase abstracta Decorator: No necesitas definir una clase abstracta Decorator cuando solo necesitas agregar una responsabilidad\n- Mantener las clases Component ligeras: Para asegurar la intercambiabilidad, el componente y decorador deben descender de una clase Component ligera que se enfoca en definir una interfaz, no almacenar datos\n- Cambiar la piel de un objeto vs cambiar sus entrañas: Decorator cambia el exterior. Strategy es buena para cambiar las entrañas",
    "Tags": "implementation decorator structural",
    "Category": "Structural",
    "Page": "175"
  },
  {
    "FrontEN": "What is the intent of the Facade pattern?",
    "BackEN": "Provide a unified interface to a set of interfaces in a subsystem. Facade defines a higher-level interface that makes the subsystem easier to use.",
    "FrontES": "¿Cuál es la intención del patrón Facade?",
    "BackES": "Proporcionar una interfaz unificada a un conjunto de interfaces en un subsistema. Facade define una interfaz de nivel superior que hace que el subsistema sea más fácil de usar.",
    "Tags": "intent facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "When would you use the Facade pattern?",
    "BackEN": "- You want to provide a simple interface to a complex subsystem\n- There are many dependencies between clients and the implementation classes of an abstraction. Introduce a facade to decouple the subsystem from clients and other subsystems\n- You want to layer your subsystems. Use a facade to define an entry point to each subsystem level",
    "FrontES": "¿Cuándo usarías el patrón Facade?",
    "BackES": "- Quieres proporcionar una interfaz simple a un subsistema complejo. Los subsistemas a menudo se vuelven más complejos a medida que evolucionan. La mayoría de los patrones, cuando se aplican, resultan en clases más pequeñas y más numerosas. Una fachada puede proporcionar una vista simple predeterminada que es suficiente para la mayoría de los clientes\n- Hay muchas dependencias entre clientes y clases de implementación de una abstracción. Introduce una fachada para desacoplar el subsistema de los clientes y otros subsistemas\n- Quieres estructurar tus subsistemas en capas. Usa una fachada para definir un punto de entrada a cada nivel de subsistema",
    "Tags": "use-case facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "What are the key participants in the Facade pattern?",
    "BackEN": "- Facade: Knows which subsystem classes are responsible for a request and delegates client requests to appropriate subsystem objects\n- Subsystem classes: Implement subsystem functionality, handle work assigned by the Facade object, and have no knowledge of the facade; that is, they keep no references to it",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Facade?",
    "BackES": "- Facade: Conoce qué clases de subsistema son responsables de una solicitud. Delega solicitudes de clientes a objetos de subsistema apropiados\n- Subsystem classes: Implementan funcionalidad del subsistema. Manejan el trabajo asignado por el objeto Facade. No tienen conocimiento de la fachada; es decir, no mantienen referencias a ella",
    "Tags": "key-concepts facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Facade pattern?",
    "BackEN": "Benefits:\n- Shields clients from subsystem components, reducing the number of objects clients deal with\n- Promotes weak coupling between the subsystem and its clients\n- Doesn't prevent applications from using subsystem classes if they need to\n\nDrawbacks:\n- The facade may become a god object coupled to all classes of an application if not designed carefully",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Facade?",
    "BackES": "Beneficios:\n- Protege a los clientes de componentes del subsistema, reduciendo el número de objetos con los que los clientes tratan\n- Promueve acoplamiento débil entre el subsistema y sus clientes\n- No impide que las aplicaciones usen clases de subsistema si lo necesitan - puedes elegir entre facilidad de uso y generalidad\n\nDesventajas:\n- Puede convertirse en un objeto divino acoplado a todas las clases de una aplicación si no se tiene cuidado",
    "Tags": "benefits-drawbacks facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "What patterns are related to the Facade pattern?",
    "BackEN": "- Abstract Factory: Can be used with Facade to provide an interface for creating subsystem objects in a subsystem-independent way. Can also be used as alternative to hide platform-specific classes\n- Mediator: Similar to Facade in abstracting functionality, but Mediator abstracts arbitrary communication between colleague objects. Colleagues are aware of mediator. Facade merely abstracts interface and subsystem classes don't know about it\n- Singleton: Usually only one Facade object is required. Thus Facade objects are often Singletons",
    "FrontES": "¿Qué patrones están relacionados con el patrón Facade?",
    "BackES": "- Abstract Factory: Puede usarse con Facade para proporcionar una interfaz para crear objetos de subsistema de manera independiente del subsistema\n- Mediator: Es similar a Facade en que abstrae funcionalidad de clases existentes. Sin embargo, el propósito de Mediator es abstraer comunicación arbitraria entre objetos colegas. Centraliza funcionalidad que no pertenece a ningún colega. Los colegas conocen al mediador y se comunican con él. En contraste, una fachada simplemente abstrae la interfaz a objetos de subsistema\n- Singleton: A menudo solo se necesita un objeto Facade, por lo que los objetos Facade suelen ser Singletons",
    "Tags": "related-patterns facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "void Compiler::Compile(istream& input, BytecodeStream& output) {\n    Scanner scanner(input);\n    ProgramNodeBuilder builder;\n    Parser parser;\n    parser.Parse(scanner, builder);\n    RISCCodeGenerator generator(output);\n    ProgramNode* parseTree = builder.GetRootNode();\n    parseTree->Traverse(generator);\n}",
    "BackEN": "Pattern: Facade\nKey elements: Compiler facade provides simple Compile() interface that coordinates Scanner, Parser, ProgramNodeBuilder, and CodeGenerator subsystem classes",
    "FrontES": "class Compiler {\npublic:\n    Compiler();\n    virtual void Compile(istream&, BytecodeStream&);\n};",
    "BackES": "Patrón: Facade\nElementos clave: La clase Compiler proporciona una interfaz simple de alto nivel (método Compile) que oculta la complejidad del subsistema del compilador que incluye Scanner, Parser, ProgramNodeBuilder, etc.",
    "Tags": "code-example facade structural cpp",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "What are key implementation considerations for the Facade pattern?",
    "BackEN": "- Reducing client-subsystem coupling: Make Facade an abstract class with concrete subclasses for different implementations. Keeps clients from knowing which implementation is used\n- Public versus private subsystem classes: Public interface consists of classes all clients can access; private interface is just for subsystem extenders",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Facade?",
    "BackES": "- Reducir acoplamiento cliente-subsistema: Hacer que Facade sea una clase abstracta con subclases concretas para diferentes implementaciones de un subsistema. Entonces los clientes se comunican con el subsistema a través de la interfaz definida por la clase Facade abstracta\n- Clases de subsistema públicas vs privadas: Un subsistema es análogo a una clase: ambos tienen interfaces y ambos encapsulan algo. La interfaz pública de un subsistema consiste en clases a las que todos los clientes pueden acceder; la interfaz privada es solo para desarrolladores de subsistemas",
    "Tags": "implementation facade structural",
    "Category": "Structural",
    "Page": "185"
  },
  {
    "FrontEN": "What is the intent of the Flyweight pattern?",
    "BackEN": "Use sharing to support large numbers of fine-grained objects efficiently.",
    "FrontES": "¿Cuál es la intención del patrón Flyweight?",
    "BackES": "Usar compartición para soportar eficientemente grandes cantidades de objetos de grano fino.",
    "Tags": "intent flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "When would you use the Flyweight pattern?",
    "BackEN": "- An application uses a large number of objects\n- Storage costs are high because of the sheer quantity of objects\n- Most object state can be made extrinsic\n- Many groups of objects may be replaced by relatively few shared objects once extrinsic state is removed\n- The application doesn't depend on object identity. Since flyweight objects may be shared, identity tests will return true for conceptually distinct objects",
    "FrontES": "¿Cuándo usarías el patrón Flyweight?",
    "BackES": "La efectividad del patrón Flyweight depende mucho de cómo y dónde se usa. Aplica el patrón Flyweight cuando se cumplan TODAS las siguientes condiciones:\n- Una aplicación usa un gran número de objetos\n- Los costos de almacenamiento son altos debido a la gran cantidad de objetos\n- La mayoría del estado del objeto se puede hacer extrínseco\n- Muchos grupos de objetos pueden ser reemplazados por relativamente pocos objetos compartidos una vez que se elimine el estado extrínseco\n- La aplicación no depende de la identidad del objeto",
    "Tags": "use-case flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "What are the key participants in the Flyweight pattern?",
    "BackEN": "- Flyweight: Declares an interface through which flyweights can receive and act on extrinsic state\n- ConcreteFlyweight: Implements the Flyweight interface and adds storage for intrinsic state, if any. Must be sharable\n- UnsharedConcreteFlyweight: Not all Flyweight subclasses need to be shared. Interface enables sharing but doesn't enforce it\n- FlyweightFactory: Creates and manages flyweight objects and ensures that flyweights are shared properly\n- Client: Maintains a reference to flyweight(s) and computes or stores the extrinsic state of flyweight(s)",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Flyweight?",
    "BackES": "- Flyweight: Declara una interfaz a través de la cual los flyweights pueden recibir y actuar sobre estado extrínseco\n- ConcreteFlyweight: Implementa la interfaz Flyweight y agrega almacenamiento para estado intrínseco. Un objeto ConcreteFlyweight debe ser compartible. Cualquier estado que almacene debe ser intrínseco\n- UnsharedConcreteFlyweight: No todos los objetos Flyweight necesitan ser compartidos. La interfaz Flyweight permite compartir pero no lo impone\n- FlyweightFactory: Crea y gestiona objetos flyweight. Asegura que los flyweights se compartan apropiadamente\n- Client: Mantiene una referencia a flyweight(s). Calcula o almacena el estado extrínseco de flyweight(s)",
    "Tags": "key-concepts flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Flyweight pattern?",
    "BackEN": "Benefits:\n- Storage savings increase as more flyweights are shared\n- Storage savings increase with the amount of shared state\n- Greatest savings occur when objects use substantial quantities of both intrinsic and extrinsic state, and extrinsic state can be computed rather than stored\n\nDrawbacks:\n- Flyweights may introduce run-time costs associated with transferring, finding, and/or computing extrinsic state, especially if it was formerly stored as intrinsic state",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Flyweight?",
    "BackES": "Beneficios:\n- Ahorros de almacenamiento - función de: reducción en el número total de instancias, cantidad de estado intrínseco por objeto, si el estado extrínseco se calcula o almacena\n\nDesventajas:\n- Los flyweights pueden introducir costos de tiempo de ejecución asociados con transferir, encontrar y/o calcular estado extrínseco\n- El código se vuelve más complejo",
    "Tags": "benefits-drawbacks flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "What patterns are related to the Flyweight pattern?",
    "BackEN": "- Composite: Flyweight pattern is often combined with Composite to represent a hierarchical structure as a graph with shared leaf nodes\n- State and Strategy: State and Strategy objects are often best implemented as flyweights",
    "FrontES": "¿Qué patrones están relacionados con el patrón Flyweight?",
    "BackES": "- Composite: A menudo se combina con Composite para implementar una estructura de gráfico jerárquico logística como un grafo acíclico dirigido con nodos hoja compartidos\n- State y Strategy: Los objetos de estrategia a menudo son buenos flyweights\n- Flyweight explica cuándo y cómo se pueden compartir objetos State",
    "Tags": "related-patterns flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "Character* GlyphFactory::CreateCharacter(char c) {\n    if (!_character[c]) {\n        _character[c] = new Character(c);\n    }\n    return _character[c];\n}",
    "BackEN": "Pattern: Flyweight\nKey elements: GlyphFactory ensures Character flyweights are shared - returns existing instance if available, creates new one only if needed, managing shared objects",
    "FrontES": "class Glyph {\npublic:\n    virtual void Draw(Window*, GlyphContext&);\n    virtual void SetFont(Font*, GlyphContext&);\n    virtual Font* GetFont(GlyphContext&);\n};",
    "BackES": "Patrón: Flyweight\nElementos clave: Los objetos Glyph son flyweights compartidos. GlyphContext almacena estado extrínseco (fuente, posición). Los métodos Draw y SetFont toman GlyphContext como parámetro para acceder al estado extrínseco",
    "Tags": "code-example flyweight structural cpp",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "What are key implementation considerations for the Flyweight pattern?",
    "BackEN": "- Removing extrinsic state: Pattern's applicability is determined by how easy it is to identify extrinsic state and remove it from shared objects\n- Managing shared objects: FlyweightFactory lets clients locate flyweights, often uses associative store. Sharing implies reference counting or garbage collection\n- Intrinsic state: Character codes are intrinsic. Other information like font, size may be extrinsic depending on document structure",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Flyweight?",
    "BackES": "- Eliminar estado extrínseco: El patrón se aplica mejor cuando los objetos usan sustancial estado tanto intrínseco como extrínseco, y el estado extrínseco se puede calcular en lugar de almacenar\n- Gestionar objetos compartidos: Dado que los objetos son compartidos, los clientes no deben instanciarlos directamente. FlyweightFactory permite a los clientes localizar un flyweight particular. A menudo usa una estructura de datos asociativa para permitir búsqueda de flyweights\n- FlyweightFactory puede usar Singleton para hacer la fábrica accesible globalmente\n- Los objetos compartidos deben ser inmutables o manejar cuidadosamente la mutabilidad para prevenir efectos secundarios no deseados",
    "Tags": "implementation flyweight structural",
    "Category": "Structural",
    "Page": "195"
  },
  {
    "FrontEN": "What is the intent of the Proxy pattern?",
    "BackEN": "Provide a surrogate or placeholder for another object to control access to it.",
    "FrontES": "¿Cuál es la intención del patrón Proxy?",
    "BackES": "Proporcionar un sustituto o marcador de posición para otro objeto para controlar el acceso a él.",
    "Tags": "intent proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "When would you use the Proxy pattern?",
    "BackEN": "- A remote proxy provides a local representative for an object in a different address space\n- A virtual proxy creates expensive objects on demand\n- A protection proxy controls access to the original object. Protection proxies are useful when objects should have different access rights\n- A smart reference is a replacement for a bare pointer that performs additional actions when an object is accessed",
    "FrontES": "¿Cuándo usarías el patrón Proxy?",
    "BackES": "El patrón Proxy es aplicable siempre que haya necesidad de una referencia más versátil o sofisticada a un objeto que un simple puntero. Aquí hay varias situaciones comunes:\n- Proxy remoto: Proporciona un representante local para un objeto en un espacio de direcciones diferente\n- Proxy virtual: Crea objetos costosos bajo demanda\n- Proxy de protección: Controla el acceso al objeto original. Útil cuando los objetos deben tener diferentes derechos de acceso\n- Referencia inteligente: Es un reemplazo para un puntero desnudo que realiza acciones adicionales cuando se accede a un objeto (contar referencias, bloquear, verificar, cargar bajo demanda)",
    "Tags": "use-case proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "What are the key participants in the Proxy pattern?",
    "BackEN": "- Proxy: Maintains a reference that lets the proxy access the real subject. Provides an interface identical to Subject's so that a proxy can be substituted for the real subject. Controls access to the real subject\n- Subject: Defines the common interface for RealSubject and Proxy so that a Proxy can be used anywhere a RealSubject is expected\n- RealSubject: Defines the real object that the proxy represents",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Proxy?",
    "BackES": "- Proxy: Mantiene una referencia que permite al proxy acceder al sujeto real. Proporciona una interfaz idéntica a Subject para que el proxy pueda sustituir al sujeto real. Controla el acceso al sujeto real y puede ser responsable de crear y eliminar el sujeto\n- Subject: Define la interfaz común para RealSubject y Proxy para que un Proxy pueda usarse donde sea que se espere un RealSubject\n- RealSubject: Define el objeto real que el proxy representa",
    "Tags": "key-concepts proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Proxy pattern?",
    "BackEN": "Benefits:\n- A remote proxy can hide the fact that an object resides in a different address space\n- A virtual proxy can perform optimizations such as creating an object on demand\n- Both protection proxies and smart references allow additional housekeeping tasks when an object is accessed\n\nDrawbacks:\n- The proxy pattern can introduce a level of indirection that may impact performance\n- Some proxy types may be language-specific (like copy-on-write)",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Proxy?",
    "BackES": "Beneficios:\n- Proxy remoto puede ocultar el hecho de que un objeto reside en un espacio de direcciones diferente\n- Proxy virtual puede realizar optimizaciones como crear un objeto bajo demanda\n- Proxies de protección y referencias inteligentes permiten tareas de mantenimiento adicionales cuando se accede a un objeto\n- Copy-on-write: Retrasa la copia de un objeto hasta que un cliente realmente lo modifica (optimización relacionada con creación bajo demanda)\n\nDesventajas:\n- Introduce otro nivel de indirección que puede afectar el rendimiento\n- Agrega complejidad al código",
    "Tags": "benefits-drawbacks proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "What patterns are related to the Proxy pattern?",
    "BackEN": "- Adapter: An adapter provides a different interface to the object it adapts. In contrast, a proxy provides the same interface as its subject\n- Decorator: Although decorators can have similar implementations as proxies, decorators have a different purpose. A decorator adds one or more responsibilities to an object, whereas a proxy controls access to an object",
    "FrontES": "¿Qué patrones están relacionados con el patrón Proxy?",
    "BackES": "- Adapter: Un adaptador proporciona una interfaz diferente al objeto que adapta. En contraste, un proxy proporciona la misma interfaz que su sujeto. Sin embargo, un proxy usado para control de acceso podría negarse a realizar una operación que el sujeto realizará\n- Decorator: Aunque los decoradores pueden tener implementaciones similares a los proxies, los decoradores tienen un propósito diferente. Un decorador agrega una o más responsabilidades a un objeto, mientras que un proxy controla el acceso a un objeto",
    "Tags": "related-patterns proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "void ImageProxy::Draw(const Point& at) {\n    GetImage()->Draw(at);\n}\n\nImage* ImageProxy::GetImage() {\n    if (_image == 0) {\n        _image = new Image(_fileName);\n    }\n    return _image;\n}",
    "BackEN": "Pattern: Proxy\nKey elements: ImageProxy delays loading the actual Image from file until Draw() is called, implementing virtual proxy for lazy initialization of expensive objects",
    "FrontES": "class ImageProxy : public Graphic {\npublic:\n    ImageProxy(const char* imageFile);\n    virtual void Draw(const Point& at);\n    virtual void GetExtent(Point& extent);\nprotected:\n    Image* GetImage();\nprivate:\n    Image* _image;\n    Extent _extent;\n    char* _fileName;\n};",
    "BackES": "Patrón: Proxy\nElementos clave: Proxy virtual - ImageProxy pospone la creación de la Image costosa hasta que realmente se necesita en Draw(). Mantiene información mínima (_extent, _fileName) hasta que el objeto real se carga",
    "Tags": "code-example proxy structural cpp",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "What are key implementation considerations for the Proxy pattern?",
    "BackEN": "- Overloading the member access operator in C++: Makes it possible to mimic pointer dereferencing syntax seamlessly, but depends on knowing object's type at compile-time\n- Using doesNotUnderstand in Smalltalk: Can be used to support automatic forwarding of requests\n- Proxy doesn't always have to know the type of real subject: If Proxy can deal with subject solely through abstract interface, there's no need to make Proxy class for each RealSubject class",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Proxy?",
    "BackES": "- Sobrecarga de operadores en C++: Sobrecargar el operador -> permite que los proxies se comporten como punteros reales, accediendo transparentemente al objeto real\n- Usar directivas 'using' en C++: Permite importar selectivamente nombres de clases en el ámbito del proxy\n- Proxy no siempre necesita conocer el tipo del sujeto real: Si un proxy puede tratar con su sujeto solo a través de una interfaz abstracta, entonces no necesita conocer subclases concretas\n- Copy-on-write: Implementación de referencias inteligentes que solo copia cuando se modifica",
    "Tags": "implementation proxy structural",
    "Category": "Structural",
    "Page": "207"
  },
  {
    "FrontEN": "What is the intent of the Chain of Responsibility pattern?",
    "BackEN": "Avoid coupling the sender of a request to its receiver by giving more than one object a chance to handle the request. Chain the receiving objects and pass the request along the chain until an object handles it.",
    "FrontES": "¿Cuál es la intención del patrón Chain of Responsibility?",
    "BackES": "Evitar acoplar el emisor de una solicitud a su receptor dando a más de un objeto la oportunidad de manejar la solicitud. Encadenar los objetos receptores y pasar la solicitud a lo largo de la cadena hasta que un objeto la maneje.",
    "Tags": "intent chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "When would you use the Chain of Responsibility pattern?",
    "BackEN": "- More than one object may handle a request, and the handler isn't known a priori. The handler should be ascertained automatically\n- You want to issue a request to one of several objects without specifying the receiver explicitly\n- The set of objects that can handle a request should be specified dynamically",
    "FrontES": "¿Cuándo usarías el patrón Chain of Responsibility?",
    "BackES": "- Más de un objeto puede manejar una solicitud, y el manejador no se conoce a priori. El manejador debería determinarse automáticamente\n- Quieres emitir una solicitud a uno de varios objetos sin especificar el receptor explícitamente\n- El conjunto de objetos que puede manejar una solicitud debe especificarse dinámicamente",
    "Tags": "use-case chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are the key participants in the Chain of Responsibility pattern?",
    "BackEN": "- Handler: Defines an interface for handling requests and optionally implements the successor link\n- ConcreteHandler: Handles requests it is responsible for. Can access its successor. If the ConcreteHandler can handle the request, it does so; otherwise it forwards the request to its successor\n- Client: Initiates the request to a ConcreteHandler object on the chain",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Chain of Responsibility?",
    "BackES": "- Handler: Define una interfaz para manejar solicitudes. (opcional) Implementa el enlace del sucesor\n- ConcreteHandler: Maneja las solicitudes de las que es responsable. Puede acceder a su sucesor. Si el ConcreteHandler puede manejar la solicitud, lo hace; de lo contrario, la reenvía a su sucesor\n- Client: Inicia la solicitud a un objeto ConcreteHandler en la cadena",
    "Tags": "key-concepts chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Chain of Responsibility pattern?",
    "BackEN": "Benefits:\n- Reduced coupling: The pattern frees an object from knowing which other object handles a request. Both the receiver and the sender have no explicit knowledge of each other\n- Added flexibility in assigning responsibilities to objects: You can add or change responsibilities for handling a request by adding to or otherwise changing the chain at run-time\n\nDrawbacks:\n- Receipt isn't guaranteed: Since a request has no explicit receiver, there's no guarantee it'll be handled—the request can fall off the end of the chain without ever being handled",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Chain of Responsibility?",
    "BackES": "Beneficios:\n- Acoplamiento reducido: El patrón libera a un objeto de tener que saber qué otro objeto maneja una solicitud\n- Flexibilidad añadida en asignar responsabilidades a objetos: Puedes añadir o cambiar responsabilidades para manejar una solicitud cambiando la cadena en tiempo de ejecución\n\nDesventajas:\n- Recepción no garantizada: Dado que una solicitud no tiene un receptor explícito, no hay garantía de que se maneje - la solicitud puede caer al final de la cadena sin ser manejada\n- Puede ser difícil observar las características en tiempo de ejecución y depurar",
    "Tags": "benefits-drawbacks chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What patterns are related to the Chain of Responsibility pattern?",
    "BackEN": "- Composite: Chain of Responsibility is often applied in conjunction with Composite. There, a component's parent can act as its successor",
    "FrontES": "¿Qué patrones están relacionados con el patrón Chain of Responsibility?",
    "BackES": "- Chain of Responsibility a menudo se aplica junto con Composite. Allí, el padre de un componente puede actuar como su sucesor",
    "Tags": "related-patterns chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "void Button::HandleHelp() {\n    if (HasHelp()) {\n        // offer help on the button\n    } else {\n        HelpHandler::HandleHelp();\n    }\n}",
    "BackEN": "Pattern: Chain of Responsibility\nKey elements: Button checks if it has help for itself. If so, provides it; otherwise forwards the request to its successor in the chain via HelpHandler::HandleHelp()",
    "FrontES": "void HelpHandler::HandleHelp() {\n    if (_successor != 0) {\n        _successor->HandleHelp();\n    }\n}",
    "BackES": "Patrón: Chain of Responsibility\nElementos clave: Implementación predeterminada de HandleHelp reenvía la solicitud al sucesor. Las subclases sobrescriben esto para proporcionar ayuda específica o pasar la solicitud si no pueden manejarla",
    "Tags": "code-example chain-of-responsibility behavioral cpp",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are key implementation considerations for the Chain of Responsibility pattern?",
    "BackEN": "- Implementing the successor chain: Can define new links (usually in Handler) or use existing links like parent references\n- Connecting successors: Handler usually maintains successor and defines the interface\n- Representing requests: Can be hard-coded operation invocation (simple and safe), request code as parameter (supports open-ended set), or separate request objects",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Chain of Responsibility?",
    "BackES": "- Implementar la cadena de sucesores: Dos opciones: (a) Definir nuevos enlaces (generalmente en Handler pero ConcreteHandlers también podrían hacerlo), (b) Usar enlaces existentes (por ejemplo, enlaces padre en Composite)\n- Conectar sucesores: Si no hay referencias predefinidas, tendrás que mantenerlas tú mismo. Handler podría definir una interfaz para acceder a un sucesor y cambiar el sucesor si se permite en tiempo de ejecución\n- Representar solicitudes: Las opciones varían desde codificar fuertemente la operación (por ejemplo, HandleHelp) hasta usar un solo manejador con un código de solicitud. Este último es más flexible pero requiere un esquema de empaquetado y desempaquetado conveniente para parámetros",
    "Tags": "implementation chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "Which patterns use the concept 'Encapsulation of Variation'?",
    "BackEN": "Identify the aspects of your application that vary and separate them from what stays the same.\n\nPatterns: Bridge (separates abstraction from implementation), Decorator (separates core functionality from optional enhancements), Flyweight (separates intrinsic from extrinsic state), Proxy (separates actual object from its surrogate), Adapter (separates incompatible interfaces)",
    "FrontES": "Comparar Adapter vs Bridge",
    "BackES": "Similitudes:\n- Ambos promueven flexibilidad desacoplando una interfaz de una implementación\n- Ambos implican reenviar solicitudes desde una interfaz a otra\n\nDiferencias:\n- Adapter: Hace que dos interfaces existentes trabajen juntas (después del diseño). Se enfoca en la incompatibilidad de interfaces\n- Bridge: Separa interfaz de implementación desde el principio (durante el diseño). Permite que varíen independientemente\n- Adapter: Generalmente se aplica después de que el software está diseñado\n- Bridge: Se usa desde el principio en el diseño\n- Adapter: Principalmente cambia interfaz\n- Bridge: Permite que tanto la abstracción como la implementación cambien sin afectarse mutuamente\n\nCuándo usar cada uno:\n- Adapter: Cuando necesitas hacer que interfaces incompatibles trabajen juntas\n- Bridge: Cuando quieres evitar un enlace permanente entre abstracción e implementación",
    "Tags": "cross-cutting encapsulation-of-variation",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Composition over Inheritance'?",
    "BackEN": "Favor object composition over class inheritance. Instead of inheriting behavior, objects compose their behavior from other objects.\n\nPatterns: Composite, Decorator, Bridge, Adapter",
    "FrontES": "Comparar Composite vs Decorator",
    "BackES": "Similitudes:\n- Ambos tienen estructuras de clase similares basadas en composición recursiva\n- Ambos implican ensamblar objetos en estructuras de árbol\n\nDiferencias:\n- Composite: Representa jerarquías parte-todo. Se enfoca en agrupar objetos primitivos y compuestos uniformemente\n- Decorator: Agrega responsabilidades a objetos. Se enfoca en extender funcionalidad sin crear subclases\n- Composite: Diseñado para estructurar objetos en árboles. Puede tener múltiples hijos\n- Decorator: Diseñado para agregar responsabilidades dinámicamente. Típicamente tiene un solo componente hijo\n- Composite: Los componentes conocen sus hijos. Se enfoca en relaciones estructurales\n- Decorator: Los decoradores no saben sobre otros decoradores en la cadena. Se enfoca en extensión de responsabilidades\n\nCuándo usar cada uno:\n- Composite: Cuando necesitas tratar objetos individuales y composiciones uniformemente\n- Decorator: Cuando necesitas agregar responsabilidades a objetos individuales dinámicamente",
    "Tags": "cross-cutting composition-over-inheritance",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Program to Interface not Implementation'?",
    "BackEN": "Program to an interface, not an implementation. All structural patterns define abstract interfaces that hide implementation details. Clients interact through abstract interfaces, making the system more flexible and reusable.\n\nPatterns: Adapter, Bridge, Composite, Decorator, Facade, Flyweight, Proxy",
    "FrontES": "Comparar Decorator vs Proxy",
    "BackES": "Similitudes:\n- Ambos tienen implementaciones similares - envuelven otro objeto\n- Ambos reenvían solicitudes al objeto envuelto\n\nDiferencias:\n- Decorator: Agrega responsabilidades a un objeto. Se enfoca en extender funcionalidad\n- Proxy: Controla el acceso a un objeto. Se enfoca en gestionar cuándo/cómo se accede al objeto\n- Decorator: Los objetos pueden agregarse dinámicamente en tiempo de ejecución. Soporta composición recursiva de decoradores\n- Proxy: Generalmente establecido en tiempo de construcción\n- Decorator: El componente conoce a sus decoradores en cierta medida\n- Proxy: El sujeto no es consciente de su proxy\n- Decorator: Cambia lo que hace el objeto (agrega comportamiento)\n- Proxy: Controla cómo se accede al objeto (carga diferida, permisos, etc.)\n\nCuándo usar cada uno:\n- Decorator: Cuando necesitas agregar funcionalidad sin crear subclases\n- Proxy: Cuando necesitas controlar el acceso a un objeto o gestionar su ciclo de vida",
    "Tags": "cross-cutting program-to-interface",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Loose Coupling'?",
    "BackEN": "Strive for loosely coupled designs between objects that interact.\n\nPatterns: Facade (reduces coupling between clients and subsystems), Bridge (decouples abstraction from implementation), Chain of Responsibility (decouples senders from receivers), Proxy (controls access without tight coupling)",
    "FrontES": "Comparar Facade vs Mediator",
    "BackES": "Similitudes:\n- Ambos abstraen funcionalidad de clases existentes\n- Ambos pueden simplificar interacciones complejas\n\nDiferencias:\n- Facade: Abstrae la interfaz a objetos de subsistema. Unidireccional, las clases del subsistema no conocen la fachada\n- Mediator: Abstrae comunicación arbitraria entre objetos colegas. Bidireccional, los colegas conocen y se comunican con el mediador\n- Facade: No agrega nueva funcionalidad\n- Mediator: Centraliza funcionalidad que no pertenece a ningún colega\n\nCuándo usar cada uno:\n- Facade: Cuando se proporciona una interfaz más simple a un subsistema\n- Mediator: Cuando se centralizan comunicaciones complejas entre objetos",
    "Tags": "cross-cutting loose-coupling",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Single Responsibility Principle'?",
    "BackEN": "A class should have only one reason to change.\n\nPatterns: Decorator (adds single responsibilities dynamically), Facade (provides a single, simplified interface), Proxy (controls access as a single responsibility)",
    "FrontES": "¿Cuáles son usos incorrectos comunes del patrón Adapter?",
    "BackES": "- Usar adaptador cuando deberías rediseñar la interfaz desde el principio\n- Sobreusar adaptadores bidireccionales que agregan complejidad\n- Crear adaptadores para cada pequeña incompatibilidad de interfaz en lugar de estandarizar interfaces\n- Usar adaptador de clase con herencia múltiple cuando el adaptador de objeto sería más limpio\n- Olvidar que los adaptadores agregan un nivel de indirección que puede impactar el rendimiento",
    "Tags": "cross-cutting single-responsibility",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Transparency'?",
    "BackEN": "Making interfaces uniform so clients can treat objects polymorphically.\n\nPatterns: Composite (makes individual objects and compositions uniform), Decorator (makes decorated and undecorated objects interchangeable), Flyweight (shared and unshared objects have same interface)",
    "FrontES": "¿Cuáles son usos incorrectos comunes del patrón Composite?",
    "BackES": "- Hacer el diseño demasiado general cuando necesitas restringir tipos de componentes\n- No usar verificaciones en tiempo de ejecución para hacer cumplir restricciones de composición cuando el sistema de tipos no puede ayudar\n- Almacenar punteros de hijos en la clase Component base para todos los nodos, desperdiciando memoria en nodos hoja\n- No considerar el patrón Flyweight cuando el uso de memoria de las referencias padre se vuelve excesivo\n- Implementar operaciones de gestión de hijos en Component cuando la seguridad es más importante que la transparencia",
    "Tags": "cross-cutting transparency",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Recursive Composition'?",
    "BackEN": "Building complex structures from simpler ones through composition.\n\nPatterns: Composite (exemplifies this with part-whole hierarchies), Decorator (supports recursive wrapping of objects)",
    "FrontES": "¿Cuáles son usos incorrectos comunes del patrón Decorator?",
    "BackES": "- Crear demasiados objetos decoradores pequeños que hacen el sistema difícil de entender y depurar\n- Depender de la identidad del objeto cuando se usan decoradores (el objeto decorado no es idéntico al componente)\n- No mantener la interfaz Component ligera, haciendo el patrón más difícil de usar\n- Usar decoradores cuando el patrón Strategy sería mejor para cambiar el comportamiento interno\n- Olvidar que los decoradores cambian la piel pero no las entrañas de los objetos",
    "Tags": "cross-cutting recursive-composition",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Forwarding/Delegation'?",
    "BackEN": "One object forwarding requests to another object.\n\nPatterns: Proxy (forwards to RealSubject), Decorator (forwards to wrapped Component), Adapter (forwards to Adaptee), Bridge (forwards from Abstraction to Implementor), Chain of Responsibility (forwards along chain)",
    "FrontES": "¿Cuáles son usos incorrectos comunes del patrón Flyweight?",
    "BackES": "- Usar flyweight cuando la mayor parte del estado del objeto no puede hacerse extrínseco\n- No considerar los costos en tiempo de ejecución de transferir, encontrar o calcular estado extrínseco\n- Usar flyweight cuando la aplicación depende de la identidad del objeto\n- No usar FlyweightFactory, permitiendo que los clientes creen flyweights duplicados\n- Olvidar el conteo de referencias o la recolección de basura para objetos compartidos",
    "Tags": "cross-cutting delegation",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Lazy Initialization'?",
    "BackEN": "Deferring object creation until needed.\n\nPatterns: Proxy (virtual proxy creates expensive objects on demand), Flyweight (shares objects to reduce memory usage)",
    "FrontES": "¿Cuáles son usos incorrectos comunes del patrón Chain of Responsibility?",
    "BackES": "- No asegurar que al menos un manejador pueda manejar la solicitud (la recepción no está garantizada)\n- Crear cadenas que son demasiado largas, impactando el rendimiento\n- No configurar la cadena apropiadamente, causando que las solicitudes caigan al final\n- Usar cadena cuando necesitas manejo garantizado y deberías usar Command u otro patrón en su lugar\n- Hacer difícil observar y entender las características en tiempo de ejecución de la cadena",
    "Tags": "cross-cutting lazy-initialization",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Which patterns use the concept 'Indirection'?",
    "BackEN": "Introducing an intermediate layer to solve problems. All structural patterns introduce some level of indirection.\n\nPatterns: Adapter (converts interfaces), Proxy (provides a surrogate), Decorator (adds responsibilities), Bridge (separates interface from implementation), Facade (provides simplified interface), Flyweight (manages shared objects)",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Adapter?",
    "BackES": "- InterViews UI toolkit: La clase Composition adapta hijos Component simples a padres Component más complejos\n- Unidraw drawing editor framework: GraphicBlock adapta un Graphic a la interfaz Block orientada al diseño\n- ET++: Clase adaptadora TextShape para reutilizar clases de edición de texto\n- ObjectWorks/Smalltalk: PluggableAdaptor adapta objetos a la interfaz ValueModel",
    "Tags": "cross-cutting indirection",
    "Category": "Cross-Cutting",
    "Page": "137"
  },
  {
    "FrontEN": "Compare Adapter vs Bridge",
    "BackEN": "Similarities:\n- Both have similar structure with one object delegating to another\n- Both involve interface abstraction\n\nDifferences:\n- Adapter: Changes the interface of an existing object, usually applied after design\n- Bridge: Separates interface from implementation, used up-front in design to let both vary independently\n\nWhen to use each:\n- Adapter: When you need to make incompatible interfaces work together\n- Bridge: When you want abstraction and implementation to vary independently from the start",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Bridge?",
    "BackES": "- libg++ class library: Abstracción Window con implementación XWindow para el Sistema X Window\n- InterViews UI toolkit: Abstracción Glyph con diferentes implementaciones concretas para diferentes estándares de apariencia (Motif, Presentation Manager, OpenLook)\n- ET++: Diseño Window/WindowPort para independencia de plataforma",
    "Tags": "comparison adapter bridge",
    "Category": "Comparison",
    "Page": "139"
  },
  {
    "FrontEN": "Compare Decorator vs Adapter",
    "BackEN": "Similarities:\n- Both wrap an existing object\n- Both can modify behavior\n\nDifferences:\n- Decorator: Only changes object's responsibilities, not its interface. More transparent to the application\n- Adapter: Gives an object a completely new interface\n- Decorator: Supports recursive composition\n- Adapter: Does not support recursion\n\nWhen to use each:\n- Decorator: When adding responsibilities while keeping the same interface\n- Adapter: When converting one interface to another",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Composite?",
    "BackES": "- InterViews toolkit: Clase base Glyph para componentes visuales. Los Glyphs pueden contener otros glyphs\n- RTL Smalltalk compiler framework: Los árboles de análisis de programas son estructuras compuestas\n- Aplicaciones de gestión de cartera financiera: Activos individuales y agregados de activos tratados uniformemente\n- Smalltalk Model/View/Controller: La clase View era un Composite\n- Casi todos los toolkits de UI: VObjects de ET++, Styles y Graphics de InterViews",
    "Tags": "comparison decorator adapter",
    "Category": "Comparison",
    "Page": "175"
  },
  {
    "FrontEN": "Compare Decorator vs Composite",
    "BackEN": "Similarities:\n- Both have similar recursive structure\n- Often used together, usually with common parent class\n- Both can contain other components\n\nDifferences:\n- Decorator: Degenerate composite with only one component. Adds additional responsibilities\n- Composite: Can have many children. Intended for object aggregation\n\nWhen to use each:\n- Decorator: When dynamically adding responsibilities to individual objects\n- Composite: When representing part-whole hierarchies and treating objects uniformly",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Decorator?",
    "BackES": "- InterViews UI toolkit: Las subclases decoradoras MonoGlyph Border, Scroller agregan bordes y desplazamiento a componentes glyph\n- ET++ application framework: Clases VBorder y VScroller para desplazamiento y bordes\n- Smalltalk-80 Streams: Decoradores Stream para compresión, cifrado, filtrado\n- InterViews: DebuggingGlyph imprime información de depuración antes/después de reenviar\n- ParcPlace Smalltalk: PassivityWrapper habilita/deshabilita interacciones de usuario",
    "Tags": "comparison decorator composite",
    "Category": "Comparison",
    "Page": "175"
  },
  {
    "FrontEN": "Compare Decorator vs Strategy",
    "BackEN": "Similarities:\n- Both allow changing object behavior\n- Both provide alternatives to subclassing\n\nDifferences:\n- Decorator: Changes the skin of an object (external behavior)\n- Strategy: Changes the guts of an object (internal algorithm)\n- Decorator: Wraps the object\n- Strategy: Object contains strategy\n\nWhen to use each:\n- Decorator: When adding external responsibilities or behaviors\n- Strategy: When changing internal algorithms or behaviors",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Facade?",
    "BackES": "- ET++ application framework: Clases fachada de nivel superior simplifican tareas comunes en el subsistema\n- Choices operating system: FileSystemFacade proporciona una interfaz de alto nivel para operaciones del sistema de archivos\n- ObjectWorks/Smalltalk: El sistema Compiler usa la fachada Compiler\n- ET++: Fachada ProgrammingEnvironment para herramientas de navegación integradas",
    "Tags": "comparison decorator strategy",
    "Category": "Comparison",
    "Page": "175"
  },
  {
    "FrontEN": "Compare Proxy vs Decorator",
    "BackEN": "Similarities:\n- Both have similar implementations (wrap another object)\n- Both forward requests to wrapped object\n\nDifferences:\n- Proxy: Controls access to an object\n- Decorator: Adds one or more responsibilities to an object\n- Proxy: Usually manages lifecycle of subject\n- Decorator: Client manages component creation\n\nWhen to use each:\n- Proxy: When controlling access, lazy loading, or managing remote objects\n- Decorator: When dynamically adding responsibilities",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Flyweight?",
    "BackES": "- InterViews 3.0 Doc editor: Usa objetos glyph como flyweights para caracteres - 180,000 caracteres requirieron solo 480 objetos de caracteres\n- ET++: Usa flyweights para independencia de apariencia - Los objetos Layout son flyweights que definen el diseño y comportamiento de dibujo de widgets\n- Editores de documentos: Objetos de caracteres compartidos con estado de formato extrínseco\n- Implementaciones de cadenas: Muchas comparten almacenamiento de caracteres mediante copy-on-write",
    "Tags": "comparison proxy decorator",
    "Category": "Comparison",
    "Page": "207"
  },
  {
    "FrontEN": "Compare Proxy vs Adapter",
    "BackEN": "Similarities:\n- Both wrap another object\n- Both can modify how clients interact with object\n\nDifferences:\n- Proxy: Provides the same interface as its subject\n- Adapter: Provides a different interface to the object it adapts\n- Proxy: Usually doesn't change interface\n- Adapter: Explicitly converts between interfaces\n\nWhen to use each:\n- Proxy: When controlling access while maintaining interface\n- Adapter: When making incompatible interfaces work together",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Proxy?",
    "BackES": "- CORBA, Java RMI: Proxies remotos para sistemas de objetos distribuidos\n- Smalltalk-80 ObjectProxy: Proporciona una réplica exacta de la interfaz del objeto remoto\n- NEXTSTEP: La clase NXProxy forma la base del sistema de objetos distribuidos. Proporciona representantes locales para objetos que pueden estar distribuidos\n- McCullough and Schmucker: Proxy de adquisición perezosa convierte identificador de objeto en referencia de objeto real\n- ET++: Las clases de bloques de construcción de texto usan proxy virtual",
    "Tags": "comparison proxy adapter",
    "Category": "Comparison",
    "Page": "207"
  },
  {
    "FrontEN": "Compare Facade vs Mediator",
    "BackEN": "Similarities:\n- Both abstract functionality of existing classes\n- Both can simplify complex interactions\n\nDifferences:\n- Facade: Abstracts interface to subsystem objects. Unidirectional, subsystem classes don't know about facade\n- Mediator: Abstracts arbitrary communication between colleague objects. Bidirectional, colleagues are aware of and communicate with mediator\n- Facade: Doesn't add new functionality\n- Mediator: Centralizes functionality that doesn't belong in any one colleague\n\nWhen to use each:\n- Facade: When providing simpler interface to subsystem\n- Mediator: When centralizing complex communications between objects",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Chain of Responsibility?",
    "BackES": "- ET++ application framework: Chain of responsibility para ayuda sensible al contexto\n- Unidraw framework: Cadena para manejar eventos de interfaz de usuario\n- MacApp y Borland ObjectWindows: Cadenas de manejo de eventos",
    "Tags": "comparison facade mediator",
    "Category": "Comparison",
    "Page": "185"
  },
  {
    "FrontEN": "What is the intent of the Chain of Responsibility pattern?",
    "BackEN": "Avoid coupling the sender of a request to its receiver by giving more than one object a chance to handle the request. Chain the receiving objects and pass the request along the chain until an object handles it.",
    "FrontES": "¿Cuál es el propósito del patrón Chain of Responsibility?",
    "BackES": "Evitar el acoplamiento del emisor de una solicitud con su receptor dando a más de un objeto la oportunidad de manejar la solicitud. Encadenar los objetos receptores y pasar la solicitud a lo largo de la cadena hasta que un objeto la maneje.",
    "Tags": "intent chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "When would you use the Chain of Responsibility pattern?",
    "BackEN": "• More than one object may handle a request, and the handler isn't known a priori\n• You want to issue a request to one of several objects without specifying the receiver explicitly\n• The set of objects that can handle a request should be specified dynamically",
    "FrontES": "¿Cuándo usarías el patrón Chain of Responsibility?",
    "BackES": "• Más de un objeto puede manejar una solicitud, y el manejador no se conoce a priori\n• Quieres emitir una solicitud a uno de varios objetos sin especificar el receptor explícitamente\n• El conjunto de objetos que pueden manejar una solicitud debe especificarse dinámicamente",
    "Tags": "use-case chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are the key participants in the Chain of Responsibility pattern?",
    "BackEN": "• Handler: Defines an interface for handling requests and optionally implements the successor link\n• ConcreteHandler: Handles requests it is responsible for; can access its successor; if it can handle the request, it does so; otherwise it forwards the request to its successor\n• Client: Initiates the request to a ConcreteHandler object on the chain",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Chain of Responsibility?",
    "BackES": "• Handler: Define una interfaz para manejar solicitudes y opcionalmente implementa el enlace al sucesor\n• ConcreteHandler: Maneja las solicitudes de las que es responsable; puede acceder a su sucesor; si puede manejar la solicitud, lo hace; de lo contrario, reenvía la solicitud a su sucesor\n• Client: Inicia la solicitud a un objeto ConcreteHandler en la cadena",
    "Tags": "key-concepts chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Chain of Responsibility pattern?",
    "BackEN": "Benefits:\n• Reduced coupling - frees an object from knowing which other object handles a request\n• Added flexibility in assigning responsibilities to objects\n\nDrawbacks:\n• Receipt isn't guaranteed - a request can fall off the end of the chain without being handled\n• Can be hard to observe the runtime characteristics and debug",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Chain of Responsibility?",
    "BackES": "Beneficios:\n• Acoplamiento reducido - libera a un objeto de saber qué otro objeto maneja una solicitud\n• Mayor flexibilidad al asignar responsabilidades a objetos\n\nDesventajas:\n• No se garantiza la recepción - una solicitud puede caerse del final de la cadena sin ser manejada\n• Puede ser difícil observar las características en tiempo de ejecución y depurar",
    "Tags": "benefits-drawbacks chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What patterns are related to the Chain of Responsibility pattern?",
    "BackEN": "• Composite: Often used together with Chain of Responsibility to allow components to act as handlers in a chain",
    "FrontES": "¿Qué patrones están relacionados con el patrón Chain of Responsibility?",
    "BackES": "• Composite: A menudo se usa junto con Chain of Responsibility para permitir que los componentes actúen como manejadores en una cadena",
    "Tags": "related-patterns chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are key implementation considerations for the Chain of Responsibility pattern?",
    "BackEN": "• Implementing the successor chain - can be defined in Handler or by ConcreteHandlers\n• Representing requests - can range from hard-coded operation invocations to a separate request object\n• Automatic forwarding in Smalltalk - can use doesNotUnderstand mechanism",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Chain of Responsibility?",
    "BackES": "• Implementar la cadena de sucesores - puede definirse en Handler o por ConcreteHandlers\n• Representar solicitudes - puede variar desde invocaciones de operaciones codificadas hasta un objeto de solicitud separado\n• Reenvío automático en Smalltalk - puede usar el mecanismo doesNotUnderstand",
    "Tags": "implementation chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What are real-world examples of the Chain of Responsibility pattern?",
    "BackEN": "• ET++ uses Chain of Responsibility to handle graphical update\n• Unidraw framework uses it for dispatching commands\n• Context-sensitive help facilities in GUIs\n• Event bubbling in DOM (browser event handling)",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Chain of Responsibility?",
    "BackES": "• ET++ usa Chain of Responsibility para manejar actualizaciones gráficas\n• El framework Unidraw lo usa para despachar comandos\n• Facilidades de ayuda contextual en GUIs\n• Propagación de eventos en DOM (manejo de eventos del navegador)",
    "Tags": "real-world chain-of-responsibility behavioral",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "What is the intent of the Command pattern?",
    "BackEN": "Encapsulate a request as an object, thereby letting you parameterize clients with different requests, queue or log requests, and support undoable operations.",
    "FrontES": "¿Cuál es el propósito del patrón Command?",
    "BackES": "Encapsular una solicitud como un objeto, permitiendo así parametrizar clientes con diferentes solicitudes, poner en cola o registrar solicitudes, y soportar operaciones reversibles.",
    "Tags": "intent command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "When would you use the Command pattern?",
    "BackEN": "• Parameterize objects by an action to perform (alternative to callbacks)\n• Specify, queue, and execute requests at different times\n• Support undo - Command's Execute operation can store state for reversing its effects\n• Support logging changes so they can be reapplied in case of a system crash\n• Structure a system around high-level operations built on primitives operations",
    "FrontES": "¿Cuándo usarías el patrón Command?",
    "BackES": "• Parametrizar objetos por una acción a realizar (alternativa a callbacks)\n• Especificar, poner en cola y ejecutar solicitudes en diferentes momentos\n• Soportar deshacer - la operación Execute de Command puede almacenar estado para revertir sus efectos\n• Soportar registro de cambios para que puedan reaplicarse en caso de fallo del sistema\n• Estructurar un sistema alrededor de operaciones de alto nivel construidas sobre operaciones primitivas",
    "Tags": "use-case command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What are the key participants in the Command pattern?",
    "BackEN": "• Command: Declares an interface for executing an operation\n• ConcreteCommand: Defines a binding between a Receiver object and an action; implements Execute by invoking the corresponding operations on Receiver\n• Client: Creates a ConcreteCommand object and sets its receiver\n• Invoker: Asks the command to carry out the request\n• Receiver: Knows how to perform the operations associated with carrying out a request",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Command?",
    "BackES": "• Command: Declara una interfaz para ejecutar una operación\n• ConcreteCommand: Define un vínculo entre un objeto Receiver y una acción; implementa Execute invocando las operaciones correspondientes en Receiver\n• Client: Crea un objeto ConcreteCommand y establece su receptor\n• Invoker: Le pide al comando que lleve a cabo la solicitud\n• Receiver: Sabe cómo realizar las operaciones asociadas con llevar a cabo una solicitud",
    "Tags": "key-concepts command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Command pattern?",
    "BackEN": "Benefits:\n• Command decouples the object that invokes the operation from the one that knows how to perform it\n• Commands are first-class objects - they can be manipulated and extended like any other object\n• You can assemble commands into a composite command\n• It's easy to add new Commands because you don't have to change existing classes\n\nDrawbacks:\n• Can result in lots of trivial command subclasses",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Command?",
    "BackES": "Beneficios:\n• Command desacopla el objeto que invoca la operación del que sabe cómo realizarla\n• Los comandos son objetos de primera clase - pueden manipularse y extenderse como cualquier otro objeto\n• Puedes ensamblar comandos en un comando compuesto\n• Es fácil agregar nuevos Commands porque no tienes que cambiar clases existentes\n\nDesventajas:\n• Puede resultar en muchas subclases de comando triviales",
    "Tags": "benefits-drawbacks command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What patterns are related to the Command pattern?",
    "BackEN": "• Composite: Can be used to implement MacroCommands\n• Memento: Can keep state the command requires to undo its effect\n• Prototype: A command that must be copied before being placed on the history list acts as a Prototype",
    "FrontES": "¿Qué patrones están relacionados con el patrón Command?",
    "BackES": "• Composite: Puede usarse para implementar MacroCommands\n• Memento: Puede mantener el estado que el comando requiere para deshacer su efecto\n• Prototype: Un comando que debe copiarse antes de colocarse en la lista de historial actúa como un Prototype",
    "Tags": "related-patterns command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What are key implementation considerations for the Command pattern?",
    "BackEN": "• How intelligent should a command be - can range from merely defining a binding between receiver and actions to implementing everything itself\n• Supporting undo and redo - requires storing additional state (history list, Memento pattern)\n• Avoiding error accumulation in the undo process - use Memento to give Command access to receiver state\n• Using C++ templates - can avoid creating Command subclasses for simple commands",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Command?",
    "BackES": "• Qué tan inteligente debe ser un comando - puede variar desde simplemente definir un vínculo entre receptor y acciones hasta implementar todo por sí mismo\n• Soportar deshacer y rehacer - requiere almacenar estado adicional (lista de historial, patrón Memento)\n• Evitar acumulación de errores en el proceso de deshacer - usar Memento para dar acceso a Command al estado del receptor\n• Usar plantillas de C++ - puede evitar crear subclases de Command para comandos simples",
    "Tags": "implementation command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What are real-world examples of the Command pattern?",
    "BackEN": "• ET++ MenuItems - each is a Command subclass instance\n• InterViews command-based text editor with undo/redo\n• Unidraw framework - commands support undo/redo and unlimited-level undo\n• MacApp and Bedrock frameworks use Command pattern\n• GUI button actions and menu items\n• Transaction-based systems",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Command?",
    "BackES": "• MenuItems de ET++ - cada uno es una instancia de subclase de Command\n• Editor de texto basado en comandos de InterViews con deshacer/rehacer\n• Framework Unidraw - los comandos soportan deshacer/rehacer y deshacer de nivel ilimitado\n• Los frameworks MacApp y Bedrock usan el patrón Command\n• Acciones de botones GUI e ítems de menú\n• Sistemas basados en transacciones",
    "Tags": "real-world command behavioral",
    "Category": "Behavioral",
    "Page": "233"
  },
  {
    "FrontEN": "What is the intent of the Interpreter pattern?",
    "BackEN": "Given a language, define a representation for its grammar along with an interpreter that uses the representation to interpret sentences in the language.",
    "FrontES": "¿Cuál es el propósito del patrón Interpreter?",
    "BackES": "Dado un lenguaje, definir una representación para su gramática junto con un intérprete que use la representación para interpretar oraciones en el lenguaje.",
    "Tags": "intent interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "When would you use the Interpreter pattern?",
    "BackEN": "• The grammar is simple - for complex grammars, the class hierarchy becomes large and unmanageable\n• Efficiency is not a critical concern - the most efficient interpreters are usually not implemented by interpreting parse trees directly",
    "FrontES": "¿Cuándo usarías el patrón Interpreter?",
    "BackES": "• Cuando hay un lenguaje a interpretar y puedes representar declaraciones en el lenguaje como árboles sintácticos abstractos\n• La gramática es simple - para gramáticas complejas, la jerarquía de clases se vuelve inmanejable\n• La eficiencia no es una preocupación crítica",
    "Tags": "use-case interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What are the key participants in the Interpreter pattern?",
    "BackEN": "• AbstractExpression: Declares an abstract Interpret operation common to all nodes in the abstract syntax tree\n• TerminalExpression: Implements an Interpret operation associated with terminal symbols in the grammar\n• NonterminalExpression: One such class is required for every rule in the grammar; maintains instance variables of type AbstractExpression for each symbol; implements Interpret by calling Interpret on each subexpression\n• Context: Contains information that's global to the interpreter\n• Client: Builds (or is given) an abstract syntax tree representing a particular sentence in the language; invokes the Interpret operation",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Interpreter?",
    "BackES": "• AbstractExpression: Declara una operación Interpret abstracta común a todos los nodos en el árbol sintáctico abstracto\n• TerminalExpression: Implementa una operación Interpret asociada con símbolos terminales en la gramática\n• NonterminalExpression: Se necesita una clase para cada regla en la gramática; mantiene variables de instancia de tipo AbstractExpression\n• Context: Contiene información global para el intérprete\n• Client: Construye el árbol sintáctico abstracto e invoca la operación Interpret",
    "Tags": "key-concepts interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Interpreter pattern?",
    "BackEN": "Benefits:\n• It's easy to change and extend the grammar - can use inheritance to change or extend the grammar\n• Implementing the grammar is easy - classes defining nodes in the abstract syntax tree have similar implementations\n\nDrawbacks:\n• Complex grammars are hard to maintain - the Interpreter pattern defines at least one class for every rule in the grammar, making it hard to manage",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Interpreter?",
    "BackES": "Beneficios:\n• Es fácil cambiar y extender la gramática\n• Implementar la gramática es fácil - las clases que definen nodos en el árbol sintáctico abstracto tienen implementaciones similares\n• Agregar nuevas formas de interpretar expresiones es fácil\n\nDesventajas:\n• Gramáticas complejas son difíciles de mantener - la jerarquía de clases se vuelve grande e inmanejable\n• Puede ser menos eficiente que otras técnicas de análisis",
    "Tags": "benefits-drawbacks interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What patterns are related to the Interpreter pattern?",
    "BackEN": "• Composite: The abstract syntax tree is an instance of the Composite pattern\n• Flyweight: Shows how to share terminal symbols within the abstract syntax tree\n• Iterator: The interpreter can use an Iterator to traverse the structure\n• Visitor: Can be used to maintain the behavior in each node in one class",
    "FrontES": "¿Qué patrones están relacionados con el patrón Interpreter?",
    "BackES": "• Composite: El árbol sintáctico abstracto es una instancia del patrón Composite\n• Flyweight: Muestra cómo compartir símbolos terminales dentro del árbol sintáctico abstracto\n• Iterator: El intérprete puede usar un Iterator para recorrer la estructura\n• Visitor: Puede usarse para mantener el comportamiento en cada nodo en el árbol sintáctico abstracto en una clase",
    "Tags": "related-patterns interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What are key implementation considerations for the Interpreter pattern?",
    "BackEN": "• Creating the abstract syntax tree - the Interpreter pattern doesn't explain how to create it (can use parser)\n• Defining the Interpret operation - don't have to define it in the expression classes if many different interpretations are needed\n• Sharing terminal symbols with the Flyweight pattern - when grammar has many terminals, Flyweight can reduce storage",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Interpreter?",
    "BackES": "• Crear el árbol sintáctico abstracto - el patrón Interpreter no explica cómo crear un árbol sintáctico abstracto (considera usar un analizador)\n• Definir la operación Interpret - no tienes que definir la operación Interpret en la clase de expresión; puede usar Visitor en su lugar\n• Compartir símbolos terminales con Flyweight - especialmente útil cuando una oración contiene muchas instancias de un símbolo terminal",
    "Tags": "implementation interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What are real-world examples of the Interpreter pattern?",
    "BackEN": "• Compiler front-ends often use Interpreter pattern for parsing and evaluating expressions\n• Regular expression matchers\n• SQL query interpreters\n• Mathematical expression evaluators",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Interpreter?",
    "BackES": "• Compiladores e intérpretes de lenguajes de programación\n• Evaluadores de expresiones regulares\n• Evaluadores de expresiones SQL\n• Procesadores de lenguajes de consulta\n• Analizadores de fórmulas matemáticas",
    "Tags": "real-world interpreter behavioral",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What is the intent of the Iterator pattern?",
    "BackEN": "Provide a way to access the elements of an aggregate object sequentially without exposing its underlying representation.",
    "FrontES": "¿Cuál es el propósito del patrón Iterator?",
    "BackES": "Proporcionar una forma de acceder a los elementos de un objeto agregado secuencialmente sin exponer su representación subyacente.",
    "Tags": "intent iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "When would you use the Iterator pattern?",
    "BackEN": "• To access an aggregate object's contents without exposing its internal representation\n• To support multiple traversals of aggregate objects\n• To provide a uniform interface for traversing different aggregate structures (polymorphic iteration)",
    "FrontES": "¿Cuándo usarías el patrón Iterator?",
    "BackES": "• Para acceder al contenido de un objeto agregado sin exponer su representación interna\n• Para soportar múltiples recorridos de objetos agregados\n• Para proporcionar una interfaz uniforme para recorrer diferentes estructuras agregadas (es decir, para soportar iteración polimórfica)",
    "Tags": "use-case iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What are the key participants in the Iterator pattern?",
    "BackEN": "• Iterator: Defines an interface for accessing and traversing elements\n• ConcreteIterator: Implements the Iterator interface; keeps track of the current position in the traversal\n• Aggregate: Defines an interface for creating an Iterator object\n• ConcreteAggregate: Implements the Iterator creation interface to return an instance of the proper ConcreteIterator",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Iterator?",
    "BackES": "• Iterator: Define una interfaz para acceder y recorrer elementos\n• ConcreteIterator: Implementa la interfaz Iterator; lleva registro de la posición actual en el recorrido del agregado\n• Aggregate: Define una interfaz para crear un objeto Iterator\n• ConcreteAggregate: Implementa la interfaz de creación de Iterator para devolver una instancia del ConcreteIterator apropiado",
    "Tags": "key-concepts iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Iterator pattern?",
    "BackEN": "Benefits:\n• It supports variations in the traversal of an aggregate\n• Iterators simplify the Aggregate interface\n• More than one traversal can be pending on an aggregate\n\nDrawbacks:\n• Adding new traversal operations may require changing the iterator interface",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Iterator?",
    "BackES": "Beneficios:\n• Soporta variaciones en el recorrido de un agregado\n• Los iteradores simplifican la interfaz Aggregate\n• Puede haber más de un recorrido pendiente en un agregado\n\nDesventajas:\n• Puede requerir acceso privilegiado a la estructura interna del agregado\n• Agregar nuevas operaciones de recorrido requiere extender la interfaz Iterator",
    "Tags": "benefits-drawbacks iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What patterns are related to the Iterator pattern?",
    "BackEN": "• Composite: Iterators are often applied to recursive structures such as Composites\n• Factory Method: Polymorphic iterators rely on factory methods to instantiate the appropriate Iterator subclass\n• Memento: Can be used in conjunction with the Iterator pattern for capturing iteration state",
    "FrontES": "¿Qué patrones están relacionados con el patrón Iterator?",
    "BackES": "• Composite: Los iteradores a menudo se aplican a estructuras recursivas como Composite\n• Factory Method: Los iteradores polimórficos dependen de métodos de fábrica para instanciar la subclase de iterador apropiada\n• Memento: Puede usarse junto con el patrón Iterator para capturar el estado de una iteración",
    "Tags": "related-patterns iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What are key implementation considerations for the Iterator pattern?",
    "BackEN": "• Who controls the iteration - external iterator (client) vs internal iterator (iterator itself)\n• Who defines the traversal algorithm - iterator or aggregate\n• How robust is the iterator - is it safe to modify the aggregate during traversal\n• Additional Iterator operations - Previous, SkipTo, etc.\n• Using polymorphic iterators in C++ - require dynamic allocation and deallocation\n• Iterators may have privileged access - can be made friends of their aggregate\n• Iterators for composites - external vs internal iterators for complex structures\n• Null iterators - degenerate iterator that's always done with traversal",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Iterator?",
    "BackES": "• ¿Quién controla la iteración? - Iterador externo (cliente controla) vs. iterador interno (iterador controla)\n• ¿Quién define el algoritmo de recorrido? - el iterador o el agregado\n• Qué tan robusto es el iterador - ¿es seguro modificar el agregado durante el recorrido?\n• Operaciones de iterador adicionales - pueden ser útiles operaciones como Previous, SkipTo\n• Usar iteradores polimórficos en C++ - requiere que el iterador se asigne dinámicamente\n• Iteradores con privilegios - el iterador puede necesitar acceso privilegiado al agregado",
    "Tags": "implementation iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What are real-world examples of the Iterator pattern?",
    "BackEN": "• Booch components - provide fixed set of iterators for each collection\n• ET++ iterators work only on Composite structures and are tied to specific aggregate classes\n• InterViews - polymorphic Cursor-based iterator for traversing object structures\n• ObjectWindows library uses TListIterator for LISP-style access\n• Java Collections Framework Iterator\n• Python's iterator protocol\n• C++ STL iterators",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Iterator?",
    "BackES": "• Biblioteca de plantillas estándar de C++ (STL) - extenso uso de iteradores\n• Enumeradores de Java\n• Iteradores de colecciones de Python\n• Enumerables de .NET\n• Cursores de base de datos",
    "Tags": "real-world iterator behavioral",
    "Category": "Behavioral",
    "Page": "257"
  },
  {
    "FrontEN": "What is the intent of the Mediator pattern?",
    "BackEN": "Define an object that encapsulates how a set of objects interact. Mediator promotes loose coupling by keeping objects from referring to each other explicitly, and it lets you vary their interaction independently.",
    "FrontES": "¿Cuál es el propósito del patrón Mediator?",
    "BackES": "Definir un objeto que encapsule cómo interactúa un conjunto de objetos. Mediator promueve el acoplamiento débil al evitar que los objetos se refieran entre sí explícitamente, y te permite variar su interacción independientemente.",
    "Tags": "intent mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "When would you use the Mediator pattern?",
    "BackEN": "• A set of objects communicate in well-defined but complex ways\n• Reusing an object is difficult because it refers to and communicates with many other objects\n• A behavior distributed between several classes should be customizable without a lot of subclassing",
    "FrontES": "¿Cuándo usarías el patrón Mediator?",
    "BackES": "• Un conjunto de objetos se comunica de formas bien definidas pero complejas, resultando en interdependencias no estructuradas y difíciles de entender\n• Reutilizar un objeto es difícil porque se refiere y se comunica con muchos otros objetos\n• Un comportamiento que está distribuido entre varias clases debe ser personalizable sin mucha creación de subclases",
    "Tags": "use-case mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What are the key participants in the Mediator pattern?",
    "BackEN": "• Mediator: Defines an interface for communicating with Colleague objects\n• ConcreteMediator: Implements cooperative behavior by coordinating Colleague objects; knows and maintains its colleagues\n• Colleague classes: Each Colleague class knows its Mediator object; each colleague communicates with its mediator whenever it would have otherwise communicated with another colleague",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Mediator?",
    "BackES": "• Mediator: Define una interfaz para comunicarse con objetos Colleague\n• ConcreteMediator: Implementa el comportamiento cooperativo coordinando objetos Colleague; conoce y mantiene a sus colegas\n• Colleague classes: Cada clase Colleague conoce su objeto Mediator; cada colega se comunica con su mediador cuando de otro modo se habría comunicado con otro colega",
    "Tags": "key-concepts mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Mediator pattern?",
    "BackEN": "Benefits:\n• It limits subclassing - localizes behavior that would otherwise be distributed\n• It decouples colleagues - promotes loose coupling between colleagues\n• It simplifies object protocols - replaces many-to-many interactions with one-to-many\n• It abstracts how objects cooperate - can vary interaction independently\n• It centralizes control - trades complexity of interaction for complexity in the mediator\n\nDrawbacks:\n• The mediator can become monolithic and hard to maintain",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Mediator?",
    "BackES": "Beneficios:\n• Limita la creación de subclases - el Mediator localiza el comportamiento que de otro modo estaría distribuido entre varios objetos\n• Desacopla colegas - promueve el acoplamiento débil entre colegas\n• Simplifica los protocolos de objetos - reemplaza las interacciones muchos-a-muchos con interacciones uno-a-muchos\n• Abstrae cómo cooperan los objetos - centralizando el control\n\nDesventajas:\n• Puede centralizar el control - el mediador mismo puede volverse un monolito complejo",
    "Tags": "benefits-drawbacks mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What patterns are related to the Mediator pattern?",
    "BackEN": "• Facade: Differs from Mediator in that it abstracts a subsystem to provide a simpler interface (unidirectional vs bidirectional)\n• Observer: Colleagues can communicate with the mediator using the Observer pattern",
    "FrontES": "¿Qué patrones están relacionados con el patrón Mediator?",
    "BackES": "• Facade: Abstrae un subsistema para proporcionar una interfaz más conveniente, pero es unidireccional mientras Mediator es bidireccional\n• Observer: Los colegas pueden comunicarse con el mediador usando el patrón Observer",
    "Tags": "related-patterns mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What are key implementation considerations for the Mediator pattern?",
    "BackEN": "• Omitting the abstract Mediator class - when colleagues work with only one mediator\n• Colleague-Mediator communication - can use Observer pattern for communication between colleagues and mediator",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Mediator?",
    "BackES": "• Omitir la clase abstracta Mediator - no hay necesidad cuando los colegas trabajan con un solo mediador\n• Comunicación Colleague-Mediator - puede implementarse usando el patrón Observer para que el mediador actúe como Observer",
    "Tags": "implementation mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What are real-world examples of the Mediator pattern?",
    "BackEN": "• ET++ - ChangeManager mediates consistency between UI elements and application data\n• Smalltalk/V - application framework uses mediator-like approach\n• Dialog boxes coordinating widget interactions\n• Air traffic control systems\n• Chat room servers coordinating messages between users",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Mediator?",
    "BackES": "• Sistemas de diálogo GUI - widgets se comunican a través de un director de diálogo\n• Torre de control de aeropuerto - coordina despegues y aterrizajes\n• Salas de chat - mediador maneja mensajes entre usuarios\n• Sistemas de automatización del hogar - hub central coordina dispositivos\n• Controladores de juegos multijugador",
    "Tags": "real-world mediator behavioral",
    "Category": "Behavioral",
    "Page": "273"
  },
  {
    "FrontEN": "What is the intent of the Memento pattern?",
    "BackEN": "Without violating encapsulation, capture and externalize an object's internal state so that the object can be restored to this state later.",
    "FrontES": "¿Cuál es el propósito del patrón Memento?",
    "BackES": "Sin violar la encapsulación, capturar y externalizar el estado interno de un objeto para que el objeto pueda restaurarse a este estado posteriormente.",
    "Tags": "intent memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "When would you use the Memento pattern?",
    "BackEN": "• A snapshot of an object's state must be saved so it can be restored later\n• A direct interface to obtaining the state would expose implementation details and break the object's encapsulation",
    "FrontES": "¿Cuándo usarías el patrón Memento?",
    "BackES": "• Una instantánea del estado de un objeto (o una porción de él) debe guardarse para que pueda restaurarse a ese estado posteriormente\n• Una interfaz directa para obtener el estado expondría detalles de implementación y rompería la encapsulación del objeto",
    "Tags": "use-case memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What are the key participants in the Memento pattern?",
    "BackEN": "• Memento: Stores internal state of the Originator object; protects against access by objects other than the originator\n• Originator: Creates a memento containing a snapshot of its current internal state; uses the memento to restore its internal state\n• Caretaker: Is responsible for the memento's safekeeping; never operates on or examines the contents of a memento",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Memento?",
    "BackES": "• Memento: Almacena el estado interno del objeto Originator; protege contra acceso de objetos distintos al originator\n• Originator: Crea un memento que contiene una instantánea de su estado interno actual; usa el memento para restaurar su estado interno\n• Caretaker: Es responsable de salvaguardar el memento; nunca opera o examina el contenido de un memento",
    "Tags": "key-concepts memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Memento pattern?",
    "BackEN": "Benefits:\n• Preserving encapsulation boundaries - avoids exposing internal state\n• It simplifies Originator - keeping versions of internal state would burden the Originator\n\nDrawbacks:\n• Using mementos might be expensive - copying large amounts of state can be costly\n• Defining narrow and wide interfaces - may be difficult in some languages to ensure only the originator can access the memento's state\n• Hidden costs in caring for mementos - caretaker must track memento lifetime but doesn't know how much state is in the memento",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Memento?",
    "BackES": "Beneficios:\n• Preserva los límites de encapsulación - evita exponer información que solo un Originator debería manejar\n• Simplifica Originator - mantener versiones del estado interno del Originator podría transferir complejidad al Caretaker\n\nDesventajas:\n• Usar mementos podría ser costoso - si el Originator debe copiar grandes cantidades de información o si los clientes crean y devuelven mementos al originator con frecuencia\n• Definir interfaces estrechas y amplias puede ser difícil en algunos lenguajes\n• Costos ocultos en cuidar mementos - un caretaker es responsable de eliminar los mementos que cuida",
    "Tags": "benefits-drawbacks memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What patterns are related to the Memento pattern?",
    "BackEN": "• Command: Commands can use mementos to maintain state for undoable operations\n• Iterator: Mementos can be used for iteration state",
    "FrontES": "¿Qué patrones están relacionados con el patrón Memento?",
    "BackES": "• Command: Los comandos pueden usar mementos para mantener el estado para operaciones deshacer\n• Iterator: Los mementos pueden usarse para iteración como se describió anteriormente",
    "Tags": "related-patterns memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What are key implementation considerations for the Memento pattern?",
    "BackEN": "• Language support - Memento has two interfaces: wide (only Originator) and narrow (other objects). C++ friend mechanism can enforce this\n• Storing incremental changes - if mementos are created frequently, storing only incremental changes can reduce storage costs",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Memento?",
    "BackES": "• Preservación de la encapsulación - usar interfaces 'amplias' y 'estrechas' con amigos en C++ u otras técnicas específicas del lenguaje\n• Almacenar diferencias incrementales - si los mementos se crean frecuentemente, almacenar solo cambios incrementales",
    "Tags": "implementation memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What are real-world examples of the Memento pattern?",
    "BackEN": "• Unidraw drawing editor framework - uses Command and Memento patterns for unlimited-level undo/redo\n• Text editor undo/redo mechanisms\n• Database transaction rollback\n• Game save states",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Memento?",
    "BackES": "• Editor Qoca de restricciones usa Memento para soportar deshacer/rehacer\n• Sistemas de deshacer/rehacer en editores de texto\n• Características de guardar juegos\n• Funcionalidad de volver atrás del navegador\n• Mecanismos de rollback de transacciones de bases de datos",
    "Tags": "real-world memento behavioral",
    "Category": "Behavioral",
    "Page": "283"
  },
  {
    "FrontEN": "What is the intent of the Observer pattern?",
    "BackEN": "Define a one-to-many dependency between objects so that when one object changes state, all its dependents are notified and updated automatically.",
    "FrontES": "¿Cuál es el propósito del patrón Observer?",
    "BackES": "Definir una dependencia de uno a muchos entre objetos de modo que cuando un objeto cambie de estado, todos sus dependientes sean notificados y actualizados automáticamente.",
    "Tags": "intent observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "When would you use the Observer pattern?",
    "BackEN": "• When an abstraction has two aspects, one dependent on the other - encapsulating these in separate objects lets you vary and reuse them independently\n• When a change to one object requires changing others, and you don't know how many objects need to be changed\n• When an object should be able to notify other objects without making assumptions about who these objects are",
    "FrontES": "¿Cuándo usarías el patrón Observer?",
    "BackES": "• Cuando una abstracción tiene dos aspectos, uno dependiente del otro. Encapsular estos aspectos en objetos separados te permite variarlos y reutilizarlos independientemente\n• Cuando un cambio a un objeto requiere cambiar otros, y no sabes cuántos objetos necesitan cambiarse\n• Cuando un objeto debe ser capaz de notificar a otros objetos sin hacer suposiciones sobre quiénes son estos objetos",
    "Tags": "use-case observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What are the key participants in the Observer pattern?",
    "BackEN": "• Subject: Knows its observers; provides an interface for attaching and detaching Observer objects\n• Observer: Defines an updating interface for objects that should be notified of changes in a subject\n• ConcreteSubject: Stores state of interest to ConcreteObserver objects; sends a notification to its observers when its state changes\n• ConcreteObserver: Maintains a reference to a ConcreteSubject object; stores state that should stay consistent with the subject's; implements the Observer updating interface",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Observer?",
    "BackES": "• Subject: Conoce a sus observadores; cualquier número de objetos Observer pueden observar un subject; proporciona una interfaz para adjuntar y desconectar objetos Observer\n• Observer: Define una interfaz de actualización para objetos que deben ser notificados de cambios en un subject\n• ConcreteSubject: Almacena el estado de interés para los objetos ConcreteObserver; envía una notificación a sus observadores cuando su estado cambia\n• ConcreteObserver: Mantiene una referencia a un objeto ConcreteSubject; almacena el estado que debe permanecer consistente con el del subject; implementa la interfaz de actualización de Observer",
    "Tags": "key-concepts observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Observer pattern?",
    "BackEN": "Benefits:\n• Abstract coupling between Subject and Observer - subject doesn't know concrete class of observers\n• Support for broadcast communication - notification is broadcast automatically\n\nDrawbacks:\n• Unexpected updates - a seemingly harmless operation can cause a cascade of updates\n• Update overhead - observers don't know about each other and can't assess the cost of updates",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Observer?",
    "BackES": "Beneficios:\n• Acoplamiento abstracto entre Subject y Observer - el subject no conoce las clases concretas de sus observadores\n• Soporte para comunicación de difusión - la notificación se envía automáticamente a todos los objetos interesados\n\nDesventajas:\n• Actualizaciones inesperadas - los observadores no tienen conocimiento de la presencia de otros y pueden estar ciegos al costo de cambiar el subject\n• Puede provocar cascadas de actualizaciones - un pequeño cambio puede desencadenar múltiples actualizaciones",
    "Tags": "benefits-drawbacks observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What patterns are related to the Observer pattern?",
    "BackEN": "• Mediator: ChangeManager acts as mediator between subjects and observers\n• Singleton: ChangeManager may use Singleton to make it unique and globally accessible",
    "FrontES": "¿Qué patrones están relacionados con el patrón Observer?",
    "BackES": "• Mediator: Al encapsular semántica compleja de actualización, el ChangeManager actúa como mediador entre subjects y observers\n• Singleton: El ChangeManager puede usar el patrón Singleton para hacerlo único y accesible globalmente",
    "Tags": "related-patterns observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What are key implementation considerations for the Observer pattern?",
    "BackEN": "• Mapping subjects to their observers - can use hash table or store directly in subject\n• Observing more than one subject - observer may need to know which subject sent the notification\n• Who triggers the update - subject or clients (trade-off between frequency and consistency)\n• Dangling references to deleted subjects - subject should notify observers when it's deleted\n• Making sure Subject state is self-consistent before notification - use template methods\n• Avoiding observer-specific update protocols - push model vs pull model\n• Specifying modifications of interest explicitly - extend subject's registration to include events of interest\n• Encapsulating complex update semantics - ChangeManager to minimize work required to make observers consistent",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Observer?",
    "BackES": "• Mapeo de subjects a observers - puede usar tabla hash para mapeo, o almacenar referencias en subjects directamente\n• Observar más de un subject - puede ser útil extender la interfaz de actualización para que el observer sepa qué subject envió la notificación\n• Quién desencadena la actualización - hacer que los clients llamen a Notify después de cambiar el estado del subject, o hacer que el subject notifique automáticamente\n• Referencias colgantes a subjects eliminados - asegurarse de que los observers liberen sus referencias cuando se elimina un subject\n• Asegurar consistencia del estado del Subject antes de la notificación - usar plantilla de método en la clase Subject\n• Evitar protocolos de actualización específicos del observador - modelos push y pull\n• Especificar modificaciones de interés explícitamente - extender la interfaz de registro del subject para permitir aspectos de interés\n• Encapsular semántica compleja de actualización - usar un objeto ChangeManager cuando la relación entre subjects y observers sea particularmente compleja",
    "Tags": "implementation observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What are real-world examples of the Observer pattern?",
    "BackEN": "• Smalltalk Model/View/Controller - Observer pattern defines dependencies between model and views\n• ET++ - ChangeManager mediates complex dependencies between subjects and observers\n• InterViews uses Observer pattern for maintaining consistency\n• Event handling systems (DOM events, button clicks)\n• MVC frameworks\n• Reactive programming (RxJS, React state management)\n• Pub/Sub systems",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Observer?",
    "BackES": "• Smalltalk Model/View/Controller (MVC) - usa Observer\n• Framework de aplicaciones ET++ - incluye clases para observer\n• Vistas de hojas de cálculo - se actualizan cuando cambian los datos\n• Suscripciones de redes sociales y feeds\n• Sistemas de notificación de eventos\n• Arquitectura reactiva de UI",
    "Tags": "real-world observer behavioral",
    "Category": "Behavioral",
    "Page": "293"
  },
  {
    "FrontEN": "What is the intent of the State pattern?",
    "BackEN": "Allow an object to alter its behavior when its internal state changes. The object will appear to change its class.",
    "FrontES": "¿Cuál es el propósito del patrón State?",
    "BackES": "Permitir que un objeto altere su comportamiento cuando su estado interno cambia. El objeto parecerá cambiar su clase.",
    "Tags": "intent state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "When would you use the State pattern?",
    "BackEN": "• An object's behavior depends on its state, and it must change its behavior at run-time depending on that state\n• Operations have large, multipart conditional statements that depend on the object's state",
    "FrontES": "¿Cuándo usarías el patrón State?",
    "BackES": "• El comportamiento de un objeto depende de su estado, y debe cambiar su comportamiento en tiempo de ejecución dependiendo de ese estado\n• Las operaciones tienen declaraciones condicionales grandes de múltiples ramas que dependen del estado del objeto. Este estado usualmente se representa por una o más constantes enumeradas",
    "Tags": "use-case state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What are the key participants in the State pattern?",
    "BackEN": "• Context: Defines the interface of interest to clients; maintains an instance of a ConcreteState subclass that defines the current state\n• State: Defines an interface for encapsulating the behavior associated with a particular state of the Context\n• ConcreteState subclasses: Each subclass implements a behavior associated with a state of the Context",
    "FrontES": "¿Cuáles son los participantes clave en el patrón State?",
    "BackES": "• Context: Define la interfaz de interés para los clientes; mantiene una instancia de una subclase ConcreteState que define el estado actual\n• State: Define una interfaz para encapsular el comportamiento asociado con un estado particular del Context\n• ConcreteState subclasses: Cada subclase implementa un comportamiento asociado con un estado del Context",
    "Tags": "key-concepts state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the State pattern?",
    "BackEN": "Benefits:\n• It localizes state-specific behavior and partitions behavior for different states\n• It makes state transitions explicit - separate objects for different states makes transitions more explicit\n• State objects can be shared - if State objects have no instance variables, contexts can share them\n\nDrawbacks:\n• Increases the number of classes - may be less compact than a single class but distributes responsibility",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón State?",
    "BackES": "Beneficios:\n• Localiza el comportamiento específico del estado y particiona el comportamiento para diferentes estados\n• Hace que las transiciones de estado sean explícitas\n• Los objetos State pueden compartirse si no tienen variables de instancia\n\nDesventajas:\n• Aumenta el número de clases - cada estado requiere al menos una clase\n• Puede hacer que el diseño sea menos compacto que un único enfoque monolítico",
    "Tags": "benefits-drawbacks state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What patterns are related to the State pattern?",
    "BackEN": "• Flyweight: Explains when and how State objects can be shared\n• Singleton: State objects are often Singletons",
    "FrontES": "¿Qué patrones están relacionados con el patrón State?",
    "BackES": "• Flyweight: Explica cuándo y cómo pueden compartirse objetos State\n• Singleton: Los objetos State a menudo son Singletons",
    "Tags": "related-patterns state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What are key implementation considerations for the State pattern?",
    "BackEN": "• Who defines the state transitions - can be defined in Context or in State subclasses (more flexible but introduces dependencies)\n• A table-based alternative - use tables to map inputs to state transitions (less explicit, harder to add actions)\n• Creating and destroying State objects - create in advance vs on demand\n• Using dynamic inheritance - changing behavior by changing object's class at runtime (not supported in most OO languages)",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón State?",
    "BackES": "• Quién define las transiciones de estado - puede hacerse en la clase Context o en las subclases State individuales\n• Un enfoque basado en tabla - puede proporcionar una manera concisa de mapear entradas a transiciones de estado pero es menos explícito\n• Crear y destruir objetos State - es mejor cuando los cambios de estado son dinámicos y no se conocen a priori; caso contrario, créalos solo una vez",
    "Tags": "implementation state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What are real-world examples of the State pattern?",
    "BackEN": "• HotDraw drawing editor framework - uses State pattern for tools\n• IBM's distributed systems use State pattern for connection management\n• TCP connection states (Established, Listening, Closed)\n• Workflow engines\n• Vending machines",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón State?",
    "BackES": "• El sistema de dibujo de Unidraw usa State para alternar entre diferentes herramientas\n• Conexiones de red TCP - diferentes comportamientos en estados establecido, escuchando, cerrado\n• Máquinas expendedoras - comportamiento diferente basado en estado actual\n• Flujos de autenticación de usuarios\n• Estados de reproducción de medios (reproduciendo, pausado, detenido)",
    "Tags": "real-world state behavioral",
    "Category": "Behavioral",
    "Page": "305"
  },
  {
    "FrontEN": "What is the intent of the Strategy pattern?",
    "BackEN": "Define a family of algorithms, encapsulate each one, and make them interchangeable. Strategy lets the algorithm vary independently from clients that use it.",
    "FrontES": "¿Cuál es el propósito del patrón Strategy?",
    "BackES": "Definir una familia de algoritmos, encapsular cada uno, y hacerlos intercambiables. Strategy permite que el algoritmo varíe independientemente de los clientes que lo usan.",
    "Tags": "intent strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "When would you use the Strategy pattern?",
    "BackEN": "• Many related classes differ only in their behavior - Strategies provide a way to configure a class with one of many behaviors\n• You need different variants of an algorithm\n• An algorithm uses data that clients shouldn't know about\n• A class defines many behaviors that appear as multiple conditional statements",
    "FrontES": "¿Cuándo usarías el patrón Strategy?",
    "BackES": "• Muchas clases relacionadas difieren solo en su comportamiento. Las estrategias proporcionan una forma de configurar una clase con uno de muchos comportamientos\n• Necesitas diferentes variantes de un algoritmo\n• Un algoritmo usa datos que los clientes no deberían conocer. Usa el patrón Strategy para evitar exponer estructuras de datos complejas, específicas del algoritmo\n• Una clase define muchos comportamientos, y estos aparecen como múltiples declaraciones condicionales en sus operaciones",
    "Tags": "use-case strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "What are the key participants in the Strategy pattern?",
    "BackEN": "• Strategy: Declares an interface common to all supported algorithms\n• ConcreteStrategy: Implements the algorithm using the Strategy interface\n• Context: Is configured with a ConcreteStrategy object; maintains a reference to a Strategy object; may define an interface that lets Strategy access its data",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Strategy?",
    "BackES": "• Strategy: Declara una interfaz común a todos los algoritmos soportados. Context usa esta interfaz para llamar al algoritmo definido por una ConcreteStrategy\n• ConcreteStrategy: Implementa el algoritmo usando la interfaz Strategy\n• Context: Se configura con un objeto ConcreteStrategy; mantiene una referencia a un objeto Strategy; puede definir una interfaz que permita a Strategy acceder a sus datos",
    "Tags": "key-concepts strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Strategy pattern?",
    "BackEN": "Benefits:\n• Families of related algorithms - hierarchies of Strategy classes define a family of algorithms for contexts to reuse\n• An alternative to subclassing - encapsulating the algorithm in separate Strategy classes lets you vary the algorithm independently\n• Strategies eliminate conditional statements - when different behaviors are lumped into one class, it's hard to avoid conditionals\n• A choice of implementations - Strategies can provide different implementations of the same behavior\n\nDrawbacks:\n• Clients must be aware of different Strategies - clients must understand how Strategies differ\n• Communication overhead between Strategy and Context - some ConcreteStrategies won't use all information passed to them\n• Increased number of objects - Strategies increase the number of objects in an application (can reduce with Flyweight)",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Strategy?",
    "BackES": "Beneficios:\n• Familias de algoritmos relacionados - las jerarquías de clases Strategy definen una familia de algoritmos o comportamientos para que los contexts reutilicen\n• Una alternativa a la creación de subclases - la herencia puede mezclar el algoritmo con el context, haciendo más difícil entender, mantener y extender el context\n• Las estrategias eliminan declaraciones condicionales\n• Una elección de implementaciones - las estrategias pueden proporcionar diferentes implementaciones del mismo comportamiento\n\nDesventajas:\n• Los clientes deben conocer diferentes estrategias\n• Sobrecarga de comunicación entre Strategy y Context\n• Aumento del número de objetos",
    "Tags": "benefits-drawbacks strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "What patterns are related to the Strategy pattern?",
    "BackEN": "• Flyweight: Strategy objects often make good flyweights",
    "FrontES": "¿Qué patrones están relacionados con el patrón Strategy?",
    "BackES": "• Flyweight: Los objetos Strategy a menudo hacen buenos flyweights",
    "Tags": "related-patterns strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "What are key implementation considerations for the Strategy pattern?",
    "BackEN": "• Defining Strategy and Context interfaces - Strategy and Context interfaces must give ConcreteStrategy efficient access to data, and vice versa\n• Strategies as template parameters - in C++ templates can configure a class with a strategy at compile time\n• Making Strategy objects optional - Context checks for null Strategy and provides default behavior",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Strategy?",
    "BackES": "• Definir las interfaces Strategy y Context - Strategy y Context deben dar a ConcreteStrategy acceso eficiente a los datos, y viceversa\n• Estrategias como parámetros de plantilla - en C++ las plantillas pueden configurar una clase con una estrategia en tiempo de compilación\n• Hacer que los objetos Strategy sean opcionales - Context verifica si hay una Strategy nula y proporciona comportamiento predeterminado",
    "Tags": "implementation strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "What are real-world examples of the Strategy pattern?",
    "BackEN": "• ET++ SwapsManager uses different storage strategies for text buffers\n• RTL Smalltalk compiler framework uses Strategy pattern for different code generation strategies\n• Sorting algorithms (QuickSort, MergeSort, BubbleSort)\n• Compression algorithms\n• Payment processing strategies",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Strategy?",
    "BackES": "• SwapsManager de ET++ usa diferentes estrategias de almacenamiento para búferes de texto\n• El framework de compilador RTL Smalltalk usa el patrón Strategy para diferentes estrategias de generación de código\n• Algoritmos de ordenamiento (QuickSort, MergeSort, BubbleSort)\n• Algoritmos de compresión\n• Estrategias de procesamiento de pagos",
    "Tags": "real-world strategy behavioral",
    "Category": "Behavioral",
    "Page": "315"
  },
  {
    "FrontEN": "Compare Strategy pattern vs State pattern",
    "BackEN": "Similarities:\n• Both use composition and delegation\n• Both have similar structure with context and strategy/state objects\n\nDifferences:\n• Intent: Strategy encapsulates interchangeable algorithms, State encapsulates state-specific behavior\n• Control: Strategy clients choose the strategy, State changes automatically based on internal state\n• Awareness: Strategy context is configured with a strategy, State context doesn't know about state transitions\n\nWhen to use each:\n• Strategy: When you need to select algorithm at runtime based on client choice\n• State: When object behavior changes based on internal state transitions",
    "FrontES": "Compara el patrón Strategy vs el patrón State",
    "BackES": "Similitudes:\n• Ambos usan composición y delegación\n• Ambos tienen estructura similar con objetos de contexto y estrategia/estado\n\nDiferencias:\n• Intención: Strategy encapsula algoritmos intercambiables, State encapsula comportamiento específico del estado\n• Control: Los clientes de Strategy eligen la estrategia, State cambia automáticamente según el estado interno\n• Consciencia: El contexto de Strategy se configura con una estrategia, el contexto de State no conoce las transiciones de estado\n\nCuándo usar cada uno:\n• Strategy: Cuando necesitas seleccionar el algoritmo en tiempo de ejecución según la elección del cliente\n• State: Cuando el comportamiento del objeto cambia según transiciones de estado internas",
    "Tags": "comparison strategy state",
    "Category": "Comparison",
    "Page": "315"
  },
  {
    "FrontEN": "Compare Mediator pattern vs Facade pattern",
    "BackEN": "Similarities:\n• Both provide a centralized interface to a subsystem\n• Both simplify complex interactions\n\nDifferences:\n• Communication: Mediator enables bidirectional communication between colleagues, Facade provides unidirectional interface to subsystem\n• Awareness: Mediator colleagues know about the mediator, Facade clients don't necessarily know about subsystem components\n• Purpose: Mediator decouples colleagues from each other, Facade simplifies a complex interface\n\nWhen to use each:\n• Mediator: When objects communicate in complex ways and you want to decouple them\n• Facade: When you want to provide a simple interface to a complex subsystem",
    "FrontES": "Compara el patrón Mediator vs el patrón Facade",
    "BackES": "Similitudes:\n• Ambos proporcionan una interfaz centralizada a un subsistema\n• Ambos simplifican interacciones complejas\n\nDiferencias:\n• Comunicación: Mediator habilita comunicación bidireccional entre colegas, Facade proporciona interfaz unidireccional al subsistema\n• Consciencia: Los colegas de Mediator conocen al mediador, los clientes de Facade no necesariamente conocen los componentes del subsistema\n• Propósito: Mediator desacopla colegas entre sí, Facade simplifica una interfaz compleja\n\nCuándo usar cada uno:\n• Mediator: Cuando los objetos se comunican de formas complejas y quieres desacoplarlos\n• Facade: Cuando quieres proporcionar una interfaz simple a un subsistema complejo",
    "Tags": "comparison mediator facade",
    "Category": "Comparison",
    "Page": "273"
  },
  {
    "FrontEN": "Compare Observer pattern vs Mediator pattern",
    "BackEN": "Similarities:\n• Both deal with object communication and coordination\n• Both promote loose coupling\n\nDifferences:\n• Structure: Observer has one-to-many relationship (Subject to Observers), Mediator has hub-and-spoke (Mediator coordinates Colleagues)\n• Purpose: Observer focuses on notification of state changes, Mediator focuses on coordinating complex interactions\n• Awareness: Observer subjects don't know observer types, Mediator knows all colleagues\n\nWhen to use each:\n• Observer: When you need automatic notification of state changes to multiple dependents\n• Mediator: When you have complex interactions between multiple objects that need coordination",
    "FrontES": "Compara el patrón Observer vs el patrón Mediator",
    "BackES": "Similitudes:\n• Ambos tratan con comunicación y coordinación de objetos\n• Ambos promueven acoplamiento débil\n\nDiferencias:\n• Estructura: Observer tiene relación uno-a-muchos (Subject a Observers), Mediator tiene modelo hub-and-spoke (Mediator coordina Colleagues)\n• Propósito: Observer se enfoca en notificación de cambios de estado, Mediator se enfoca en coordinar interacciones complejas\n• Consciencia: Los subjects de Observer no conocen los tipos de observer, Mediator conoce a todos los colegas\n\nCuándo usar cada uno:\n• Observer: Cuando necesitas notificación automática de cambios de estado a múltiples dependientes\n• Mediator: Cuando tienes interacciones complejas entre múltiples objetos que necesitan coordinación",
    "Tags": "comparison observer mediator",
    "Category": "Comparison",
    "Page": "293"
  },
  {
    "FrontEN": "Compare Command pattern vs Strategy pattern",
    "BackEN": "Similarities:\n• Both encapsulate behavior in objects\n• Both use composition over inheritance\n\nDifferences:\n• Intent: Command encapsulates requests as objects, Strategy encapsulates algorithms\n• Timing: Command may be queued and executed later, Strategy is typically executed immediately\n• State: Command may store state for undo/redo, Strategy is typically stateless\n• Receiver: Command has a receiver that performs the action, Strategy implements the algorithm itself\n\nWhen to use each:\n• Command: When you need to parameterize objects with operations, support undo, or queue requests\n• Strategy: When you need to select from a family of algorithms at runtime",
    "FrontES": "Compara el patrón Command vs el patrón Strategy",
    "BackES": "Similitudes:\n• Ambos encapsulan comportamiento en objetos\n• Ambos usan composición sobre herencia\n\nDiferencias:\n• Intención: Command encapsula solicitudes como objetos, Strategy encapsula algoritmos\n• Tiempo: Command puede ponerse en cola y ejecutarse más tarde, Strategy típicamente se ejecuta inmediatamente\n• Estado: Command puede almacenar estado para deshacer/rehacer, Strategy típicamente no tiene estado\n• Receptor: Command tiene un receptor que realiza la acción, Strategy implementa el algoritmo en sí mismo\n\nCuándo usar cada uno:\n• Command: Cuando necesitas parametrizar objetos con operaciones, soportar deshacer, o poner solicitudes en cola\n• Strategy: Cuando necesitas seleccionar de una familia de algoritmos en tiempo de ejecución",
    "Tags": "comparison command strategy",
    "Category": "Comparison",
    "Page": "233"
  },
  {
    "FrontEN": "Which patterns use the concept of Encapsulation of Variability?",
    "BackEN": "This principle involves wrapping algorithms, requests, or state-specific behavior in separate objects, allowing them to vary independently from clients.\n\nPatterns: Chain of Responsibility (encapsulates handler selection), Command (encapsulates requests), Strategy (encapsulates algorithms), State (encapsulates state-specific behavior), Interpreter (encapsulates grammar rules)",
    "FrontES": "¿Qué patrones usan el concepto de Encapsulación de Variabilidad?",
    "BackES": "Este principio implica envolver algoritmos, solicitudes o comportamiento específico del estado en objetos separados, permitiéndoles variar independientemente de los clientes.\n\nPatrones: Chain of Responsibility (encapsula selección de manejador), Command (encapsula solicitudes), Strategy (encapsula algoritmos), State (encapsula comportamiento específico del estado), Interpreter (encapsula reglas gramaticales)",
    "Tags": "cross-cutting encapsulation-of-variability",
    "Category": "Cross-Cutting",
    "Page": "223"
  },
  {
    "FrontEN": "Which patterns use the concept of Decoupling Senders and Receivers?",
    "BackEN": "These patterns reduce dependencies between communicating objects by introducing intermediaries or indirection.\n\nPatterns: Chain of Responsibility (sender doesn't know which handler processes request), Command (invoker doesn't know receiver), Mediator (colleagues don't know each other), Observer (subject doesn't know concrete observers)",
    "FrontES": "¿Qué patrones usan el concepto de Desacoplamiento de Emisores y Receptores?",
    "BackES": "Estos patrones reducen dependencias entre objetos que se comunican introduciendo intermediarios o indirección.\n\nPatrones: Chain of Responsibility (el emisor no sabe qué manejador procesa la solicitud), Command (el invocador no conoce al receptor), Mediator (los colegas no se conocen entre sí), Observer (el subject no conoce los observers concretos)",
    "Tags": "cross-cutting decoupling",
    "Category": "Cross-Cutting",
    "Page": "223"
  },
  {
    "FrontEN": "Which patterns use the concept of Delegation and Composition?",
    "BackEN": "These patterns favor composition and delegation over inheritance, with objects delegating responsibilities to helper objects rather than inheriting behavior.\n\nPatterns: Strategy (delegates algorithm to strategy object), State (delegates state-specific behavior to state object), Chain of Responsibility (delegates to successor), Command (delegates to receiver), Mediator (delegates coordination to mediator)",
    "FrontES": "¿Qué patrones usan el concepto de Delegación y Composición?",
    "BackES": "Estos patrones favorecen la composición y delegación sobre la herencia, con objetos delegando responsabilidades a objetos auxiliares en lugar de heredar comportamiento.\n\nPatrones: Strategy (delega algoritmo a objeto strategy), State (delega comportamiento específico del estado a objeto state), Chain of Responsibility (delega al sucesor), Command (delega al receptor), Mediator (delega coordinación al mediator)",
    "Tags": "cross-cutting delegation-composition",
    "Category": "Cross-Cutting",
    "Page": "223"
  },
  {
    "FrontEN": "Which patterns use the concept of Single Responsibility Principle?",
    "BackEN": "These patterns extract specific responsibilities into separate objects, keeping classes focused on a single concern.\n\nPatterns: Iterator (extracts traversal responsibility), Memento (extracts state capture responsibility), Strategy (extracts algorithm implementation), Command (extracts request execution)",
    "FrontES": "¿Qué patrones usan el concepto de Principio de Responsabilidad Única?",
    "BackES": "Estos patrones extraen responsabilidades específicas en objetos separados, manteniendo las clases enfocadas en una sola preocupación.\n\nPatrones: Iterator (extrae responsabilidad de recorrido), Memento (extrae responsabilidad de captura de estado), Strategy (extrae implementación de algoritmo), Command (extrae ejecución de solicitud)",
    "Tags": "cross-cutting single-responsibility",
    "Category": "Cross-Cutting",
    "Page": "257"
  },
  {
    "FrontEN": "Which patterns use the concept of Runtime Flexibility?",
    "BackEN": "These patterns support changing behavior at runtime by swapping objects or reconfiguring relationships.\n\nPatterns: Strategy (swap algorithms at runtime), State (change behavior based on state), Command (change commands at runtime), Chain of Responsibility (reconfigure chain dynamically)",
    "FrontES": "¿Qué patrones usan el concepto de Flexibilidad en Tiempo de Ejecución?",
    "BackES": "Estos patrones soportan cambiar el comportamiento en tiempo de ejecución intercambiando objetos o reconfigurando relaciones.\n\nPatrones: Strategy (intercambia algoritmos en tiempo de ejecución), State (cambia comportamiento según el estado), Command (cambia comandos en tiempo de ejecución), Chain of Responsibility (reconfigura cadena dinámicamente)",
    "Tags": "cross-cutting runtime-flexibility",
    "Category": "Cross-Cutting",
    "Page": "315"
  },
  {
    "FrontEN": "Which patterns use the concept of Communication Protocols?",
    "BackEN": "These patterns establish protocols for how objects communicate, either through broadcast notifications, centralized coordination, or chain propagation.\n\nPatterns: Observer (broadcast notifications to multiple observers), Mediator (centralized coordination of colleagues), Chain of Responsibility (propagation along chain until handled)",
    "FrontES": "¿Qué patrones usan el concepto de Protocolos de Comunicación?",
    "BackES": "Estos patrones establecen protocolos para cómo se comunican los objetos, ya sea a través de notificaciones de difusión, coordinación centralizada o propagación en cadena.\n\nPatrones: Observer (notificaciones de difusión a múltiples observers), Mediator (coordinación centralizada de colegas), Chain of Responsibility (propagación a lo largo de la cadena hasta ser manejada)",
    "Tags": "cross-cutting communication-protocols",
    "Category": "Cross-Cutting",
    "Page": "293"
  },
  {
    "FrontEN": "Which patterns use the concept of Preserving Encapsulation?",
    "BackEN": "These patterns maintain object encapsulation while enabling specific operations that might otherwise violate it.\n\nPatterns: Memento (preserves encapsulation while allowing state capture), Iterator (allows traversal without exposing internal structure), Mediator (hides colleague relationships)",
    "FrontES": "¿Qué patrones usan el concepto de Preservación de Encapsulación?",
    "BackES": "Estos patrones mantienen la encapsulación de objetos mientras habilitan operaciones específicas que de otro modo podrían violarla.\n\nPatrones: Memento (preserva encapsulación mientras permite captura de estado), Iterator (permite recorrido sin exponer estructura interna), Mediator (oculta relaciones entre colegas)",
    "Tags": "cross-cutting preserving-encapsulation",
    "Category": "Cross-Cutting",
    "Page": "283"
  }
]