[
  {
    "FrontEN": "What is the intent of Policy-Based Design?",
    "BackEN": "A design technique that decomposes complex class functionality into independent, orthogonal policies that can be mixed and matched to create customizable behavior at compile time",
    "FrontES": "¿Cuál es el propósito del Diseño Basado en Políticas?",
    "BackES": "Una técnica de diseño que descompone funcionalidad compleja de clases en políticas independientes y ortogonales que pueden mezclarse y combinarse para crear comportamiento personalizable en tiempo de compilación",
    "Tags": "intent policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "When would you use Policy-Based Design?",
    "BackEN": "• When a class can be decomposed into orthogonal design decisions\n• When you need compile-time flexibility without runtime overhead\n• When multiple valid implementations exist for specific aspects of a class\n• When you want to avoid the do-it-all interface problem",
    "FrontES": "¿Cuándo usarías el Diseño Basado en Políticas?",
    "BackES": "• Cuando una clase puede descomponerse en decisiones de diseño ortogonales\n• Cuando necesitas flexibilidad en tiempo de compilación sin sobrecarga en tiempo de ejecución\n• Cuando existen múltiples implementaciones válidas para aspectos específicos de una clase\n• Cuando quieres evitar el problema de la interfaz que hace todo",
    "Tags": "use-case policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "What are the key participants in Policy-Based Design?",
    "BackEN": "• Host Class: A class template that inherits from or contains policy classes and assembles their behaviors into a coherent whole\n• Policy Class: A class or class template that implements a specific aspect of functionality according to a policy interface\n• Policy Interface: A loosely-defined, syntax-oriented interface that policy classes must conform to",
    "FrontES": "¿Cuáles son los participantes clave en el Diseño Basado en Políticas?",
    "BackES": "• Clase Anfitriona: Una plantilla de clase que hereda de o contiene clases de política y ensambla sus comportamientos en un todo coherente\n• Clase de Política: Una clase o plantilla de clase que implementa un aspecto específico de funcionalidad según una interfaz de política\n• Interfaz de Política: Una interfaz definida de forma flexible, orientada a sintaxis, a la que las clases de política deben ajustarse",
    "Tags": "key-concepts policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of Policy-Based Design?",
    "BackEN": "Benefits:\n• Enables combinatorial reuse - mix and match policies for exponential behavior variations\n• Compile-time binding provides zero runtime overhead\n• Type-safe configuration of behavior\n• Graceful degradation through optional policy features\n• Avoids virtual function overhead\n\nDrawbacks:\n• Can lead to template parameter proliferation\n• Steep learning curve for library users\n• Longer compilation times\n• Complex error messages\n• Non-orthogonal policies can complicate design",
    "FrontES": "¿Cuáles son los beneficios y desventajas del Diseño Basado en Políticas?",
    "BackES": "Beneficios:\n• Permite reutilización combinatoria - mezcla y combina políticas para variaciones exponenciales de comportamiento\n• El enlace en tiempo de compilación proporciona cero sobrecarga en tiempo de ejecución\n• Configuración type-safe del comportamiento\n• Degradación elegante mediante características opcionales de política\n• Evita la sobrecarga de funciones virtuales\n\nDesventajas:\n• Puede llevar a proliferación de parámetros de plantilla\n• Curva de aprendizaje pronunciada para usuarios de biblioteca\n• Tiempos de compilación más largos\n• Mensajes de error complejos\n• Las políticas no ortogonales pueden complicar el diseño",
    "Tags": "benefits-drawbacks policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "What patterns are related to Policy-Based Design?",
    "BackEN": "• Strategy: Policy-based design is like compile-time Strategy pattern - both delegate behavior to separate classes, but policies use static binding\n• Template Method: Both provide customization points, but policies offer more flexibility through composition rather than inheritance",
    "FrontES": "¿Qué patrones están relacionados con el Diseño Basado en Políticas?",
    "BackES": "• Strategy: El diseño basado en políticas es como el patrón Strategy en tiempo de compilación - ambos delegan comportamiento a clases separadas, pero las políticas usan enlace estático\n• Template Method: Ambos proporcionan puntos de personalización, pero las políticas ofrecen más flexibilidad a través de composición en lugar de herencia",
    "Tags": "related-patterns policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "What are key implementation considerations for Policy-Based Design?",
    "BackEN": "• Use template template parameters to pass policy classes\n• Define protected non-virtual destructors in policy classes to prevent deletion through policy pointers\n• Use incomplete instantiation to support optional policy features\n• Provide sensible default policy implementations\n• Ensure policies are orthogonal (independent) when possible",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el Diseño Basado en Políticas?",
    "BackES": "• Usa parámetros de plantilla de plantilla para pasar clases de política\n• Define destructores protected no virtuales en clases de política para prevenir eliminación a través de punteros de política\n• Usa instanciación incompleta para soportar características opcionales de política\n• Proporciona implementaciones de política predeterminadas sensatas\n• Asegura que las políticas sean ortogonales (independientes) cuando sea posible",
    "Tags": "implementation policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "What are real-world examples of Policy-Based Design?",
    "BackEN": "• Smart pointer classes with configurable ownership, threading, and checking policies\n• Container classes with configurable allocation and threading policies\n• Object factories with configurable creation strategies",
    "FrontES": "¿Cuáles son ejemplos del mundo real del Diseño Basado en Políticas?",
    "BackES": "• Clases de punteros inteligentes con políticas configurables de propiedad, hilos y verificación\n• Clases de contenedores con políticas configurables de asignación e hilos\n• Fábricas de objetos con estrategias de creación configurables",
    "Tags": "real-world policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "2"
  },
  {
    "FrontEN": "```cpp\ntemplate <class T>\nstruct OpNewCreator {\n  static T* Create() {\n    return new T;\n  }\n};\n\ntemplate <template <class> class CreationPolicy>\nclass WidgetManager : public CreationPolicy<Widget> {\n  // Uses CreationPolicy::Create() internally\n};\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Policy-Based Design\nKey elements: Demonstrates a simple Creator policy and host class using template template parameters. The WidgetManager host class inherits from the CreationPolicy to reuse its Create() functionality.",
    "FrontES": "```cpp\ntemplate <class T>\nstruct OpNewCreator {\n  static T* Create() {\n    return new T;\n  }\n};\n\ntemplate <template <class> class CreationPolicy>\nclass WidgetManager : public CreationPolicy<Widget> {\n  // Usa CreationPolicy::Create() internamente\n};\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Diseño Basado en Políticas\nElementos clave: Demuestra una política Creator simple y una clase anfitriona usando parámetros de plantilla de plantilla. La clase anfitriona WidgetManager hereda de CreationPolicy para reutilizar su funcionalidad Create().",
    "Tags": "code-example policy-based-design fundamentals cpp",
    "Category": "Fundamentals",
    "Page": "6"
  },
  {
    "FrontEN": "What is the intent of Compile-Time Assertions?",
    "BackEN": "Validate compile-time conditions and generate meaningful compiler errors when conditions fail, enabling static type checking of template parameters and compile-time constants",
    "FrontES": "¿Cuál es el propósito de las Aserciones en Tiempo de Compilación?",
    "BackES": "Validar condiciones en tiempo de compilación y generar errores de compilador significativos cuando las condiciones fallan, permitiendo verificación de tipos estática de parámetros de plantilla y constantes en tiempo de compilación",
    "Tags": "intent compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "When would you use Compile-Time Assertions?",
    "BackEN": "• When validating template parameter constraints\n• When checking relationships between types at compile time\n• When enforcing design constraints statically\n• When size or type assumptions must be verified",
    "FrontES": "¿Cuándo usarías Aserciones en Tiempo de Compilación?",
    "BackES": "• Al validar restricciones de parámetros de plantilla\n• Al verificar relaciones entre tipos en tiempo de compilación\n• Al aplicar restricciones de diseño estáticamente\n• Cuando los supuestos de tamaño o tipo deben verificarse",
    "Tags": "use-case compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "What are the key participants in Compile-Time Assertions?",
    "BackEN": "• CompileTimeChecker template: A class template specialized for true/false that generates compiler errors for false conditions\n• STATIC_CHECK macro: Macro that wraps the compile-time check mechanism and optionally provides custom error messages",
    "FrontES": "¿Cuáles son los participantes clave en las Aserciones en Tiempo de Compilación?",
    "BackES": "• Plantilla CompileTimeChecker: Una plantilla de clase especializada para verdadero/falso que genera errores de compilador para condiciones falsas\n• Macro STATIC_CHECK: Macro que envuelve el mecanismo de verificación en tiempo de compilación y opcionalmente proporciona mensajes de error personalizados",
    "Tags": "key-concepts compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of Compile-Time Assertions?",
    "BackEN": "Benefits:\n• Catches errors at compile time instead of runtime\n• Zero runtime overhead\n• Can provide meaningful error messages\n• Enforces design constraints statically\n\nDrawbacks:\n• Error messages limited by compiler implementation\n• Custom error messages must be valid C++ identifiers\n• Can add to compilation time",
    "FrontES": "¿Cuáles son los beneficios y desventajas de las Aserciones en Tiempo de Compilación?",
    "BackES": "Beneficios:\n• Detecta errores en tiempo de compilación en lugar de tiempo de ejecución\n• Cero sobrecarga en tiempo de ejecución\n• Puede proporcionar mensajes de error significativos\n• Aplica restricciones de diseño estáticamente\n\nDesventajas:\n• Mensajes de error limitados por la implementación del compilador\n• Los mensajes de error personalizados deben ser identificadores C++ válidos\n• Puede aumentar el tiempo de compilación",
    "Tags": "benefits-drawbacks compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "What are key implementation considerations for Compile-Time Assertions?",
    "BackEN": "• Use template specialization with defined true case and undefined false case\n• Use local classes with descriptive names to improve error messages\n• Apply sizeof to avoid code evaluation while getting type information\n• Combine with type traits for powerful compile-time type checking",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para las Aserciones en Tiempo de Compilación?",
    "BackES": "• Usa especialización de plantilla con caso verdadero definido y caso falso indefinido\n• Usa clases locales con nombres descriptivos para mejorar los mensajes de error\n• Aplica sizeof para evitar evaluación de código mientras se obtiene información de tipo\n• Combina con rasgos de tipo para verificación poderosa de tipos en tiempo de compilación",
    "Tags": "implementation compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "What are real-world examples of Compile-Time Assertions?",
    "BackEN": "• Validating that pointer types are large enough for safe_reinterpret_cast\n• Ensuring template parameters meet size requirements\n• Checking type relationships in generic code",
    "FrontES": "¿Cuáles son ejemplos del mundo real de Aserciones en Tiempo de Compilación?",
    "BackES": "• Validar que los tipos de puntero sean lo suficientemente grandes para safe_reinterpret_cast\n• Asegurar que los parámetros de plantilla cumplan con los requisitos de tamaño\n• Verificar relaciones de tipo en código genérico",
    "Tags": "real-world compile-time-assertions fundamentals",
    "Category": "Fundamentals",
    "Page": "19"
  },
  {
    "FrontEN": "```cpp\ntemplate<bool> struct CompileTimeChecker;\ntemplate<> struct CompileTimeChecker<true> {};\n\n#define STATIC_CHECK(expr, msg) \\\n  { class ERROR_##msg {}; \\\n    (void)sizeof(CompileTimeChecker<(expr) != 0>((ERROR_##msg()))); }\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Compile-Time Assertions\nKey elements: Complete compile-time assertion mechanism with custom error messages. Uses template specialization and local class naming to generate meaningful compiler errors when conditions fail.",
    "FrontES": "```cpp\ntemplate<bool> struct CompileTimeChecker;\ntemplate<> struct CompileTimeChecker<true> {};\n\n#define STATIC_CHECK(expr, msg) \\\n  { class ERROR_##msg {}; \\\n    (void)sizeof(CompileTimeChecker<(expr) != 0>((ERROR_##msg()))); }\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Aserciones en Tiempo de Compilación\nElementos clave: Mecanismo completo de aserción en tiempo de compilación con mensajes de error personalizados. Usa especialización de plantilla y nombrado de clase local para generar errores de compilador significativos cuando las condiciones fallan.",
    "Tags": "code-example compile-time-assertions fundamentals cpp",
    "Category": "Fundamentals",
    "Page": "20"
  },
  {
    "FrontEN": "Which patterns use the concept 'Template Metaprogramming'?",
    "BackEN": "Using C++ templates as a compile-time functional programming language to perform computations, type manipulations, and code generation at compilation time\n\nPatterns: Policy-Based Design, Compile-Time Assertions, Type Traits, Type Selection",
    "FrontES": "¿Qué patrones usan el concepto 'Metaprogramación de Plantillas'?",
    "BackES": "Usar plantillas de C++ como un lenguaje de programación funcional en tiempo de compilación para realizar cómputos, manipulaciones de tipo y generación de código en tiempo de compilación\n\nPatrones: Diseño Basado en Políticas, Aserciones en Tiempo de Compilación, Rasgos de Tipo, Selección de Tipo",
    "Tags": "cross-cutting template-metaprogramming",
    "Category": "Cross-Cutting",
    "Page": "1"
  },
  {
    "FrontEN": "Which patterns use the concept 'Partial Template Specialization'?",
    "BackEN": "Specializing class templates for patterns of template arguments rather than specific types, enabling compile-time dispatching and type manipulation\n\nPatterns: Policy-Based Design, Type Traits, Type Selection",
    "FrontES": "¿Qué patrones usan el concepto 'Especialización Parcial de Plantillas'?",
    "BackES": "Especializar plantillas de clase para patrones de argumentos de plantilla en lugar de tipos específicos, permitiendo despacho en tiempo de compilación y manipulación de tipos\n\nPatrones: Diseño Basado en Políticas, Rasgos de Tipo, Selección de Tipo",
    "Tags": "cross-cutting partial-template-specialization",
    "Category": "Cross-Cutting",
    "Page": "22"
  },
  {
    "FrontEN": "Which patterns use the concept 'Type-Based Dispatch'?",
    "BackEN": "Using type information to select different code paths at compile time through function overloading or template specialization\n\nPatterns: Policy-Based Design, Int2Type, Type2Type",
    "FrontES": "¿Qué patrones usan el concepto 'Despacho Basado en Tipo'?",
    "BackES": "Usar información de tipo para seleccionar diferentes rutas de código en tiempo de compilación a través de sobrecarga de funciones o especialización de plantillas\n\nPatrones: Diseño Basado en Políticas, Int2Type, Type2Type",
    "Tags": "cross-cutting type-based-dispatch",
    "Category": "Cross-Cutting",
    "Page": "24"
  },
  {
    "FrontEN": "Which patterns use the concept 'Zero Runtime Overhead'?",
    "BackEN": "Techniques that provide flexibility and safety at compile time without incurring any runtime performance penalty\n\nPatterns: Policy-Based Design, Compile-Time Assertions, Type Traits",
    "FrontES": "¿Qué patrones usan el concepto 'Cero Sobrecarga en Tiempo de Ejecución'?",
    "BackES": "Técnicas que proporcionan flexibilidad y seguridad en tiempo de compilación sin incurrir en ninguna penalización de rendimiento en tiempo de ejecución\n\nPatrones: Diseño Basado en Políticas, Aserciones en Tiempo de Compilación, Rasgos de Tipo",
    "Tags": "cross-cutting zero-runtime-overhead",
    "Category": "Cross-Cutting",
    "Page": "1"
  },
  {
    "FrontEN": "Compare Policy-Based Design vs Strategy Pattern",
    "BackEN": "Similarities:\n• Both delegate behavior to separate classes\n• Both provide flexibility in choosing implementations\n• Both enable customization of specific aspects of functionality\n\nDifferences:\n• Policy-Based Design uses compile-time binding (templates), Strategy uses runtime binding (virtual functions)\n• Policies have zero runtime overhead, Strategy incurs virtual function call overhead\n• Policy-Based Design allows combinatorial mixing of multiple policies, Strategy typically focuses on one varying algorithm\n\nWhen to use each:\n• Policy-Based Design: When you need compile-time configuration and zero runtime overhead\n• Strategy: When you need to change behavior at runtime or work with polymorphic types",
    "FrontES": "Compara Diseño Basado en Políticas vs Patrón Strategy",
    "BackES": "Similitudes:\n• Ambos delegan comportamiento a clases separadas\n• Ambos proporcionan flexibilidad al elegir implementaciones\n• Ambos permiten personalización de aspectos específicos de funcionalidad\n\nDiferencias:\n• El Diseño Basado en Políticas usa enlace en tiempo de compilación (plantillas), Strategy usa enlace en tiempo de ejecución (funciones virtuales)\n• Las políticas tienen cero sobrecarga en tiempo de ejecución, Strategy incurre en sobrecarga de llamada de función virtual\n• El Diseño Basado en Políticas permite mezcla combinatoria de múltiples políticas, Strategy típicamente se enfoca en un algoritmo variable\n\nCuándo usar cada uno:\n• Diseño Basado en Políticas: Cuando necesitas configuración en tiempo de compilación y cero sobrecarga en tiempo de ejecución\n• Strategy: Cuando necesitas cambiar comportamiento en tiempo de ejecución o trabajar con tipos polimórficos",
    "Tags": "comparison policy-based-design strategy-pattern",
    "Category": "Comparison",
    "Page": "2"
  },
  {
    "FrontEN": "In Policy-Based Design, what is the purpose of using template template parameters?",
    "BackEN": "Template template parameters allow policy classes to be passed as template arguments to the host class, enabling the host to instantiate the policy with different types as needed. This provides flexibility while maintaining type safety and enabling the compiler to optimize away all indirection.",
    "FrontES": "En el Diseño Basado en Políticas, ¿cuál es el propósito de usar parámetros de plantilla de plantilla?",
    "BackES": "Los parámetros de plantilla de plantilla permiten que las clases de política se pasen como argumentos de plantilla a la clase anfitriona, permitiendo que el anfitrión instancie la política con diferentes tipos según sea necesario. Esto proporciona flexibilidad mientras mantiene seguridad de tipo y permite que el compilador optimice toda indirección.",
    "Tags": "implementation policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "8"
  },
  {
    "FrontEN": "What does it mean for policies to be 'orthogonal' in Policy-Based Design?",
    "BackEN": "Orthogonal policies are completely independent of each other - they can be changed without affecting other policies. Non-orthogonal policies need to interact or know about each other, which complicates design and reduces flexibility. Orthogonal decomposition is a key goal in policy-based design.",
    "FrontES": "¿Qué significa que las políticas sean 'ortogonales' en el Diseño Basado en Políticas?",
    "BackES": "Las políticas ortogonales son completamente independientes entre sí - pueden cambiarse sin afectar otras políticas. Las políticas no ortogonales necesitan interactuar o conocerse entre sí, lo cual complica el diseño y reduce la flexibilidad. La descomposición ortogonal es un objetivo clave en el diseño basado en políticas.",
    "Tags": "key-concepts policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "17"
  },
  {
    "FrontEN": "In Policy-Based Design, why should policy class destructors be protected and non-virtual?",
    "BackEN": "Protected destructors prevent deletion through policy pointers (which would have undefined behavior). Non-virtual destructors avoid the size and performance overhead of a vtable. Since host classes publicly inherit from policies, this prevents dangerous polymorphic deletion while maintaining zero overhead.",
    "FrontES": "En el Diseño Basado en Políticas, ¿por qué los destructores de clases de política deben ser protected y no virtuales?",
    "BackES": "Los destructores protected previenen la eliminación a través de punteros de política (lo cual tendría comportamiento indefinido). Los destructores no virtuales evitan la sobrecarga de tamaño y rendimiento de una vtable. Dado que las clases anfitrionas heredan públicamente de las políticas, esto previene la eliminación polimórfica peligrosa mientras mantiene cero sobrecarga.",
    "Tags": "implementation policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "10"
  },
  {
    "FrontEN": "What is 'enriched policy' functionality in Policy-Based Design?",
    "BackEN": "Enriched policies provide additional public member functions beyond the minimal policy interface. These extra functions propagate through the host class via public inheritance, allowing users to access extended functionality when using richer policy implementations. The host class can optionally use these features through incomplete instantiation.",
    "FrontES": "¿Qué es la funcionalidad de 'política enriquecida' en el Diseño Basado en Políticas?",
    "BackES": "Las políticas enriquecidas proporcionan funciones miembro públicas adicionales más allá de la interfaz mínima de política. Estas funciones adicionales se propagan a través de la clase anfitriona mediante herencia pública, permitiendo a los usuarios acceder a funcionalidad extendida al usar implementaciones de política más ricas. La clase anfitriona puede opcionalmente usar estas características a través de instanciación incompleta.",
    "Tags": "key-concepts policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "9"
  },
  {
    "FrontEN": "How does incomplete instantiation support optional policy features in C++?",
    "BackEN": "C++ only instantiates template member functions that are actually used. This allows host classes to define member functions that use optional policy features - if the policy doesn't provide those features and the function isn't called, the code still compiles. If called with an incompatible policy, a compile-time error results.",
    "FrontES": "¿Cómo soporta la instanciación incompleta características opcionales de política en C++?",
    "BackES": "C++ solo instancia funciones miembro de plantilla que realmente se usan. Esto permite a las clases anfitrionas definir funciones miembro que usan características opcionales de política - si la política no proporciona esas características y la función no es llamada, el código aún compila. Si se llama con una política incompatible, resulta en un error en tiempo de compilación.",
    "Tags": "implementation policy-based-design fundamentals",
    "Category": "Fundamentals",
    "Page": "11"
  },

  {
    "FrontEN": "What is the intent of the Command Pattern (Generalized Functors)?",
    "BackEN": "Encapsulate a request in an object, allowing you to store processing requests as values, pass them as parameters, and invoke them apart from the point of their creation.",
    "FrontES": "¿Cuál es la intención del Patrón Command (Functores Generalizados)?",
    "BackES": "Encapsular una solicitud en un objeto, permitiéndote almacenar solicitudes de procesamiento como valores, pasarlas como parámetros e invocarlas aparte del punto de su creación.",
    "Tags": "intent command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "When would you use the Command Pattern (Generalized Functors)?",
    "BackEN": "• When you need to store a processing request and execute it later\n• When you need to decouple invokers from receivers\n• When implementing callback mechanisms in GUI frameworks\n• When you need forwarding commands that delegate work to receivers\n• When implementing undo/redo functionality or macro commands",
    "FrontES": "¿Cuándo usarías el Patrón Command (Functores Generalizados)?",
    "BackES": "• Cuando necesitas almacenar una solicitud de procesamiento y ejecutarla más tarde\n• Cuando necesitas desacoplar invocadores de receptores\n• Al implementar mecanismos de callback en frameworks de GUI\n• Cuando necesitas comandos de reenvío que delegan trabajo a receptores\n• Al implementar funcionalidad de deshacer/rehacer o comandos macro",
    "Tags": "use-case command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What are the key participants in the Command Pattern (Generalized Functors)?",
    "BackEN": "• Command (Functor): Declares an interface (operator()) for executing an operation\n• ConcreteCommand (FunctorHandler): Implements operator() by invoking operations on the Receiver\n• Client (Application): Creates ConcreteCommand objects and sets their receivers\n• Invoker: Asks the command to carry out the request by calling operator()\n• Receiver: Knows how to perform the operations associated with carrying out a request",
    "FrontES": "¿Cuáles son los participantes clave en el Patrón Command (Functores Generalizados)?",
    "BackES": "• Command (Functor): Declara una interfaz (operator()) para ejecutar una operación\n• ConcreteCommand (FunctorHandler): Implementa operator() invocando operaciones en el Receptor\n• Client (Application): Crea objetos ConcreteCommand y establece sus receptores\n• Invoker: Solicita al comando que ejecute la petición llamando a operator()\n• Receiver: Sabe cómo realizar las operaciones asociadas con la ejecución de una solicitud",
    "Tags": "key-concepts command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Command Pattern (Generalized Functors)?",
    "BackEN": "Benefits:\n• Decouples invoker from receiver\n• Enables time separation between request assembly and execution\n• Type-safe encapsulation of any processing invocation\n• Supports value semantics with copying and assignment\n• Can store state and invoke member functions\n• Allows chaining multiple delayed calls\n\nDrawbacks:\n• Can increase the number of classes in a design\n• May require repetitive code for each concrete command without generalization\n• Template-based implementation can increase compilation time",
    "FrontES": "¿Cuáles son los beneficios y desventajas del Patrón Command (Functores Generalizados)?",
    "BackES": "Beneficios:\n• Desacopla el invocador del receptor\n• Permite separación temporal entre el ensamblaje de la solicitud y la ejecución\n• Encapsulación segura de tipos de cualquier invocación de procesamiento\n• Soporta semántica de valores con copia y asignación\n• Puede almacenar estado e invocar funciones miembro\n• Permite encadenar múltiples llamadas diferidas\n\nDesventajas:\n• Puede aumentar el número de clases en un diseño\n• Puede requerir código repetitivo para cada comando concreto sin generalización\n• La implementación basada en plantillas puede aumentar el tiempo de compilación",
    "Tags": "benefits-drawbacks command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What are key implementation considerations for the Command Pattern (Generalized Functors)?",
    "BackEN": "• Use templates to parameterize return type and argument types\n• Leverage typelists to handle variable numbers of parameters\n• Implement handle-body idiom with polymorphic implementation (FunctorImpl)\n• Use partial template specialization for different parameter counts\n• Compiler only instantiates member functions when actually used\n• Store functors by value, function pointers by value\n• Use Clone() for polymorphic copying\n• Limit parameter count to reasonable number (e.g., 15) due to language limitations",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el Patrón Command (Functores Generalizados)?",
    "BackES": "• Usar plantillas para parametrizar el tipo de retorno y los tipos de argumentos\n• Aprovechar typelists para manejar números variables de parámetros\n• Implementar el idioma handle-body con implementación polimórfica (FunctorImpl)\n• Usar especialización parcial de plantillas para diferentes cantidades de parámetros\n• El compilador solo instancia funciones miembro cuando realmente se usan\n• Almacenar functores por valor, punteros a función por valor\n• Usar Clone() para copia polimórfica\n• Limitar el número de parámetros a un número razonable (ej. 15) debido a limitaciones del lenguaje",
    "Tags": "implementation command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What patterns are related to the Command Pattern (Generalized Functors)?",
    "BackEN": "• Composite: MacroCommand is a Composite of Commands\n• Memento: Can use Memento to store state for undo",
    "FrontES": "¿Qué patrones están relacionados con el Patrón Command (Functores Generalizados)?",
    "BackES": "• Composite: MacroCommand es un Composite de Commands\n• Memento: Puede usar Memento para almacenar estado para deshacer",
    "Tags": "related-patterns command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "```cpp\nFunctor<double, TYPELIST_2(int, double)> myFunctor;\nvoid TestFunction(int i, double d) { /*...*/ }\nFunctor<void, TYPELIST_2(int, double)> cmd(TestFunction);\ncmd(4, 4.5);\n\nstruct TestFunctor {\n  void operator()(int i, double d) { /*...*/ }\n};\nTestFunctor f;\nFunctor<void, TYPELIST_2(int, double)> cmd2(f);\ncmd2(4, 4.5);\n```",
    "BackEN": "Pattern: Command Pattern (Generalized Functors)\nKey elements: Shows how to create generalized functors that encapsulate function calls with delayed execution. Demonstrates forwarding to both free functions and functor objects.",
    "FrontES": "```cpp\nFunctor<double, TYPELIST_2(int, double)> myFunctor;\nvoid TestFunction(int i, double d) { /*...*/ }\nFunctor<void, TYPELIST_2(int, double)> cmd(TestFunction);\ncmd(4, 4.5);\n\nstruct TestFunctor {\n  void operator()(int i, double d) { /*...*/ }\n};\nTestFunctor f;\nFunctor<void, TYPELIST_2(int, double)> cmd2(f);\ncmd2(4, 4.5);\n```",
    "BackES": "Patrón: Patrón Command (Functores Generalizados)\nElementos clave: Muestra cómo crear functores generalizados que encapsulan llamadas a funciones con ejecución diferida. Demuestra el reenvío tanto a funciones libres como a objetos functor.",
    "Tags": "code-example command-pattern behavioral cpp",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What are real-world examples of the Command Pattern (Generalized Functors)?",
    "BackEN": "• GUI frameworks (button clicks, menu selections)\n• Event handling systems\n• Callback mechanisms in windowing systems\n• Undo/redo systems\n• Transaction systems",
    "FrontES": "¿Cuáles son ejemplos del mundo real del Patrón Command (Functores Generalizados)?",
    "BackES": "• Frameworks de GUI (clics de botones, selecciones de menú)\n• Sistemas de manejo de eventos\n• Mecanismos de callback en sistemas de ventanas\n• Sistemas de deshacer/rehacer\n• Sistemas de transacciones",
    "Tags": "real-world command-pattern behavioral",
    "Category": "Behavioral",
    "Page": "45"
  },
  {
    "FrontEN": "What is the intent of Typelists?",
    "BackEN": "Provide a compile-time tool for manipulating collections of types, enabling type-level programming and automatic code generation from type specifications.",
    "FrontES": "¿Cuál es la intención de las Typelists?",
    "BackES": "Proporcionar una herramienta de tiempo de compilación para manipular colecciones de tipos, permitiendo programación a nivel de tipos y generación automática de código a partir de especificaciones de tipos.",
    "Tags": "intent typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "When would you use Typelists?",
    "BackEN": "• When implementing Abstract Factory with arbitrary type collections\n• When you need to repeat code for multiple types but templates can't help directly\n• When generating class hierarchies from type specifications\n• When implementing compile-time algorithms on type collections\n• When avoiding code bloat from manual type repetition",
    "FrontES": "¿Cuándo usarías Typelists?",
    "BackES": "• Al implementar Abstract Factory con colecciones arbitrarias de tipos\n• Cuando necesitas repetir código para múltiples tipos pero las plantillas no pueden ayudar directamente\n• Al generar jerarquías de clases a partir de especificaciones de tipos\n• Al implementar algoritmos de tiempo de compilación en colecciones de tipos\n• Para evitar la proliferación de código por repetición manual de tipos",
    "Tags": "use-case typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "What are the key participants in Typelists?",
    "BackEN": "• Typelist<Head, Tail>: Basic recursive structure holding two types: Head (current type) and Tail (rest of list or NullType)\n• NullType: Termination marker for typelists, analogous to \\0 in C strings\n• TYPELIST_N macros: Linearize typelist creation (TYPELIST_1 through TYPELIST_50)",
    "FrontES": "¿Cuáles son los participantes clave en las Typelists?",
    "BackES": "• Typelist<Head, Tail>: Estructura recursiva básica que contiene dos tipos: Head (tipo actual) y Tail (resto de la lista o NullType)\n• NullType: Marcador de terminación para typelists, análogo a \\0 en cadenas C\n• Macros TYPELIST_N: Linealizan la creación de typelists (TYPELIST_1 hasta TYPELIST_50)",
    "Tags": "key-concepts typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of Typelists?",
    "BackEN": "Benefits:\n• Automates repetitive type-based code generation\n• All operations performed at compile time\n• Enables new programming idioms not otherwise possible\n• Type-safe manipulation of type collections\n• No runtime overhead\n\nDrawbacks:\n• Compile-time only, no runtime support\n• Cannot use iteration, must use recursion\n• Requires understanding of pure functional programming concepts\n• Can increase compilation time for complex manipulations\n• Error messages can be cryptic",
    "FrontES": "¿Cuáles son los beneficios y desventajas de las Typelists?",
    "BackES": "Beneficios:\n• Automatiza la generación repetitiva de código basado en tipos\n• Todas las operaciones se realizan en tiempo de compilación\n• Habilita nuevos idiomas de programación que de otro modo no serían posibles\n• Manipulación segura de tipos de colecciones de tipos\n• Sin sobrecarga en tiempo de ejecución\n\nDesventajas:\n• Solo tiempo de compilación, sin soporte en tiempo de ejecución\n• No se puede usar iteración, se debe usar recursión\n• Requiere comprensión de conceptos de programación funcional pura\n• Puede aumentar el tiempo de compilación para manipulaciones complejas\n• Los mensajes de error pueden ser crípticos",
    "Tags": "benefits-drawbacks typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "What are key implementation considerations for Typelists?",
    "BackEN": "• All typelist values are immutable (pure functional style)\n• Use partial template specialization for pattern matching\n• Convention: typelists end with NullType\n• Recursive templates stopped with explicit specialization\n• Algorithms return results in nested Result typedef\n• Linear time operations during compilation are acceptable\n• Use enum for compile-time integer constants",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para las Typelists?",
    "BackES": "• Todos los valores de typelist son inmutables (estilo funcional puro)\n• Usar especialización parcial de plantillas para coincidencia de patrones\n• Convención: las typelists terminan con NullType\n• Las plantillas recursivas se detienen con especialización explícita\n• Los algoritmos devuelven resultados en typedef anidado Result\n• Las operaciones de tiempo lineal durante la compilación son aceptables\n• Usar enum para constantes enteras de tiempo de compilación",
    "Tags": "implementation typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "What are real-world examples of Typelists?",
    "BackEN": "• Generic Abstract Factory implementation\n• Tuple implementations\n• Type-safe variadic template emulation (pre-C++11)\n• Automatic class hierarchy generation",
    "FrontES": "```cpp\ntypedef Typelist<char, Typelist<signed char,\n  Typelist<unsigned char, NullType> > > CharList;\n\ntypedef TYPELIST_3(char, signed char, unsigned char) CharList;\n\ntemplate <class TList> struct Length;\ntemplate <> struct Length<NullType> {\n  enum { value = 0 };\n};\ntemplate <class T, class U>\nstruct Length< Typelist<T, U> > {\n  enum { value = 1 + Length<U>::value };\n};\n```",
    "BackES": "Patrón: Typelists\nElementos clave: Muestra la estructura recursiva básica, los macros de linearización y un ejemplo de algoritmo de tiempo de compilación. Demuestra cómo se usa la recursión de plantillas para operaciones de listas.",
    "Tags": "real-world typelists structural",
    "Category": "Structural",
    "Page": "2"
  },
  {
    "FrontEN": "What is the intent of the Small-Object Allocator?",
    "BackEN": "Provide fast, memory-efficient allocation for small objects by using specialized allocation strategies that overcome the inefficiencies of the default free store allocator.",
    "FrontES": "¿Cuál es la intención del Asignador de Objetos Pequeños (Small-Object Allocator)?",
    "BackES": "Proporcionar asignación rápida y eficiente en memoria para objetos pequeños mediante el uso de estrategias de asignación especializadas que superan las ineficiencias del asignador de almacenamiento libre predeterminado.",
    "Tags": "intent small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "When would you use the Small-Object Allocator?",
    "BackEN": "• When allocating many small objects (< 64 bytes typically)\n• When using design patterns that create many small dynamic objects\n• When implementing smart pointers or functors\n• When runtime polymorphism requires heap allocation of small objects\n• When the pimpl idiom is used extensively",
    "FrontES": "¿Cuándo usarías el Asignador de Objetos Pequeños?",
    "BackES": "• Al asignar muchos objetos pequeños (< 64 bytes típicamente)\n• Al usar patrones de diseño que crean muchos objetos dinámicos pequeños\n• Al implementar punteros inteligentes o functores\n• Cuando el polimorfismo en tiempo de ejecución requiere asignación en heap de objetos pequeños\n• Cuando se usa extensivamente el idioma pimpl",
    "Tags": "use-case small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "What are the key participants in the Small-Object Allocator?",
    "BackEN": "• Chunk: Manages fixed-size memory chunk divided into equal blocks, uses embedded singly-linked list of free blocks\n• FixedAllocator: Manages vector of Chunks for one specific block size, handles allocation beyond single chunk capacity\n• SmallObjAllocator: Holds multiple FixedAllocators for different sizes, dispatches to appropriate allocator or default ::operator new\n• SmallObject: Base class that overloads operator new/delete, provides transparent interface for derived classes",
    "FrontES": "¿Cuáles son los participantes clave en el Asignador de Objetos Pequeños?",
    "BackES": "• Chunk: Gestiona un fragmento de memoria de tamaño fijo dividido en bloques iguales, usa lista enlazada simple incrustada de bloques libres\n• FixedAllocator: Gestiona vector de Chunks para un tamaño de bloque específico, maneja asignación más allá de la capacidad de un solo chunk\n• SmallObjAllocator: Contiene múltiples FixedAllocators para diferentes tamaños, despacha al asignador apropiado o al ::operator new predeterminado\n• SmallObject: Clase base que sobrecarga operator new/delete, proporciona interfaz transparente para clases derivadas",
    "Tags": "key-concepts small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Small-Object Allocator?",
    "BackEN": "Benefits:\n• Much faster allocation/deallocation than default allocator\n• Minimal per-object memory overhead (no bookkeeping per object)\n• Constant-time allocation and deallocation (typically)\n• Transparent use through inheritance from SmallObject\n• Optimized for typical allocation patterns (bulk, ordered, reversed, butterfly)\n\nDrawbacks:\n• Limited to objects under maximum size (default 64 bytes)\n• Can waste memory if allocation pattern doesn't match design\n• Chunk limit of 255 blocks due to unsigned char indexing\n• Not optimal for all memory allocation patterns\n• Requires configuring chunk size and max object size",
    "FrontES": "¿Cuáles son los beneficios y desventajas del Asignador de Objetos Pequeños?",
    "BackES": "Beneficios:\n• Asignación/desasignación mucho más rápida que el asignador predeterminado\n• Sobrecarga mínima de memoria por objeto (sin contabilidad por objeto)\n• Asignación y desasignación en tiempo constante (típicamente)\n• Uso transparente a través de herencia de SmallObject\n• Optimizado para patrones típicos de asignación (bulk, ordenado, invertido, mariposa)\n\nDesventajas:\n• Limitado a objetos por debajo del tamaño máximo (predeterminado 64 bytes)\n• Puede desperdiciar memoria si el patrón de asignación no coincide con el diseño\n• Límite de chunk de 255 bloques debido a indexación unsigned char\n• No óptimo para todos los patrones de asignación de memoria\n• Requiere configurar tamaño de chunk y tamaño máximo de objeto",
    "Tags": "benefits-drawbacks small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "What are key implementation considerations for the Small-Object Allocator?",
    "BackEN": "• Use unsigned char for block indices (alignment-safe, limit 255 blocks)\n• Embed free list in unused blocks (first byte stores next free index)\n• FixedAllocator caches last allocation and deallocation chunks\n• Keep at most one empty chunk to avoid thrashing\n• Swap empty chunks to end of vector for efficient deletion\n• Search bidirectionally from deallocation cache for locality\n• Compiler provides object size via second parameter to operator delete\n• Must define virtual destructor in SmallObject for proper size passing\n• Use std::auto_ptr for automatic cleanup",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el Asignador de Objetos Pequeños?",
    "BackES": "• Usar unsigned char para índices de bloques (seguro para alineación, límite 255 bloques)\n• Incrustar lista libre en bloques no usados (primer byte almacena siguiente índice libre)\n• FixedAllocator cachea últimos chunks de asignación y desasignación\n• Mantener como máximo un chunk vacío para evitar thrashing\n• Intercambiar chunks vacíos al final del vector para eliminación eficiente\n• Buscar bidireccionalmente desde caché de desasignación para localidad\n• El compilador proporciona tamaño del objeto vía segundo parámetro de operator delete\n• Debe definir destructor virtual en SmallObject para paso apropiado de tamaño\n• Usar std::auto_ptr para limpieza automática",
    "Tags": "implementation small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "What patterns are related to the Small-Object Allocator?",
    "BackEN": "• Singleton: SmallObjAllocator is typically a Singleton\n• Object Pool: Small-object allocator is a specialized object pool",
    "FrontES": "¿Qué patrones están relacionados con el Asignador de Objetos Pequeños?",
    "BackES": "• Singleton: SmallObjAllocator típicamente es un Singleton\n• Object Pool: El asignador de objetos pequeños es un pool de objetos especializado",
    "Tags": "related-patterns small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "```cpp\nclass MyClass : public SmallObject<> {\n  int data_;\npublic:\n  MyClass(int d) : data_(d) {}\n};\n\nMyClass* p = new MyClass(42);  // Fast allocation\ndelete p;  // Fast deallocation\n\nvoid Chunk::Init(std::size_t blockSize, unsigned char blocks) {\n  pData_ = new unsigned char[blockSize * blocks];\n  unsigned char i = 0;\n  unsigned char* p = pData_;\n  for (; i != blocks; p += blockSize) {\n    *p = ++i;  // Embed next free index\n  }\n}\n```",
    "BackEN": "Pattern: Small-Object Allocator\nKey elements: Shows transparent usage through inheritance and the embedded free-list technique. Demonstrates how allocation is automatic when inheriting from SmallObject.",
    "FrontES": "```cpp\nclass MyClass : public SmallObject<> {\n  int data_;\npublic:\n  MyClass(int d) : data_(d) {}\n};\n\nMyClass* p = new MyClass(42);  // Asignación rápida\ndelete p;  // Desasignación rápida\n\nvoid Chunk::Init(std::size_t blockSize, unsigned char blocks) {\n  pData_ = new unsigned char[blockSize * blocks];\n  unsigned char i = 0;\n  unsigned char* p = pData_;\n  for (; i != blocks; p += blockSize) {\n    *p = ++i;  // Incrustar siguiente índice libre\n  }\n}\n```",
    "BackES": "Patrón: Asignador de Objetos Pequeños\nElementos clave: Muestra uso transparente a través de herencia y la técnica de lista libre incrustada. Demuestra cómo la asignación es automática al heredar de SmallObject.",
    "Tags": "code-example small-object-allocator structural cpp",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "What are real-world examples of the Small-Object Allocator?",
    "BackEN": "• Smart pointer implementations\n• Functor objects in callback systems\n• String implementations with small string optimization\n• Reference-counted objects\n• Event handler objects",
    "FrontES": "¿Cuáles son ejemplos del mundo real del Asignador de Objetos Pequeños?",
    "BackES": "• Implementaciones de punteros inteligentes\n• Objetos functor en sistemas de callback\n• Implementaciones de string con optimización de string pequeña\n• Objetos con conteo de referencias\n• Objetos manejadores de eventos",
    "Tags": "real-world small-object-allocator structural",
    "Category": "Structural",
    "Page": "28"
  },
  {
    "FrontEN": "Which patterns use the concept 'Template Metaprogramming'?",
    "BackEN": "All three patterns use compile-time computation through templates. Typelists are pure compile-time entities. Functors use partial specialization to handle different parameter counts. The allocator uses templates for SmallObject configuration.\n\nPatterns: Typelists, Generalized Functors, Small-Object Allocator",
    "FrontES": "¿Qué patrones usan el concepto 'Metaprogramación de Plantillas'?",
    "BackES": "Los tres patrones usan computación en tiempo de compilación a través de plantillas. Las Typelists son entidades puramente de tiempo de compilación. Los Functores usan especialización parcial para manejar diferentes cantidades de parámetros. El asignador usa plantillas para configuración de SmallObject.\n\nPatrones: Typelists, Functores Generalizados, Asignador de Objetos Pequeños",
    "Tags": "cross-cutting template-metaprogramming",
    "Category": "Cross-Cutting",
    "Page": "41"
  },
  {
    "FrontEN": "Which patterns use the concept 'Separation of Interface and Implementation'?",
    "BackEN": "Both use handle-body (pimpl) idiom. Functor hides FunctorImpl polymorphism. SmallObject hides allocation complexity. This provides value semantics while using polymorphic implementation.\n\nPatterns: Generalized Functors, Small-Object Allocator",
    "FrontES": "¿Qué patrones usan el concepto 'Separación de Interfaz e Implementación'?",
    "BackES": "Ambos usan el idioma handle-body (pimpl). Functor oculta el polimorfismo de FunctorImpl. SmallObject oculta la complejidad de asignación. Esto proporciona semántica de valores mientras usa implementación polimórfica.\n\nPatrones: Functores Generalizados, Asignador de Objetos Pequeños",
    "Tags": "cross-cutting separation-interface-implementation",
    "Category": "Cross-Cutting",
    "Page": "41"
  },
  {
    "FrontEN": "Which patterns use the concept 'Compile-Time vs Runtime'?",
    "BackEN": "Typelists operate purely at compile-time with no runtime cost. Functors bridge compile-time type knowledge (in constructors) to runtime polymorphic behavior (through virtual functions).\n\nPatterns: Typelists, Generalized Functors",
    "FrontES": "¿Qué patrones usan el concepto 'Tiempo de Compilación vs Tiempo de Ejecución'?",
    "BackES": "Las Typelists operan puramente en tiempo de compilación sin costo en tiempo de ejecución. Los Functores conectan conocimiento de tipos en tiempo de compilación (en constructores) con comportamiento polimórfico en tiempo de ejecución (a través de funciones virtuales).\n\nPatrones: Typelists, Functores Generalizados",
    "Tags": "cross-cutting compile-time-runtime",
    "Category": "Cross-Cutting",
    "Page": "41"
  },
  {
    "FrontEN": "Which patterns use the concept 'Policy-Based Design'?",
    "BackEN": "Both use template parameters to configure behavior. Functor takes return type and parameter typelist. SmallObject takes threading model, chunk size, and max object size as policies.\n\nPatterns: Generalized Functors, Small-Object Allocator",
    "FrontES": "¿Qué patrones usan el concepto 'Diseño Basado en Políticas'?",
    "BackES": "Ambos usan parámetros de plantilla para configurar comportamiento. Functor toma tipo de retorno y typelist de parámetros. SmallObject toma modelo de hilos, tamaño de chunk y tamaño máximo de objeto como políticas.\n\nPatrones: Functores Generalizados, Asignador de Objetos Pequeños",
    "Tags": "cross-cutting policy-based-design",
    "Category": "Cross-Cutting",
    "Page": "41"
  },
  {
    "FrontEN": "Which patterns use the concept 'Zero-Cost Abstraction'?",
    "BackEN": "Typelists have zero runtime cost - all computation is compile-time. Small-object allocator actually improves performance over default allocation while providing cleaner abstraction.\n\nPatterns: Typelists, Small-Object Allocator",
    "FrontES": "¿Qué patrones usan el concepto 'Abstracción de Costo Cero'?",
    "BackES": "Las Typelists tienen costo cero en tiempo de ejecución - toda la computación es en tiempo de compilación. El asignador de objetos pequeños en realidad mejora el rendimiento sobre la asignación predeterminada mientras proporciona una abstracción más limpia.\n\nPatrones: Typelists, Asignador de Objetos Pequeños",
    "Tags": "cross-cutting zero-cost-abstraction",
    "Category": "Cross-Cutting",
    "Page": "41"
  },

  {
    "FrontEN": "What is the intent of Smart Pointers?",
    "BackEN": "Provide automatic memory management and ownership semantics for dynamically allocated objects while maintaining pointer-like syntax and semantics through operator overloading.",
    "FrontES": "¿Cuál es la intención de los Smart Pointers?",
    "BackES": "Proporcionar gestión automática de memoria y semántica de propiedad para objetos asignados dinámicamente, manteniendo al mismo tiempo sintaxis y semántica similar a los punteros mediante sobrecarga de operadores.",
    "Tags": "intent smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "138"
  },
  {
    "FrontEN": "When would you use Smart Pointers?",
    "BackEN": "• When you need automatic memory management for dynamically allocated objects\n• When you want to prevent memory leaks and dangling pointers\n• When you need to transport polymorphic objects safely\n• When you want value semantics for pointer-like objects\n• When ownership transfer or sharing needs to be tracked automatically",
    "FrontES": "¿Cuándo usarías Smart Pointers?",
    "BackES": "• Cuando necesitas gestión automática de memoria para objetos asignados dinámicamente\n• Cuando quieres prevenir fugas de memoria y punteros colgantes\n• Cuando necesitas transportar objetos polimórficos de manera segura\n• Cuando quieres semántica de valor para objetos tipo puntero\n• Cuando la transferencia o compartición de propiedad necesita ser rastreada automáticamente",
    "Tags": "use-case smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "139"
  },
  {
    "FrontEN": "What are the key participants in the Smart Pointer pattern?",
    "BackEN": "• SmartPtr<T>: Template class that wraps a pointer to type T and provides operator-> and operator*\n• Storage Policy: Defines the stored type, pointer type, and reference type\n• Ownership Policy: Manages object lifetime through strategies like deep copy, reference counting, reference linking, or destructive copy\n• Conversion Policy: Controls whether implicit conversion to raw pointers is allowed\n• Checking Policy: Handles null pointer access and other error conditions",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Smart Pointer?",
    "BackES": "• SmartPtr<T>: Clase plantilla que envuelve un puntero de tipo T y proporciona operator-> y operator*\n• Storage Policy: Define el tipo almacenado, tipo de puntero y tipo de referencia\n• Ownership Policy: Gestiona el tiempo de vida del objeto mediante estrategias como copia profunda, conteo de referencias, enlace de referencias o copia destructiva\n• Conversion Policy: Controla si se permite la conversión implícita a punteros raw\n• Checking Policy: Maneja el acceso a punteros nulos y otras condiciones de error",
    "Tags": "key-concepts smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "138"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of Smart Pointers?",
    "BackEN": "Benefits:\n• Automatic memory management eliminates manual delete calls\n• Prevents memory leaks through RAII\n• Supports polymorphic object handling without slicing\n• Provides value semantics for pointer-like objects\n• Exception-safe resource management\n\nDrawbacks:\n• Reference counting/linking cannot detect cyclic references\n• Performance overhead from ownership tracking\n• Size overhead (reference count storage, linking pointers)\n• Potential confusion between smart pointer and pointee operations\n• User-defined conversions can introduce ambiguity",
    "FrontES": "¿Cuáles son los beneficios y desventajas de los Smart Pointers?",
    "BackES": "Beneficios:\n• La gestión automática de memoria elimina las llamadas manuales a delete\n• Previene fugas de memoria mediante RAII\n• Soporta manejo de objetos polimórficos sin slicing\n• Proporciona semántica de valor para objetos tipo puntero\n• Gestión de recursos segura ante excepciones\n\nDesventajas:\n• El conteo/enlace de referencias no puede detectar referencias cíclicas\n• Sobrecarga de rendimiento por el rastreo de propiedad\n• Sobrecarga de tamaño (almacenamiento de conteo de referencias, punteros de enlace)\n• Posible confusión entre operaciones del smart pointer y del objeto apuntado\n• Las conversiones definidas por el usuario pueden introducir ambigüedad",
    "Tags": "benefits-drawbacks smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "139"
  },
  {
    "FrontEN": "What patterns are related to Smart Pointers?",
    "BackEN": "• RAII: Smart pointers are a primary example of RAII - resource lifetime tied to object lifetime\n• Proxy Pattern: Smart pointers act as proxies for raw pointers, controlling access and adding functionality\n• Policy-Based Design: SmartPtr uses policies to configure storage, ownership, conversion, and threading behavior\n• Template Method: Ownership policies use template method pattern to customize behavior at specific points",
    "FrontES": "¿Qué patrones están relacionados con los Smart Pointers?",
    "BackES": "• RAII: Los smart pointers son un ejemplo principal de RAII - tiempo de vida del recurso ligado al tiempo de vida del objeto\n• Patrón Proxy: Los smart pointers actúan como proxies para punteros raw, controlando el acceso y añadiendo funcionalidad\n• Diseño Basado en Políticas: SmartPtr usa políticas para configurar el comportamiento de almacenamiento, propiedad, conversión y concurrencia\n• Template Method: Las políticas de propiedad usan el patrón template method para personalizar el comportamiento en puntos específicos",
    "Tags": "related-patterns smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "138"
  },
  {
    "FrontEN": "What are key implementation considerations for Smart Pointers?",
    "BackEN": "• Avoid member functions - use non-member friends to prevent confusion between sp.Release() and sp->Release()\n• Template by pointee type and policies (Storage, Ownership, Conversion, Threading)\n• Do not overload unary operator& - breaks STL and generic programming\n• Implicit conversion to raw pointer is dangerous but sometimes convenient - make it optional\n• Provide explicit access via GetImpl(), GetImplRef(), Reset(), Release() functions\n• Use intentional ambiguity (two conversions) to prevent delete calls\n• Policy-based design allows mixing and matching features",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para Smart Pointers?",
    "BackES": "• Evitar funciones miembro - usar friend no-miembro para prevenir confusión entre sp.Release() y sp->Release()\n• Parametrizar por tipo de objeto apuntado y políticas (Storage, Ownership, Conversion, Threading)\n• No sobrecargar operator& unario - rompe STL y programación genérica\n• La conversión implícita a puntero raw es peligrosa pero a veces conveniente - hacerla opcional\n• Proporcionar acceso explícito mediante funciones GetImpl(), GetImplRef(), Reset(), Release()\n• Usar ambigüedad intencional (dos conversiones) para prevenir llamadas a delete\n• El diseño basado en políticas permite mezclar y combinar características",
    "Tags": "implementation smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "142"
  },
  {
    "FrontEN": "What are real-world examples of Smart Pointers?",
    "BackEN": "• std::unique_ptr - destructive copy semantics, single ownership\n• std::shared_ptr - reference counted smart pointer\n• std::weak_ptr - non-owning reference to shared_ptr managed objects\n• std::auto_ptr - deprecated, uses destructive copy\n• COM smart pointers (CComPtr, ATL) - reference counted for COM objects\n• Boost smart pointers - various ownership strategies",
    "FrontES": "¿Cuáles son ejemplos reales de Smart Pointers?",
    "BackES": "• std::unique_ptr - semántica de copia destructiva, propiedad única\n• std::shared_ptr - smart pointer con conteo de referencias\n• std::weak_ptr - referencia no propietaria a objetos gestionados por shared_ptr\n• std::auto_ptr - obsoleto, usa copia destructiva\n• Smart pointers COM (CComPtr, ATL) - conteo de referencias para objetos COM\n• Smart pointers Boost - diversas estrategias de propiedad",
    "Tags": "real-world smart-pointer fundamentals",
    "Category": "Fundamentals",
    "Page": "138"
  },
  {
    "FrontEN": "Which patterns use the concept 'Ownership Management'?",
    "BackEN": "Smart pointers track ownership of pointed-to objects to know when to delete them. Strategies include deep copy, reference counting, reference linking, and destructive copy.\n\nPatterns: Smart Pointer",
    "FrontES": "¿Qué patrones usan el concepto 'Gestión de Propiedad'?",
    "BackES": "Los smart pointers rastrean la propiedad de los objetos apuntados para saber cuándo eliminarlos. Las estrategias incluyen copia profunda, conteo de referencias, enlace de referencias y copia destructiva.\n\nPatrones: Smart Pointer",
    "Tags": "cross-cutting ownership-management",
    "Category": "Cross-Cutting",
    "Page": "143"
  },
  {
    "FrontEN": "Which patterns use the concept 'Policy-Based Design'?",
    "BackEN": "SmartPtr decomposes orthogonal design decisions into separate policies for storage, ownership, conversion, checking, and threading.\n\nPatterns: Smart Pointer",
    "FrontES": "¿Qué patrones usan el concepto 'Diseño Basado en Políticas'?",
    "BackES": "SmartPtr descompone decisiones de diseño ortogonales en políticas separadas para almacenamiento, propiedad, conversión, verificación y concurrencia.\n\nPatrones: Smart Pointer",
    "Tags": "cross-cutting policy-based-design",
    "Category": "Cross-Cutting",
    "Page": "130"
  },
  {
    "FrontEN": "Which patterns use the concept 'RAII'?",
    "BackEN": "Resource lifetime tied to object lifetime. Constructor acquires resource, destructor releases it automatically.\n\nPatterns: Smart Pointer",
    "FrontES": "¿Qué patrones usan el concepto 'RAII'?",
    "BackES": "El tiempo de vida del recurso está ligado al tiempo de vida del objeto. El constructor adquiere el recurso, el destructor lo libera automáticamente.\n\nPatrones: Smart Pointer",
    "Tags": "cross-cutting raii",
    "Category": "Cross-Cutting",
    "Page": "139"
  },
  {
    "FrontEN": "What is the Deep Copy ownership strategy for smart pointers?",
    "BackEN": "Copy the pointee object whenever you copy the smart pointer. Each smart pointer owns its own copy of the object. This supports polymorphic object handling without slicing when combined with virtual Clone functions. Simple but can be expensive for large objects.",
    "FrontES": "¿Cuál es la estrategia de propiedad Copia Profunda para smart pointers?",
    "BackES": "Copiar el objeto apuntado cada vez que copias el smart pointer. Cada smart pointer posee su propia copia del objeto. Esto soporta manejo de objetos polimórficos sin slicing cuando se combina con funciones virtuales Clone. Simple pero puede ser costoso para objetos grandes.",
    "Tags": "ownership-strategy deep-copy smart-pointer",
    "Category": "Fundamentals",
    "Page": "143"
  },
  {
    "FrontEN": "What is the Reference Counting ownership strategy for smart pointers?",
    "BackEN": "Track the number of smart pointers pointing to the same object. When the count reaches zero, delete the object. Most popular strategy. Requires storing a shared counter (typically on the heap). Cannot detect cyclic references. Can be intrusive (counter in object) or non-intrusive (separate counter).",
    "FrontES": "¿Cuál es la estrategia de propiedad Conteo de Referencias para smart pointers?",
    "BackES": "Rastrear el número de smart pointers apuntando al mismo objeto. Cuando el contador llega a cero, eliminar el objeto. Estrategia más popular. Requiere almacenar un contador compartido (típicamente en el heap). No puede detectar referencias cíclicas. Puede ser intrusivo (contador en el objeto) o no intrusivo (contador separado).",
    "Tags": "ownership-strategy reference-counting smart-pointer",
    "Category": "Fundamentals",
    "Page": "145"
  },
  {
    "FrontEN": "Why should smart pointers avoid member functions for operations like Release()?",
    "BackEN": "Member functions create confusion between smart pointer operations and pointee operations. The difference between sp.Release() and sp->Release() is just a dot vs arrow, which is too subtle. C++ programmers aren't habituated to this distinction. Use non-member friend functions instead: Release(sp) vs sp->Release() is much clearer.",
    "FrontES": "¿Cuál es la estrategia de propiedad Copia Destructiva para smart pointers?",
    "BackES": "Durante la copia, transfiere la propiedad del objeto origen al destino. El origen se vuelve nulo. Útil para semántica de transferencia de propiedad pero rompe semántica de valor - no puede usarse en contenedores STL. Implementado por std::auto_ptr (obsoleto) y std::unique_ptr (move-only). El puntero origen se 'hunde' después de la copia.",
    "Tags": "implementation design-decision smart-pointer",
    "Category": "Fundamentals",
    "Page": "142"
  },
  {
    "FrontEN": "Why should smart pointers NOT overload unary operator&?",
    "BackEN": "Overloading operator& breaks STL containers and generic programming. Generic code assumes &obj returns T* for type T - this is a fundamental concept. Overloading it causes strange compile-time or runtime errors. Also exposes raw pointer, defeating ownership management. SmartPtr does not overload operator&.",
    "FrontES": "¿Por qué los smart pointers NO deben sobrecargar operator& unario?",
    "BackES": "Sobrecargar operator& rompe contenedores STL y programación genérica. El código genérico asume que &obj devuelve T* para tipo T - este es un concepto fundamental. Sobrecargarlo causa errores extraños en tiempo de compilación o ejecución. También expone el puntero raw, derrotando la gestión de propiedad. SmartPtr no sobrecarga operator&.",
    "Tags": "implementation anti-pattern smart-pointer",
    "Category": "Fundamentals",
    "Page": "150"
  },
  {
    "FrontEN": "What are the dangers of implicit conversion to raw pointer types in smart pointers?",
    "BackEN": "Dangers:\n• Gives unattended access to raw pointer, defeating ownership management\n• Conversions pop up unexpectedly (e.g., delete sp compiles!)\n• Can create ambiguity\n\nMitigation:\n• Make conversion optional (disabled by default)\n• Use two conversions (T* and void*) to make delete ambiguous\n• Always provide explicit access via GetImpl()",
    "FrontES": "¿Cuáles son los peligros de la conversión implícita a tipos de puntero raw en smart pointers?",
    "BackES": "Peligros:\n• Da acceso desatendido al puntero raw, derrotando la gestión de propiedad\n• Las conversiones aparecen inesperadamente (¡ej., delete sp compila!)\n• Puede crear ambigüedad\n\nMitigación:\n• Hacer la conversión opcional (deshabilitada por defecto)\n• Usar dos conversiones (T* y void*) para hacer delete ambiguo\n• Siempre proporcionar acceso explícito mediante GetImpl()",
    "Tags": "implementation conversion smart-pointer",
    "Category": "Fundamentals",
    "Page": "151"
  },
  {
    "FrontEN": "What is the slicing problem with smart pointers and how is it solved?",
    "BackEN": "Problem: Naive copy like 'new T(*other.pointee_)' only copies the base class part if pointee_ points to a derived class object.\n\nSolution: Use virtual Clone function:\n• Define 'virtual Base* Clone() = 0' in base class\n• Implement as 'return new Derived(*this)' in each derived class\n• Smart pointer calls Clone() to get polymorphic copy\n• Parameterize with a Cloning policy for flexibility",
    "FrontES": "¿Cuál es el problema de slicing con smart pointers y cómo se resuelve?",
    "BackES": "Problema: Copia ingenua como 'new T(*other.pointee_)' solo copia la parte de clase base si pointee_ apunta a un objeto de clase derivada.\n\nSolución: Usar función virtual Clone:\n• Definir 'virtual Base* Clone() = 0' en clase base\n• Implementar como 'return new Derived(*this)' en cada clase derivada\n• El smart pointer llama Clone() para obtener copia polimórfica\n• Parametrizar con una política de Clonación para flexibilidad",
    "Tags": "implementation polymorphism smart-pointer",
    "Category": "Fundamentals",
    "Page": "144"
  },
  {
    "FrontEN": "What are the three types that can be customized in smart pointer storage?",
    "BackEN": "1. Storage type: The type of pointee_ (typically T*, but could be a handle or modified pointer like __far*)\n2. Pointer type: Type returned by operator-> (could be a proxy object)\n3. Reference type: Type returned by operator*\n\nThis generalization allows:\n• Support for segmented memory architectures\n• Layering smart pointers\n• Pre/post function call idiom via proxy objects\n• Handle-based resources",
    "FrontES": "¿Cuáles son los tres tipos que pueden personalizarse en el almacenamiento de smart pointers?",
    "BackES": "1. Tipo de almacenamiento: El tipo de pointee_ (típicamente T*, pero podría ser un handle o puntero modificado como __far*)\n2. Tipo de puntero: Tipo devuelto por operator-> (podría ser un objeto proxy)\n3. Tipo de referencia: Tipo devuelto por operator*\n\nEsta generalización permite:\n• Soporte para arquitecturas de memoria segmentada\n• Capas de smart pointers\n• Idioma pre/post llamada a función mediante objetos proxy\n• Recursos basados en handles",
    "Tags": "implementation storage-policy smart-pointer",
    "Category": "Fundamentals",
    "Page": "140"
  },
  {
    "FrontEN": "How does the Double-Checked Locking pattern work for thread-safe smart pointers?",
    "BackEN": "```cpp\nif (!pInstance_)  // 1st check - fast, no lock\n{\n    Lock guard(mutex_);  // Lock only if needed\n    if (!pInstance_)  // 2nd check - accurate\n    {\n        pInstance_ = new Singleton;\n    }\n}\nreturn *pInstance_;\n```\nFirst check is fast. Second check (after locking) is accurate. Avoids locking overhead after initialization. Note: May fail on relaxed memory model systems without memory barriers.",
    "FrontES": "¿Cómo funciona el patrón Double-Checked Locking para smart pointers thread-safe?",
    "BackES": "```cpp\nif (!pInstance_)  // 1ra verificación - rápida, sin bloqueo\n{\n    Lock guard(mutex_);  // Bloquear solo si es necesario\n    if (!pInstance_)  // 2da verificación - precisa\n    {\n        pInstance_ = new Singleton;\n    }\n}\nreturn *pInstance_;\n```\nLa primera verificación es rápida. La segunda verificación (después de bloquear) es precisa. Evita sobrecarga de bloqueo después de la inicialización. Nota: Puede fallar en sistemas con modelo de memoria relajado sin barreras de memoria.",
    "Tags": "implementation threading smart-pointer code-example",
    "Category": "Fundamentals",
    "Page": "128"
  },
  {
    "FrontEN": "What is Copy-on-Write (COW) and why is it difficult for smart pointers?",
    "BackEN": "COW delays copying until the first modification attempt. Problem: Smart pointers cannot differentiate between const and non-const member function calls. operator-> is called for both sp->ConstFun() and sp->NonConstFun(). The smart pointer doesn't know which one will be called, so it cannot decide when to copy. COW is better implemented as a class optimization, not in smart pointers.",
    "FrontES": "¿Qué es Copy-on-Write (COW) y por qué es difícil para smart pointers?",
    "BackES": "COW retrasa la copia hasta el primer intento de modificación. Problema: Los smart pointers no pueden diferenciar entre llamadas a funciones miembro const y no-const. operator-> se llama tanto para sp->ConstFun() como para sp->NonConstFun(). El smart pointer no sabe cuál se llamará, por lo que no puede decidir cuándo copiar. COW es mejor implementado como optimización de clase, no en smart pointers.",
    "Tags": "ownership-strategy cow smart-pointer",
    "Category": "Fundamentals",
    "Page": "145"
  },
  {
    "FrontEN": "What is intrusive vs non-intrusive reference counting?",
    "BackEN": "Intrusive: Reference counter stored inside the pointee object\n• Pros: No extra allocation, smart pointer is just pointer-sized, fastest\n• Cons: Must modify pointee class\n\nNon-intrusive: Reference counter stored separately\n• Pros: No pointee class modification needed\n• Cons: Extra heap allocation, smart pointer is 2x pointer size, slower\n\nMitigation for non-intrusive: Use small-object allocator to reduce overhead",
    "FrontES": "¿Qué es el conteo de referencias intrusivo vs no intrusivo?",
    "BackES": "Intrusivo: Contador de referencias almacenado dentro del objeto apuntado\n• Pros: Sin asignación extra, smart pointer tiene solo tamaño de puntero, más rápido\n• Contras: Debe modificar la clase del objeto apuntado\n\nNo intrusivo: Contador de referencias almacenado separadamente\n• Pros: No se necesita modificación de la clase del objeto apuntado\n• Contras: Asignación extra en heap, smart pointer es 2x tamaño de puntero, más lento\n\nMitigación para no intrusivo: Usar asignador de objetos pequeños para reducir sobrecarga",
    "Tags": "ownership-strategy reference-counting smart-pointer",
    "Category": "Fundamentals",
    "Page": "146"
  },
  {
    "FrontEN": "What problem does std::auto_ptr have with containers and function calls?",
    "BackEN": "std::auto_ptr uses destructive copy - source becomes null after copying. This breaks value semantics:\n\n```cpp\nvoid Display(auto_ptr<Something> sp);  // Takes by value\nauto_ptr<Something> sp(new Something);\nDisplay(sp);  // sp is now NULL!\n```\n\nPassing by value 'sinks' the smart pointer. Cannot be stored in STL containers because they require copyable elements. Good for transfer-of-ownership semantics but dangerous for normal value semantics.",
    "FrontES": "¿Qué problema tiene std::auto_ptr con contenedores y llamadas a funciones?",
    "BackES": "std::auto_ptr usa copia destructiva - el origen se vuelve nulo después de copiar. Esto rompe semántica de valor:\n\n```cpp\nvoid Display(auto_ptr<Something> sp);  // Toma por valor\nauto_ptr<Something> sp(new Something);\nDisplay(sp);  // ¡sp ahora es NULL!\n```\n\nPasar por valor 'hunde' el smart pointer. No puede almacenarse en contenedores STL porque requieren elementos copiables. Bueno para semántica de transferencia de propiedad pero peligroso para semántica de valor normal.",
    "Tags": "anti-pattern auto-ptr smart-pointer",
    "Category": "Fundamentals",
    "Page": "149"
  },
  {
    "FrontEN": "What is the cyclic reference problem with reference-counted smart pointers?",
    "BackEN": "Cyclic reference: Object A holds smart pointer to B, and B holds smart pointer to A. They reference each other, so reference count never reaches zero even when no external references exist. This causes a memory leak.\n\nSolution approaches:\n• Use weak pointers for back-references\n• Manually break cycles before abandoning objects\n• Use ownership-based design to avoid cycles\n• Document which pointers are owning vs non-owning\n\nCycles can span multiple objects and are hard to debug.",
    "FrontES": "¿Cuál es el problema de referencia cíclica con smart pointers con conteo de referencias?",
    "BackES": "Referencia cíclica: Objeto A contiene smart pointer a B, y B contiene smart pointer a A. Se referencian mutuamente, por lo que el contador de referencias nunca llega a cero incluso cuando no existen referencias externas. Esto causa una fuga de memoria.\n\nEnfoques de solución:\n• Usar weak pointers para referencias hacia atrás\n• Romper manualmente los ciclos antes de abandonar objetos\n• Usar diseño basado en propiedad para evitar ciclos\n• Documentar qué punteros son propietarios vs no propietarios\n\nLos ciclos pueden abarcar múltiples objetos y son difíciles de depurar.",
    "Tags": "anti-pattern reference-counting smart-pointer",
    "Category": "Fundamentals",
    "Page": "148"
  },
  {
    "FrontEN": "Why should the Storage policy generalize the pointee type in smart pointers?",
    "BackEN": "Reasons for generalization:\n• Support non-standard pointer modifiers (__near, __far, __huge for segmented memory)\n• Enable smart pointer layering (wrapping one smart pointer in another)\n• Support handle-based resources (OS handles aren't real pointers)\n• Allow proxy objects for pre/post function call idiom\n• Enable different allocation strategies\n\nStorage policy defines: stored type, pointer type, reference type. Not all types make sense for all instantiations (e.g., handles don't need operator->).",
    "FrontES": "¿Por qué la política de Storage debe generalizar el tipo de objeto apuntado en smart pointers?",
    "BackES": "Razones para la generalización:\n• Soportar modificadores de puntero no estándar (__near, __far, __huge para memoria segmentada)\n• Habilitar capas de smart pointers (envolver un smart pointer en otro)\n• Soportar recursos basados en handles (los handles del SO no son punteros reales)\n• Permitir objetos proxy para el idioma pre/post llamada a función\n• Habilitar diferentes estrategias de asignación\n\nLa política de Storage define: tipo almacenado, tipo de puntero, tipo de referencia. No todos los tipos tienen sentido para todas las instanciaciones (ej., los handles no necesitan operator->).",
    "Tags": "implementation storage-policy smart-pointer",
    "Category": "Fundamentals",
    "Page": "140"
  },
  {
    "FrontEN": "How can smart pointers implement the pre/post function call idiom?",
    "BackEN": "Return a proxy object from operator-> instead of a raw pointer:\n\n1. Call sp->Function()\n2. operator-> returns PointerType by value\n3. PointerType constructor executes (pre-call, e.g., acquire lock)\n4. PointerType::operator-> returns raw pointer\n5. Function() is called\n6. PointerType destructor executes (post-call, e.g., release lock)\n\nThis enables automatic locking/unlocking for resource access. The compiler recursively applies operator-> until reaching a raw pointer.",
    "FrontES": "¿Cómo pueden los smart pointers implementar el idioma pre/post llamada a función?",
    "BackES": "Devolver un objeto proxy desde operator-> en lugar de un puntero raw:\n\n1. Llamar sp->Function()\n2. operator-> devuelve PointerType por valor\n3. El constructor de PointerType se ejecuta (pre-llamada, ej., adquirir bloqueo)\n4. PointerType::operator-> devuelve puntero raw\n5. Function() se llama\n6. El destructor de PointerType se ejecuta (post-llamada, ej., liberar bloqueo)\n\nEsto permite bloqueo/desbloqueo automático para acceso a recursos. El compilador aplica recursivamente operator-> hasta alcanzar un puntero raw.",
    "Tags": "implementation technique smart-pointer",
    "Category": "Fundamentals",
    "Page": "141"
  },
  {
    "FrontEN": "What are the non-member functions provided for SmartPtr access?",
    "BackEN": "• GetImpl(sp): Returns the pointer object stored by SmartPtr\n• GetImplRef(sp): Returns reference to stored pointer (allows modification, use with care)\n• Reset(sp, source): Resets underlying pointer to another value, releases previous one\n• Release(sp, destination): Releases ownership, gives user responsibility for management\n\nThese are non-member to avoid confusion with pointee member functions. Use explicit calls like GetImpl(sp) instead of sp.GetImpl().",
    "FrontES": "¿Cuáles son las funciones no-miembro proporcionadas para el acceso a SmartPtr?",
    "BackES": "• GetImpl(sp): Devuelve el objeto puntero almacenado por SmartPtr\n• GetImplRef(sp): Devuelve referencia al puntero almacenado (permite modificación, usar con cuidado)\n• Reset(sp, source): Resetea el puntero subyacente a otro valor, libera el anterior\n• Release(sp, destination): Libera la propiedad, da al usuario la responsabilidad de gestión\n\nEstas son no-miembro para evitar confusión con funciones miembro del objeto apuntado. Usar llamadas explícitas como GetImpl(sp) en lugar de sp.GetImpl().",
    "Tags": "implementation api smart-pointer",
    "Category": "Fundamentals",
    "Page": "143"
  },

  {
    "FrontEN": "What is the intent of the Smart Pointer pattern?",
    "BackEN": "To provide automatic memory management and ownership semantics for dynamically allocated objects through policy-based design. Smart pointers wrap raw pointers and control their behavior through policies for Storage, Ownership, Conversion, and Checking.",
    "FrontES": "¿Cuál es la intención del patrón Smart Pointer?",
    "BackES": "Proporcionar gestión automática de memoria y semántica de propiedad para objetos asignados dinámicamente mediante diseño basado en políticas. Los punteros inteligentes envuelven punteros sin procesar y controlan su comportamiento a través de políticas para Almacenamiento, Propiedad, Conversión y Verificación.",
    "Tags": "smartpointer other memorymanagement policybaseddesign intent fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "When should you use the Smart Pointer pattern?",
    "BackEN": "Use Smart Pointer when:\n- You need automatic resource management and RAII\n- You want customizable ownership semantics (transfer, reference counting, deep copy)\n- You need to prevent common pointer errors (null dereference, dangling pointers)\n- You want compile-time customization of pointer behavior through policies\n- You need to manage object lifetime automatically",
    "FrontES": "¿Cuándo deberías usar el patrón Smart Pointer?",
    "BackES": "Usa Smart Pointer cuando:\n- Necesitas gestión automática de recursos y RAII\n- Quieres semántica de propiedad personalizable (transferencia, conteo de referencias, copia profunda)\n- Necesitas prevenir errores comunes de punteros (desreferencia nula, punteros colgantes)\n- Quieres personalización en tiempo de compilación del comportamiento del puntero a través de políticas\n- Necesitas gestionar el tiempo de vida del objeto automáticamente",
    "Tags": "smartpointer other applicability use-case fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "What are the key participants in the Smart Pointer pattern?",
    "BackEN": "1. **SmartPtr template class**: Main wrapper managing the pointee\n2. **Storage Policy**: Controls how pointer is stored (DefaultSPStorage, ArrayStorage)\n3. **Ownership Policy**: Manages object lifetime (RefCounted, DestructiveCopy, RefLinked)\n4. **Conversion Policy**: Controls implicit conversions (AllowConversion, DisallowConversion)\n5. **Checking Policy**: Validates pointer operations (AssertCheck, RejectNull, NoCheck)\n6. **Tester class**: Helper for safe bool conversion",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Smart Pointer?",
    "BackES": "1. **Clase plantilla SmartPtr**: Envoltorio principal que gestiona el objeto apuntado\n2. **Política de Almacenamiento**: Controla cómo se almacena el puntero (DefaultSPStorage, ArrayStorage)\n3. **Política de Propiedad**: Gestiona el tiempo de vida del objeto (RefCounted, DestructiveCopy, RefLinked)\n4. **Política de Conversión**: Controla las conversiones implícitas (AllowConversion, DisallowConversion)\n5. **Política de Verificación**: Valida las operaciones del puntero (AssertCheck, RejectNull, NoCheck)\n6. **Clase Tester**: Ayudante para conversión segura a bool",
    "Tags": "smartpointer other structure policybaseddesign key-concepts fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Smart Pointer pattern?",
    "BackEN": "**Benefits:**\n- Automatic resource management (RAII)\n- Prevents memory leaks and dangling pointers\n- Highly customizable through policy-based design\n- Type-safe compared to raw pointers\n- Can enforce ownership semantics at compile time\n\n**Drawbacks:**\n- Increased complexity from template metaprogramming\n- Potential performance overhead (reference counting, checks)\n- Can create circular references with reference-counted pointers\n- Learning curve for policy-based design\n- Debugging template errors can be difficult",
    "FrontES": "¿Cuáles son los beneficios e inconvenientes del patrón Smart Pointer?",
    "BackES": "**Beneficios:**\n- Gestión automática de recursos (RAII)\n- Previene fugas de memoria y punteros colgantes\n- Altamente personalizable mediante diseño basado en políticas\n- Seguridad de tipos comparado con punteros sin procesar\n- Puede imponer semántica de propiedad en tiempo de compilación\n\n**Inconvenientes:**\n- Mayor complejidad por metaprogramación de plantillas\n- Posible sobrecarga de rendimiento (conteo de referencias, verificaciones)\n- Puede crear referencias circulares con punteros con conteo de referencias\n- Curva de aprendizaje para diseño basado en políticas\n- Depurar errores de plantillas puede ser difícil",
    "Tags": "smartpointer other tradeoffs benefits-drawbacks fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "What patterns are related to Smart Pointer?",
    "BackEN": "- **Proxy**: Smart pointers act as proxies for raw pointers\n- **Strategy**: Policies are strategies for different aspects of pointer behavior\n- **RAII (Resource Acquisition Is Initialization)**: Fundamental principle used by smart pointers\n- **Reference Counting**: Common ownership policy implementation",
    "FrontES": "¿Qué patrones están relacionados con Smart Pointer?",
    "BackES": "- **Proxy**: Los punteros inteligentes actúan como proxies para punteros sin procesar\n- **Strategy**: Las políticas son estrategias para diferentes aspectos del comportamiento del puntero\n- **RAII (Resource Acquisition Is Initialization)**: Principio fundamental usado por los punteros inteligentes\n- **Reference Counting**: Implementación común de política de propiedad",
    "Tags": "smartpointer other relatedpatterns related-patterns fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "Show a code example of the Smart Pointer Tester trick for safe bool conversion",
    "BackEN": "```cpp\ntemplate <class T>\nclass SmartPtr\n{\n    class Tester { void operator delete(void*); };\npublic:\n    operator Tester*() const\n    {\n        if (!pointee_) return 0;\n        static Tester test;\n        return &test;\n    }\n};\n```\nThis allows `if (smartPtr)` checks without allowing dangerous conversions to bool or int. The Tester class with deleted operator delete prevents misuse.",
    "FrontES": "Muestra un ejemplo de código del truco Tester de Smart Pointer para conversión segura a bool",
    "BackES": "```cpp\ntemplate <class T>\nclass SmartPtr\n{\n    class Tester { void operator delete(void*); };\npublic:\n    operator Tester*() const\n    {\n        if (!pointee_) return 0;\n        static Tester test;\n        return &test;\n    }\n};\n```\nEsto permite verificaciones `if (smartPtr)` sin permitir conversiones peligrosas a bool o int. La clase Tester con operator delete eliminado previene el mal uso.",
    "Tags": "smartpointer other codeexample cpp code-example fundamentals",
    "Category": "Fundamentals",
    "Page": "160"
  },
  {
    "FrontEN": "What implementation considerations exist for Smart Pointer operator overloading?",
    "BackEN": "1. **operator->()**: Must return pointer or object with operator->()\n2. **operator*()**: Should return reference to pointee\n3. **Comparison operators**: Need both member and non-member versions for symmetry\n4. **Bool conversion**: Use Tester trick to avoid implicit conversions to int\n5. **Ordering operators (<, >, etc.)**: Consider whether smart pointers should be ordered\n6. **Implicit conversions**: Control via Conversion policy to prevent accidental conversions",
    "FrontES": "¿Qué consideraciones de implementación existen para la sobrecarga de operadores de Smart Pointer?",
    "BackES": "1. **operator->()**: Debe devolver puntero u objeto con operator->()\n2. **operator*()**: Debe devolver referencia al objeto apuntado\n3. **Operadores de comparación**: Necesita versiones miembro y no miembro para simetría\n4. **Conversión a bool**: Usa el truco Tester para evitar conversiones implícitas a int\n5. **Operadores de orden (<, >, etc.)**: Considera si los punteros inteligentes deberían ordenarse\n6. **Conversiones implícitas**: Controla mediante política de Conversión para prevenir conversiones accidentales",
    "Tags": "smartpointer other implementation operatoroverloading implementation fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "What real-world examples use the Smart Pointer pattern?",
    "BackEN": "- **std::unique_ptr**: C++11 smart pointer with move semantics and unique ownership\n- **std::shared_ptr**: Reference-counted smart pointer for shared ownership\n- **std::weak_ptr**: Non-owning reference to break circular dependencies\n- **Boost smart pointers**: scoped_ptr, intrusive_ptr, etc.\n- **COM smart pointers**: CComPtr in ATL for COM object lifetime management",
    "FrontES": "¿Qué ejemplos del mundo real usan el patrón Smart Pointer?",
    "BackES": "- **std::unique_ptr**: Puntero inteligente C++11 con semántica de movimiento y propiedad única\n- **std::shared_ptr**: Puntero inteligente con conteo de referencias para propiedad compartida\n- **std::weak_ptr**: Referencia sin propiedad para romper dependencias circulares\n- **Punteros inteligentes Boost**: scoped_ptr, intrusive_ptr, etc.\n- **Punteros inteligentes COM**: CComPtr en ATL para gestión del tiempo de vida de objetos COM",
    "Tags": "smartpointer other realworld real-world fundamentals",
    "Category": "Fundamentals",
    "Page": "154"
  },
  {
    "FrontEN": "What is the intent of the Object Factory pattern?",
    "BackEN": "To create polymorphic objects without knowing their concrete types at compile time by mapping type identifiers (strings, integers, or type_info) to creator functions. The factory encapsulates object creation and returns base class pointers.",
    "FrontES": "¿Cuál es la intención del patrón Object Factory?",
    "BackES": "Crear objetos polimórficos sin conocer sus tipos concretos en tiempo de compilación mediante el mapeo de identificadores de tipo (cadenas, enteros o type_info) a funciones creadoras. La fábrica encapsula la creación de objetos y devuelve punteros de clase base.",
    "Tags": "objectfactory creational polymorphism intent creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "When should you use the Object Factory pattern?",
    "BackEN": "Use Object Factory when:\n- You need to create objects whose types are determined at runtime\n- Object types are specified by external data (config files, user input)\n- You want to centralize object creation logic\n- You need to register and create polymorphic objects dynamically\n- You want to decouple object creation from object use",
    "FrontES": "¿Cuándo deberías usar el patrón Object Factory?",
    "BackES": "Usa Object Factory cuando:\n- Necesitas crear objetos cuyos tipos se determinan en tiempo de ejecución\n- Los tipos de objetos se especifican mediante datos externos (archivos de configuración, entrada del usuario)\n- Quieres centralizar la lógica de creación de objetos\n- Necesitas registrar y crear objetos polimórficos dinámicamente\n- Quieres desacoplar la creación de objetos de su uso",
    "Tags": "objectfactory creational applicability use-case creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What are the key participants in the Object Factory pattern?",
    "BackEN": "1. **Factory class**: Maps identifiers to creator functions and creates objects\n2. **Type Identifier (IdType)**: Runtime representation of type (string, int, type_info)\n3. **Creator Function (ProductCreator)**: Function/functor that creates products\n4. **Abstract Product**: Base class for created objects\n5. **Concrete Products**: Specific types registered with factory\n6. **Registry**: Internal map from IdType to ProductCreator",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Object Factory?",
    "BackES": "1. **Clase Factory**: Mapea identificadores a funciones creadoras y crea objetos\n2. **Identificador de Tipo (IdType)**: Representación en tiempo de ejecución del tipo (string, int, type_info)\n3. **Función Creadora (ProductCreator)**: Función/functor que crea productos\n4. **Producto Abstracto**: Clase base para objetos creados\n5. **Productos Concretos**: Tipos específicos registrados con la fábrica\n6. **Registro**: Mapa interno de IdType a ProductCreator",
    "Tags": "objectfactory creational structure key-concepts creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Object Factory pattern?",
    "BackEN": "**Benefits:**\n- Decouples object creation from concrete types\n- Supports runtime type determination\n- Easy to add new product types (register with factory)\n- Centralizes creation logic for easier maintenance\n- Enables data-driven object creation\n\n**Drawbacks:**\n- Runtime overhead from map lookup and indirect calls\n- Requires registration of all product types\n- Type safety only at base class level\n- Error handling needed for unknown type identifiers\n- Can become complex with many product types",
    "FrontES": "¿Cuáles son los beneficios e inconvenientes del patrón Object Factory?",
    "BackES": "**Beneficios:**\n- Desacopla la creación de objetos de tipos concretos\n- Soporta determinación de tipos en tiempo de ejecución\n- Fácil agregar nuevos tipos de productos (registrar con la fábrica)\n- Centraliza la lógica de creación para mantenimiento más fácil\n- Permite creación de objetos basada en datos\n\n**Inconvenientes:**\n- Sobrecarga en tiempo de ejecución por búsqueda en mapa y llamadas indirectas\n- Requiere registro de todos los tipos de productos\n- Seguridad de tipos solo a nivel de clase base\n- Necesita manejo de errores para identificadores de tipo desconocidos\n- Puede volverse complejo con muchos tipos de productos",
    "Tags": "objectfactory creational tradeoffs benefits-drawbacks creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What patterns are related to Object Factory?",
    "BackEN": "- **Abstract Factory**: Creates families of related objects (Factory creates single objects)\n- **Prototype**: Alternative approach using cloning instead of creation functions\n- **Singleton**: Often combined to ensure single factory instance\n- **Registry**: Factory uses registry pattern to map identifiers to creators",
    "FrontES": "¿Qué patrones están relacionados con Object Factory?",
    "BackES": "- **Abstract Factory**: Crea familias de objetos relacionados (Factory crea objetos individuales)\n- **Prototype**: Enfoque alternativo usando clonación en lugar de funciones de creación\n- **Singleton**: A menudo combinado para asegurar una única instancia de fábrica\n- **Registry**: Factory usa el patrón registry para mapear identificadores a creadores",
    "Tags": "objectfactory creational relatedpatterns related-patterns creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "Show a code example of an Object Factory with type registration",
    "BackEN": "```cpp\ntemplate <class AbstractProduct, typename IdType,\n          typename ProductCreator = AbstractProduct* (*)()>\nclass Factory\n{\npublic:\n    bool Register(const IdType& id, ProductCreator creator)\n    {\n        return associations_.insert(\n            typename IdToProductMap::value_type(id, creator)).second;\n    }\n    \n    bool Unregister(const IdType& id)\n    {\n        return associations_.erase(id) == 1;\n    }\n    \n    AbstractProduct* CreateObject(const IdType& id)\n    {\n        typename IdToProductMap::const_iterator i = \n            associations_.find(id);\n        if (i != associations_.end())\n            return (i->second)();\n        return nullptr;\n    }\n    \nprivate:\n    typedef std::map<IdType, ProductCreator> IdToProductMap;\n    IdToProductMap associations_;\n};\n```",
    "FrontES": "Muestra un ejemplo de código de un Object Factory con registro de tipos",
    "BackES": "```cpp\ntemplate <class AbstractProduct, typename IdType,\n          typename ProductCreator = AbstractProduct* (*)()>\nclass Factory\n{\npublic:\n    bool Register(const IdType& id, ProductCreator creator)\n    {\n        return associations_.insert(\n            typename IdToProductMap::value_type(id, creator)).second;\n    }\n    \n    bool Unregister(const IdType& id)\n    {\n        return associations_.erase(id) == 1;\n    }\n    \n    AbstractProduct* CreateObject(const IdType& id)\n    {\n        typename IdToProductMap::const_iterator i = \n            associations_.find(id);\n        if (i != associations_.end())\n            return (i->second)();\n        return nullptr;\n    }\n    \nprivate:\n    typedef std::map<IdType, ProductCreator> IdToProductMap;\n    IdToProductMap associations_;\n};\n```",
    "Tags": "objectfactory creational codeexample cpp code-example creational",
    "Category": "Creational",
    "Page": "170"
  },
  {
    "FrontEN": "What implementation considerations exist for Object Factory type identifiers?",
    "BackEN": "1. **String identifiers**: Human-readable, easy to serialize, but slower lookup\n2. **Integer identifiers**: Fast lookup, compact, but requires manual assignment\n3. **type_info identifiers**: Type-safe, automatic, but not serializable\n4. **Registration timing**: Consider static initialization order issues\n5. **Error handling**: Decide how to handle unknown identifiers (exception, null, default object)\n6. **Thread safety**: Protect registry if factory used concurrently",
    "FrontES": "¿Qué consideraciones de implementación existen para los identificadores de tipo de Object Factory?",
    "BackES": "1. **Identificadores de cadena**: Legibles por humanos, fáciles de serializar, pero búsqueda más lenta\n2. **Identificadores enteros**: Búsqueda rápida, compactos, pero requieren asignación manual\n3. **Identificadores type_info**: Seguros en tipos, automáticos, pero no serializables\n4. **Tiempo de registro**: Considerar problemas de orden de inicialización estática\n5. **Manejo de errores**: Decidir cómo manejar identificadores desconocidos (excepción, null, objeto predeterminado)\n6. **Seguridad de hilos**: Proteger registro si la fábrica se usa concurrentemente",
    "Tags": "objectfactory creational implementation typeidentifiers implementation creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What real-world examples use the Object Factory pattern?",
    "BackEN": "- **GUI frameworks**: Create UI widgets from strings (\"Button\", \"TextField\")\n- **Document parsers**: Create document elements from XML tags\n- **Plugin systems**: Load and create plugin objects by name\n- **Game engines**: Create game objects from type names or IDs\n- **Serialization frameworks**: Reconstruct objects from serialized type information",
    "FrontES": "¿Qué ejemplos del mundo real usan el patrón Object Factory?",
    "BackES": "- **Frameworks de GUI**: Crear widgets de UI desde cadenas (\"Button\", \"TextField\")\n- **Analizadores de documentos**: Crear elementos de documento desde etiquetas XML\n- **Sistemas de plugins**: Cargar y crear objetos plugin por nombre\n- **Motores de juegos**: Crear objetos de juego desde nombres de tipos o IDs\n- **Frameworks de serialización**: Reconstruir objetos desde información de tipo serializada",
    "Tags": "objectfactory creational realworld real-world creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What is the intent of the Clone Factory pattern?",
    "BackEN": "To clone polymorphic objects without knowing their concrete types at compile time by using RTTI (typeid) as a type identifier. The factory maps type_info to clone functions that can copy-construct the correct concrete type.",
    "FrontES": "¿Cuál es la intención del patrón Clone Factory?",
    "BackES": "Clonar objetos polimórficos sin conocer sus tipos concretos en tiempo de compilación usando RTTI (typeid) como identificador de tipo. La fábrica mapea type_info a funciones de clonación que pueden construir por copia el tipo concreto correcto.",
    "Tags": "clonefactory creational rtti prototype intent creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "When should you use the Clone Factory pattern?",
    "BackEN": "Use Clone Factory when:\n- You need to clone polymorphic objects through base pointers\n- You want to avoid adding virtual Clone() methods to class hierarchy\n- You need centralized cloning logic\n- You want to clone objects without knowing concrete types\n- You need to support cloning of third-party classes",
    "FrontES": "¿Cuándo deberías usar el patrón Clone Factory?",
    "BackES": "Usa Clone Factory cuando:\n- Necesitas clonar objetos polimórficos a través de punteros base\n- Quieres evitar agregar métodos Clone() virtuales a la jerarquía de clases\n- Necesitas lógica de clonación centralizada\n- Quieres clonar objetos sin conocer tipos concretos\n- Necesitas soportar clonación de clases de terceros",
    "Tags": "clonefactory creational applicability use-case creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "What are the key participants in the Clone Factory pattern?",
    "BackEN": "1. **Clone Factory**: Maps type_info to clone functions\n2. **type_info**: Runtime type identifier from typeid operator\n3. **Clone Function**: Takes base pointer, returns cloned object\n4. **Abstract Base**: Base class for cloneable objects\n5. **Concrete Classes**: Specific types registered with clone factory\n6. **Registrar**: Helper for automatic registration",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Clone Factory?",
    "BackES": "1. **Clone Factory**: Mapea type_info a funciones de clonación\n2. **type_info**: Identificador de tipo en tiempo de ejecución del operador typeid\n3. **Función de Clonación**: Toma puntero base, devuelve objeto clonado\n4. **Base Abstracta**: Clase base para objetos clonables\n5. **Clases Concretas**: Tipos específicos registrados con la fábrica de clonación\n6. **Registrador**: Ayudante para registro automático",
    "Tags": "clonefactory creational structure rtti key-concepts creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Clone Factory pattern?",
    "BackEN": "**Benefits:**\n- Clones polymorphic objects without virtual Clone() methods\n- Centralizes cloning logic in one place\n- Can clone third-party classes without modification\n- Separates cloning concerns from class hierarchy\n- Type-safe through RTTI\n\n**Drawbacks:**\n- Requires RTTI (typeid) which some avoid\n- Runtime overhead from map lookup and type_info comparison\n- Requires registration of all cloneable types\n- Potential static initialization order issues\n- Less efficient than virtual Clone() method",
    "FrontES": "¿Cuáles son los beneficios e inconvenientes del patrón Clone Factory?",
    "BackES": "**Beneficios:**\n- Clona objetos polimórficos sin métodos Clone() virtuales\n- Centraliza la lógica de clonación en un lugar\n- Puede clonar clases de terceros sin modificación\n- Separa las preocupaciones de clonación de la jerarquía de clases\n- Seguro en tipos a través de RTTI\n\n**Inconvenientes:**\n- Requiere RTTI (typeid) que algunos evitan\n- Sobrecarga en tiempo de ejecución por búsqueda en mapa y comparación de type_info\n- Requiere registro de todos los tipos clonables\n- Posibles problemas de orden de inicialización estática\n- Menos eficiente que método Clone() virtual",
    "Tags": "clonefactory creational tradeoffs benefits-drawbacks creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "What patterns are related to Clone Factory?",
    "BackEN": "- **Prototype**: Classic pattern using virtual Clone() instead of factory\n- **Object Factory**: Creates new objects (Clone Factory copies existing ones)\n- **Abstract Factory**: Creates families of objects (different creation approach)\n- **Singleton**: Often used to ensure single clone factory instance",
    "FrontES": "¿Qué patrones están relacionados con Clone Factory?",
    "BackES": "- **Prototype**: Patrón clásico usando Clone() virtual en lugar de fábrica\n- **Object Factory**: Crea objetos nuevos (Clone Factory copia existentes)\n- **Abstract Factory**: Crea familias de objetos (enfoque de creación diferente)\n- **Singleton**: A menudo usado para asegurar una única instancia de fábrica de clonación",
    "Tags": "clonefactory creational relatedpatterns related-patterns creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "Show a code example of Clone Factory registration and cloning",
    "BackEN": "```cpp\ntemplate <class Base>\nclass CloneFactory\n{\npublic:\n    template <class Derived>\n    bool Register()\n    {\n        return associations_.insert(\n            typename TypeInfoMap::value_type(\n                typeid(Derived),\n                &CreateConcrete<Derived>)).second;\n    }\n    \n    Base* Clone(const Base* pObj)\n    {\n        typename TypeInfoMap::const_iterator i = \n            associations_.find(typeid(*pObj));\n        if (i != associations_.end())\n            return (i->second)(pObj);\n        return nullptr;\n    }\n    \nprivate:\n    template <class Derived>\n    static Base* CreateConcrete(const Base* pObj)\n    {\n        return new Derived(static_cast<const Derived&>(*pObj));\n    }\n    \n    typedef Base* (*CloneFn)(const Base*);\n    typedef std::map<std::type_info, CloneFn> TypeInfoMap;\n    TypeInfoMap associations_;\n};\n```",
    "FrontES": "Muestra un ejemplo de código de registro y clonación de Clone Factory",
    "BackES": "```cpp\ntemplate <class Base>\nclass CloneFactory\n{\npublic:\n    template <class Derived>\n    bool Register()\n    {\n        return associations_.insert(\n            typename TypeInfoMap::value_type(\n                typeid(Derived),\n                &CreateConcrete<Derived>)).second;\n    }\n    \n    Base* Clone(const Base* pObj)\n    {\n        typename TypeInfoMap::const_iterator i = \n            associations_.find(typeid(*pObj));\n        if (i != associations_.end())\n            return (i->second)(pObj);\n        return nullptr;\n    }\n    \nprivate:\n    template <class Derived>\n    static Base* CreateConcrete(const Base* pObj)\n    {\n        return new Derived(static_cast<const Derived&>(*pObj));\n    }\n    \n    typedef Base* (*CloneFn)(const Base*);\n    typedef std::map<std::type_info, CloneFn> TypeInfoMap;\n    TypeInfoMap associations_;\n};\n```",
    "Tags": "clonefactory creational codeexample cpp rtti code-example creational",
    "Category": "Creational",
    "Page": "180"
  },
  {
    "FrontEN": "What implementation considerations exist for Clone Factory with RTTI?",
    "BackEN": "1. **type_info comparison**: Ensure type_info objects are compared correctly across DLLs\n2. **Registration**: Use static initializers or explicit registration calls\n3. **Copy constructors**: All concrete classes must have accessible copy constructors\n4. **Error handling**: Decide behavior for unregistered types\n5. **Thread safety**: Protect factory if used concurrently\n6. **Polymorphic base**: Base class should have virtual destructor",
    "FrontES": "¿Cuándo deberías usar el patrón Abstract Factory mejorado con typelists?",
    "BackES": "Usa Abstract Factory con typelists cuando:\n- Necesitas crear familias de objetos relacionados\n- Quieres generación automática de métodos de fábrica\n- La familia de productos es conocida en tiempo de compilación\n- Quieres hacer cumplir que todas las fábricas concretas implementen todos los productos\n- Quieres que el compilador detecte métodos Create() faltantes",
    "Tags": "clonefactory creational implementation rtti implementation creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "What real-world examples use the Clone Factory pattern?",
    "BackEN": "- **Document editors**: Clone graphical shapes or document elements\n- **Game development**: Clone game entities without knowing exact types\n- **Undo/Redo systems**: Store clones of objects for state restoration\n- **Prototype-based object systems**: Clone template objects to create new instances\n- **Serialization**: Clone objects during deep copy operations",
    "FrontES": "¿Qué consideraciones de implementación existen para el registro automático de Clone Factory?",
    "BackES": "**Problema:** Necesita registrar tipos antes de usarlos, pero el orden de inicialización estática no está garantizado\n\n**Solución - Registrador Automático:**\n```cpp\ntemplate <class Base, class Derived>\nstruct RegisterClone\n{\n    RegisterClone()\n    {\n        CloneFactory<Base>::Instance().Register<Derived>();\n    }\n};\n\n// En clase derivada:\nclass Circle : public Shape\n{\n    static RegisterClone<Shape, Circle> registrar_;\n};\n```\n\n**Consideraciones:**\n- Usar singleton para fábrica de clonación\n- Variable estática activa el registro\n- Funciona a través de límites de DLL con cuidado",
    "Tags": "clonefactory creational realworld real-world creational",
    "Category": "Creational",
    "Page": "176"
  },
  {
    "FrontEN": "What is the intent of the Abstract Factory pattern (with Typelists)?",
    "BackEN": "To create families of related or dependent objects using compile-time typelists and template metaprogramming. Instead of hardcoding factory methods, use GenScatterHierarchy or GenLinearHierarchy to generate creation methods for all types in a typelist.",
    "FrontES": "¿Qué consideraciones de implementación existen para el registro automático de Clone Factory?",
    "BackES": "**Problema:** Necesita registrar tipos antes de usarlos, pero el orden de inicialización estática no está garantizado\n\n**Solución - Registrador Automático:**\n```cpp\ntemplate <class Base, class Derived>\nstruct RegisterClone\n{\n    RegisterClone()\n    {\n        CloneFactory<Base>::Instance().Register<Derived>();\n    }\n};\n\n// En clase derivada:\nclass Circle : public Shape\n{\n    static RegisterClone<Shape, Circle> registrar_;\n};\n```\n\n**Consideraciones:**\n- Usar singleton para fábrica de clonación\n- Variable estática activa el registro\n- Funciona a través de límites de DLL con cuidado",
    "Tags": "abstractfactory creational typelists templatemetaprogramming intent creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "When should you use the Abstract Factory pattern with Typelists?",
    "BackEN": "Use Abstract Factory with Typelists when:\n- You need to create families of related objects\n- The set of product types is known at compile time\n- You want to avoid hardcoding individual factory methods\n- You need compile-time generation of factory interface\n- You want type safety for product families\n- You need to switch between entire product families",
    "FrontES": "¿Cuál es la intención del patrón Abstract Factory mejorado con typelists?",
    "BackES": "Generar automáticamente fábricas que crean familias de objetos relacionados usando programación de typelists. El patrón usa GenScatterHierarchy para generar métodos Create() para cada tipo de producto en el typelist, haciendo cumplir las familias de productos en tiempo de compilación.",
    "Tags": "abstractfactory creational applicability typelists use-case creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "What are the key participants in the Abstract Factory pattern with Typelists?",
    "BackEN": "1. **Abstract Factory**: Base class generated from typelist\n2. **Concrete Factories**: Implement creation for specific product families\n3. **Typelist**: Compile-time list of product types to create\n4. **GenScatterHierarchy**: Generates scattered hierarchy with Create<T>() methods\n5. **GenLinearHierarchy**: Alternative linear hierarchy generation\n6. **Product families**: Sets of related concrete products",
    "FrontES": "¿Qué consideraciones de implementación existen para Clone Factory con RTTI?",
    "BackES": "1. **Comparación de type_info**: Asegurar que los objetos type_info se comparan correctamente a través de DLLs\n2. **Registro**: Usar inicializadores estáticos o llamadas de registro explícitas\n3. **Constructores de copia**: Todas las clases concretas deben tener constructores de copia accesibles\n4. **Manejo de errores**: Decidir comportamiento para tipos no registrados\n5. **Seguridad de hilos**: Proteger fábrica si se usa concurrentemente\n6. **Base polimórfica**: La clase base debe tener destructor virtual",
    "Tags": "abstractfactory creational structure typelists key-concepts creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Abstract Factory pattern with Typelists?",
    "BackEN": "**Benefits:**\n- Compile-time generation eliminates boilerplate factory methods\n- Type-safe product creation\n- Easy to add new product types (modify typelist)\n- Enforces consistency across product families\n- Compiler catches missing product implementations\n\n**Drawbacks:**\n- Complex template metaprogramming required\n- Steep learning curve for typelists\n- Cryptic compiler errors\n- Requires all product types known at compile time\n- Cannot dynamically add product types at runtime",
    "FrontES": "¿Cuáles son los beneficios e inconvenientes del patrón Abstract Factory con typelists?",
    "BackES": "**Beneficios:**\n- Generación automática de interfaz de fábrica mediante typelists\n- El compilador hace cumplir la implementación completa\n- Agregar tipo de producto actualiza automáticamente todas las fábricas\n- Seguridad de tipos en tiempo de compilación\n- Reduce código repetitivo\n\n**Inconvenientes:**\n- Metaprogramación de plantillas compleja\n- Mensajes de error del compilador difíciles\n- Curva de aprendizaje pronunciada\n- Tiempo de compilación aumentado\n- Dificulta agregar productos en tiempo de ejecución",
    "Tags": "abstractfactory creational tradeoffs typelists benefits-drawbacks creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "What patterns are related to Abstract Factory with Typelists?",
    "BackEN": "- **Factory Method**: Abstract Factory uses Factory Methods for each product\n- **Prototype**: Alternative approach using cloning instead of creation\n- **Singleton**: Factories often implemented as singletons\n- **Object Factory**: Runtime polymorphic factory (vs compile-time Abstract Factory)",
    "FrontES": "¿Qué patrones están relacionados con Abstract Factory con Typelists?",
    "BackES": "- **Factory Method**: Abstract Factory usa Factory Methods para cada producto\n- **Prototype**: Enfoque alternativo usando clonación en lugar de creación\n- **Singleton**: Las fábricas a menudo se implementan como singletons\n- **Object Factory**: Fábrica polimórfica en tiempo de ejecución (vs Abstract Factory en tiempo de compilación)",
    "Tags": "abstractfactory creational relatedpatterns related-patterns creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "Show a code example of Abstract Factory using GenScatterHierarchy",
    "BackEN": "```cpp\n// Define product types\nclass Button;\nclass ScrollBar;\nclass Menu;\n\n// Typelist of products\ntypedef TYPELIST_3(Button, ScrollBar, Menu) WidgetList;\n\n// Unit for factory\ntemplate <class T>\nstruct FactoryUnit\n{\n    virtual T* Create() = 0;\n};\n\n// Generate abstract factory from typelist\ntemplate <class TList>\nclass AbstractWidgetFactory \n    : public GenScatterHierarchy<TList, FactoryUnit>\n{\n};\n\n// Concrete factory\nclass WindowsFactory : public AbstractWidgetFactory<WidgetList>\n{\npublic:\n    Button* Create() { return new WindowsButton; }\n    ScrollBar* Create() { return new WindowsScrollBar; }\n    Menu* Create() { return new WindowsMenu; }\n};\n\n// Usage\nAbstractWidgetFactory<WidgetList>* factory = new WindowsFactory;\nButton* btn = factory->Create<Button>();\n```",
    "FrontES": "Muestra un ejemplo de código de Abstract Factory usando GenScatterHierarchy",
    "BackES": "```cpp\n// Definir tipos de productos\nclass Button;\nclass ScrollBar;\nclass Menu;\n\n// Typelist de productos\ntypedef TYPELIST_3(Button, ScrollBar, Menu) WidgetList;\n\n// Unit para fábrica\ntemplate <class T>\nstruct FactoryUnit\n{\n    virtual T* Create() = 0;\n};\n\n// Generar fábrica abstracta desde typelist\ntemplate <class TList>\nclass AbstractWidgetFactory \n    : public GenScatterHierarchy<TList, FactoryUnit>\n{\n};\n\n// Fábrica concreta\nclass WindowsFactory : public AbstractWidgetFactory<WidgetList>\n{\npublic:\n    Button* Create() { return new WindowsButton; }\n    ScrollBar* Create() { return new WindowsScrollBar; }\n    Menu* Create() { return new WindowsMenu; }\n};\n\n// Uso\nAbstractWidgetFactory<WidgetList>* factory = new WindowsFactory;\nButton* btn = factory->Create<Button>();\n```",
    "Tags": "abstractfactory creational codeexample cpp typelists code-example creational",
    "Category": "Creational",
    "Page": "190"
  },
  {
    "FrontEN": "What implementation considerations exist for Abstract Factory with Typelists?",
    "BackEN": "1. **Hierarchy generation**: Choose GenScatterHierarchy vs GenLinearHierarchy\n2. **Type uniqueness**: Typelist should not have duplicate types\n3. **Return types**: Consider using smart pointers instead of raw pointers\n4. **Error handling**: Handle creation failures appropriately\n5. **Covariant returns**: Concrete factories can return more specific types\n6. **Factory lifetime**: Decide on factory ownership (singleton, passed dependency, etc.)",
    "FrontES": "¿Qué consideraciones de implementación existen para Abstract Factory con Typelists?",
    "BackES": "1. **Generación de jerarquía**: Elegir GenScatterHierarchy vs GenLinearHierarchy\n2. **Unicidad de tipos**: El typelist no debe tener tipos duplicados\n3. **Tipos de retorno**: Considerar usar punteros inteligentes en lugar de punteros sin procesar\n4. **Manejo de errores**: Manejar fallos de creación apropiadamente\n5. **Retornos covariantes**: Las fábricas concretas pueden devolver tipos más específicos\n6. **Tiempo de vida de fábrica**: Decidir sobre propiedad de fábrica (singleton, dependencia pasada, etc.)",
    "Tags": "abstractfactory creational implementation typelists implementation creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "What real-world examples use the Abstract Factory pattern?",
    "BackEN": "- **GUI toolkits**: Create platform-specific widgets (Windows, Mac, Linux)\n- **Game engines**: Create themed sets of game assets (Medieval, SciFi, Fantasy)\n- **Database drivers**: Create database-specific connections, commands, transactions\n- **Document formats**: Create formatters for different output types (PDF, HTML, XML)\n- **Testing frameworks**: Create mock vs real implementations of service families",
    "FrontES": "¿Qué ejemplos del mundo real usan el patrón Abstract Factory?",
    "BackES": "- **Kits de herramientas GUI**: Crear widgets específicos de plataforma (Windows, Mac, Linux)\n- **Motores de juegos**: Crear conjuntos temáticos de activos de juego (Medieval, SciFi, Fantasy)\n- **Drivers de base de datos**: Crear conexiones, comandos, transacciones específicas de base de datos\n- **Generadores de documentos**: Crear formateadores para diferentes tipos de salida (PDF, HTML, XML)\n- **Frameworks de pruebas**: Crear implementaciones mock vs reales de familias de servicios",
    "Tags": "abstractfactory creational realworld real-world creational",
    "Category": "Creational",
    "Page": "184"
  },
  {
    "FrontEN": "What is the intent of the Visitor pattern?",
    "BackEN": "To represent an operation to be performed on elements of an object structure without changing the element classes. Visitor uses double dispatch to select both the element type and operation, allowing new operations to be added without modifying the element hierarchy.",
    "FrontES": "¿Cuál es la intención del patrón Visitor?",
    "BackES": "Representar una operación a realizar en elementos de una estructura de objetos sin cambiar las clases de elementos. Visitor usa doble despacho para seleccionar tanto el tipo de elemento como la operación, permitiendo agregar nuevas operaciones sin modificar la jerarquía de elementos.",
    "Tags": "visitor behavioral doubledispatch intent behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "When should you use the Visitor pattern?",
    "BackEN": "Use Visitor when:\n- You need to perform operations across a stable class hierarchy\n- You want to add new operations without modifying existing classes\n- Operations are unrelated to the element classes' core responsibilities\n- The object structure contains many classes with different interfaces\n- You need to accumulate state while traversing a structure\n- The class hierarchy is stable (new classes rarely added)",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Abstract Factory mejorado con typelists?",
    "BackES": "1. **Typelist**: Lista de tipos de productos en tiempo de compilación\n2. **GenScatterHierarchy**: Generador de metaprogramación que crea herencia múltiple\n3. **FactoryUnit**: Plantilla que proporciona interfaz Create() para cada tipo\n4. **AbstractFactory**: Clase generada con métodos Create() virtuales\n5. **ConcreteFactory**: Implementa todos los métodos Create() para familia específica\n6. **Product Types**: Tipos en el typelist (Button, Menu, etc.)",
    "Tags": "visitor behavioral applicability use-case behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What are the key participants in the Visitor pattern?",
    "BackEN": "1. **Visitor**: Interface declaring Visit() methods for each element type\n2. **Concrete Visitors**: Implement operations for each element type\n3. **Element**: Interface with Accept(Visitor&) method\n4. **Concrete Elements**: Implement Accept() to dispatch to correct Visit()\n5. **Object Structure**: Collection of elements to visit\n6. **Double Dispatch**: Two virtual calls to select operation and type",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Visitor?",
    "BackES": "1. **Visitor**: Interfaz que declara métodos Visit() para cada tipo de elemento concreto\n2. **Visitantes Concretos**: Implementan operaciones específicas para cada tipo de elemento\n3. **Element**: Interfaz con método Accept(Visitor&)\n4. **Elementos Concretos**: Implementan Accept() llamando a visitor.Visit(*this)\n5. **Estructura de Objetos**: Colección de elementos que pueden ser visitados\n6. **Doble Despacho**: Dos llamadas virtuales para seleccionar operación y tipo",
    "Tags": "visitor behavioral structure doubledispatch key-concepts behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Visitor pattern?",
    "BackEN": "**Benefits:**\n- Easy to add new operations (create new Visitor)\n- Groups related operations in one class\n- Visitor can accumulate state during traversal\n- Separates algorithm from object structure\n- Supports operations across heterogeneous collections\n\n**Drawbacks:**\n- Hard to add new element types (all Visitors must change)\n- Breaks encapsulation (Visitor needs access to element internals)\n- Circular dependency between Visitor and Element interfaces\n- Double dispatch overhead\n- Requires stable class hierarchy",
    "FrontES": "¿Qué ejemplos del mundo real usan el patrón Clone Factory?",
    "BackES": "- **Editores gráficos**: Clonar formas/objetos seleccionados sin conocer tipos\n- **Sistemas de simulación**: Copiar entidades complejas en escenarios de simulación\n- **Sistemas de documentos**: Copiar elementos de documento durante operaciones de copiar/pegar\n- **Motores de juegos**: Clonar entidades de juego para instanciación\n- **Frameworks de comandos**: Clonar objetos de comando para funcionalidad de deshacer/rehacer",
    "Tags": "visitor behavioral tradeoffs benefits-drawbacks behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What patterns are related to Visitor?",
    "BackEN": "- **Composite**: Visitor often traverses Composite structures\n- **Iterator**: Used to traverse object structure before visiting\n- **Interpreter**: AST nodes often use Visitor for operations\n- **Strategy**: Visitor is like Strategy but for multiple types\n- **Command**: Alternative for encapsulating operations",
    "FrontES": "¿Qué patrones están relacionados con Visitor?",
    "BackES": "- **Composite**: Visitor a menudo recorre estructuras Composite\n- **Iterator**: Usado para recorrer la estructura de objetos antes de visitar\n- **Interpreter**: Los nodos AST a menudo usan Visitor para operaciones\n- **Strategy**: Visitor es como Strategy pero para múltiples tipos\n- **Command**: Alternativa para encapsular operaciones",
    "Tags": "visitor behavioral relatedpatterns related-patterns behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "Show a code example of the classic Visitor pattern with double dispatch",
    "BackEN": "```cpp\n// Forward declarations\nclass ConcreteElementA;\nclass ConcreteElementB;\n\n// Visitor interface\nclass Visitor\n{\npublic:\n    virtual void Visit(ConcreteElementA& elem) = 0;\n    virtual void Visit(ConcreteElementB& elem) = 0;\n};\n\n// Element interface\nclass Element\n{\npublic:\n    virtual void Accept(Visitor& v) = 0;\n};\n\n// Concrete elements\nclass ConcreteElementA : public Element\n{\npublic:\n    void Accept(Visitor& v) override { v.Visit(*this); }\n    void OperationA() { /* ... */ }\n};\n\nclass ConcreteElementB : public Element\n{\npublic:\n    void Accept(Visitor& v) override { v.Visit(*this); }\n    void OperationB() { /* ... */ }\n};\n\n// Concrete visitor\nclass ConcreteVisitor : public Visitor\n{\npublic:\n    void Visit(ConcreteElementA& elem) override {\n        elem.OperationA();\n        // Operation-specific logic\n    }\n    void Visit(ConcreteElementB& elem) override {\n        elem.OperationB();\n        // Operation-specific logic\n    }\n};\n```",
    "FrontES": "¿Qué es un Visitor Acíclico y cómo resuelve las dependencias circulares?",
    "BackES": "**Problema:** Visitor tradicional crea dependencias circulares (Element incluye Visitor, Visitor incluye Element)\n\n**Solución Acíclica:**\n1. **BaseVisitor**: Interfaz vacía común para todos los visitantes\n2. **Visitor<T>**: Plantilla con Visit(T&) para tipo específico\n3. **Element::Accept()**: Usa dynamic_cast para verificar si el visitante puede manejar este tipo\n\n```cpp\nclass BaseVisitor {};\n\ntemplate <class T>\nclass Visitor {\npublic:\n    virtual void Visit(T&) = 0;\n};\n\nvoid Circle::Accept(BaseVisitor& v) {\n    if (Visitor<Circle>* p = dynamic_cast<Visitor<Circle>*>(&v))\n        p->Visit(*this);\n}\n```\n\n**Ventaja:** Sin dependencias circulares\n**Desventaja:** Sobrecarga de RTTI dynamic_cast",
    "Tags": "visitor behavioral codeexample cpp doubledispatch code-example behavioral",
    "Category": "Behavioral",
    "Page": "196"
  },
  {
    "FrontEN": "What implementation considerations exist for the Visitor pattern?",
    "BackEN": "1. **Forward declarations**: Visitor and Element headers need careful organization\n2. **Return types**: Visit() can return values (requires consistent return type)\n3. **Traversal responsibility**: Decide if Visitor or Element traverses structure\n4. **State accumulation**: Visitor can maintain state across visits\n5. **Const correctness**: Separate const and non-const Visitor interfaces\n6. **Cyclic visitors**: Use typelists to generate Visit() methods automatically",
    "FrontES": "¿Qué consideraciones de implementación existen para el patrón Visitor?",
    "BackES": "1. **Declaraciones adelantadas**: Los headers de Visitor y Element necesitan organización cuidadosa\n2. **Tipos de retorno**: Visit() puede devolver valores (requiere tipo de retorno consistente)\n3. **Responsabilidad de recorrido**: Decidir si Visitor o Element recorre la estructura\n4. **Acumulación de estado**: El visitante puede mantener estado a través de visitas\n5. **Corrección const**: Interfaces Visitor const y no const separadas\n6. **Visitantes cíclicos**: Usar typelists para generar métodos Visit() automáticamente",
    "Tags": "visitor behavioral implementation implementation behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What real-world examples use the Visitor pattern?",
    "BackEN": "- **Compilers**: AST traversal for type checking, code generation, optimization\n- **Document processing**: Operations on document elements (rendering, exporting, validation)\n- **CAD systems**: Operations on geometric shapes (rendering, area calculation, hit testing)\n- **File systems**: Operations on files/directories (search, size calculation, permissions)\n- **Game engines**: Operations on scene graph nodes (rendering, collision detection, serialization)",
    "FrontES": "¿Qué ejemplos del mundo real usan el patrón Visitor?",
    "BackES": "- **Compiladores**: Recorrido de AST para verificación de tipos, generación de código, optimización\n- **Procesamiento de documentos**: Operaciones en elementos del documento (renderizado, exportación, validación)\n- **Sistemas CAD**: Operaciones en formas geométricas (renderizado, cálculo de área, prueba de colisión)\n- **Sistemas de archivos**: Operaciones en archivos/directorios (búsqueda, cálculo de tamaño, permisos)\n- **Motores de juegos**: Operaciones en nodos del grafo de escena (renderizado, detección de colisiones, serialización)",
    "Tags": "visitor behavioral realworld real-world behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What is Policy-Based Design?",
    "BackEN": "A design technique using template parameters to inject different behaviors (policies) into a class. Each policy controls one aspect of the class's behavior. This provides compile-time customization without runtime overhead.\n\nExample: SmartPtr uses Storage, Ownership, Conversion, and Checking policies to customize pointer behavior.",
    "FrontES": "¿Qué es el Diseño Basado en Políticas?",
    "BackES": "Una técnica de diseño que usa parámetros de plantilla para inyectar diferentes comportamientos (políticas) en una clase. Cada política controla un aspecto del comportamiento de la clase. Esto proporciona personalización en tiempo de compilación sin sobrecarga en tiempo de ejecución.\n\nEjemplo: SmartPtr usa políticas de Almacenamiento, Propiedad, Conversión y Verificación para personalizar el comportamiento del puntero.",
    "Tags": "policybaseddesign crosscutting templatemetaprogramming cpp cross-cutting",
    "Category": "Cross-Cutting",
    "Page": "154"
  },
  {
    "FrontEN": "What is Double Dispatch and how does it work?",
    "BackEN": "A technique using two virtual function calls to select behavior based on both the runtime type of an object AND the operation being performed.\n\nIn Visitor:\n1. First dispatch: element->Accept(visitor) calls virtual Accept()\n2. Second dispatch: visitor.Visit(*this) calls virtual Visit()\n\nThis allows selecting the right Visit() method based on both element type and visitor type.",
    "FrontES": "¿Qué es el Doble Despacho y cómo funciona?",
    "BackES": "Una técnica que usa dos llamadas a funciones virtuales para seleccionar el comportamiento basándose tanto en el tipo en tiempo de ejecución de un objeto COMO en la operación que se está realizando.\n\nEn Visitor:\n1. Primer despacho: element->Accept(visitor) llama a Accept() virtual\n2. Segundo despacho: visitor.Visit(*this) llama a Visit() virtual\n\nEsto permite seleccionar el método Visit() correcto basándose tanto en el tipo de elemento como en el tipo de visitante.",
    "Tags": "doubledispatch crosscutting visitor polymorphism cross-cutting behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What are Covariant Return Types in C++?",
    "BackEN": "The ability to override a virtual function with a more specific (derived) return type.\n\nExample:\n```cpp\nclass Base {\n    virtual Base* Clone();\n};\n\nclass Derived : public Base {\n    Derived* Clone() override; // Covariant return\n};\n```\n\nUseful in factories and clone methods where derived classes return more specific types. Improves type safety by avoiding downcasts.",
    "FrontES": "¿Qué son los Tipos de Retorno Covariantes en C++?",
    "BackES": "La capacidad de sobrescribir una función virtual con un tipo de retorno más específico (derivado).\n\nEjemplo:\n```cpp\nclass Base {\n    virtual Base* Clone();\n};\n\nclass Derived : public Base {\n    Derived* Clone() override; // Retorno covariante\n};\n```\n\nÚtil en fábricas y métodos de clonación donde las clases derivadas devuelven tipos más específicos. Mejora la seguridad de tipos al evitar downcasts.",
    "Tags": "covariantreturntypes crosscutting cpp virtualfunctions cross-cutting",
    "Category": "Cross-Cutting",
    "Page": "176"
  },
  {
    "FrontEN": "What are Type Identifiers and what are the three main approaches?",
    "BackEN": "Runtime representations of types used to identify objects without compile-time knowledge.\n\n**Three approaches:**\n1. **String identifiers**: Human-readable (\"Button\"), serializable, slower lookup\n2. **Integer identifiers**: Fast lookup, compact, requires manual assignment\n3. **type_info (RTTI)**: Type-safe, automatic from typeid(), not serializable\n\nUsed in Object Factory, Clone Factory, and runtime type systems.",
    "FrontES": "¿Qué son los Identificadores de Tipo y cuáles son los tres enfoques principales?",
    "BackES": "Representaciones en tiempo de ejecución de tipos usadas para identificar objetos sin conocimiento en tiempo de compilación.\n\n**Tres enfoques:**\n1. **Identificadores de cadena**: Legibles por humanos (\"Button\"), serializables, búsqueda más lenta\n2. **Identificadores enteros**: Búsqueda rápida, compactos, requieren asignación manual\n3. **type_info (RTTI)**: Seguro en tipos, automático desde typeid(), no serializable\n\nUsados en Object Factory, Clone Factory y sistemas de tipos en tiempo de ejecución.",
    "Tags": "typeidentifiers crosscutting rtti objectfactory cross-cutting creational",
    "Category": "Creational",
    "Page": "166"
  },
  {
    "FrontEN": "What is Typelist Programming?",
    "BackEN": "Compile-time manipulation of type lists using template metaprogramming. Typelists allow generic algorithms on types.\n\nKey operations:\n- **Length**: Count types in list\n- **TypeAt**: Access type at index\n- **Append**: Add type to list\n- **IndexOf**: Find type's position\n\nUsed with GenScatterHierarchy/GenLinearHierarchy to generate code for each type in list. Enables Abstract Factory to automatically generate Create() methods for all product types.",
    "FrontES": "¿Qué es la Programación de Typelists?",
    "BackES": "Manipulación en tiempo de compilación de listas de tipos usando metaprogramación de plantillas. Las typelists permiten algoritmos genéricos sobre tipos.\n\nOperaciones clave:\n- **Length**: Contar tipos en la lista\n- **TypeAt**: Acceder al tipo en el índice\n- **Append**: Agregar tipo a la lista\n- **IndexOf**: Encontrar posición del tipo\n\nUsadas con GenScatterHierarchy/GenLinearHierarchy para generar código para cada tipo en la lista. Permite a Abstract Factory generar automáticamente métodos Create() para todos los tipos de productos.",
    "Tags": "typelistprogramming crosscutting templatemetaprogramming cpp cross-cutting",
    "Category": "Cross-Cutting",
    "Page": "184"
  },
  {
    "FrontEN": "How does Policy-Based Design provide compile-time flexibility?",
    "BackEN": "**Mechanism:**\nPolicies are template parameters that define interfaces (required methods/types). Different policy implementations provide different behaviors.\n\n**Example from SmartPtr:**\n```cpp\ntemplate <class T, \n          class OwnershipPolicy,\n          class ConversionPolicy>\nclass SmartPtr : public OwnershipPolicy,\n                 public ConversionPolicy\n{\n    // Uses policy methods\n};\n\n// Different configurations\nSmartPtr<int, RefCounted, AllowConversion> sp1;\nSmartPtr<int, DestructiveCopy, DisallowConversion> sp2;\n```\n\n**Benefits:** Zero runtime overhead, infinite customization, compiler validates policy compatibility.",
    "FrontES": "¿Cómo proporciona el Diseño Basado en Políticas flexibilidad en tiempo de compilación?",
    "BackES": "**Mecanismo:**\nLas políticas son parámetros de plantilla que definen interfaces (métodos/tipos requeridos). Diferentes implementaciones de políticas proporcionan diferentes comportamientos.\n\n**Ejemplo de SmartPtr:**\n```cpp\ntemplate <class T, \n          class OwnershipPolicy,\n          class ConversionPolicy>\nclass SmartPtr : public OwnershipPolicy,\n                 public ConversionPolicy\n{\n    // Usa métodos de políticas\n};\n\n// Diferentes configuraciones\nSmartPtr<int, RefCounted, AllowConversion> sp1;\nSmartPtr<int, DestructiveCopy, DisallowConversion> sp2;\n```\n\n**Beneficios:** Cero sobrecarga en tiempo de ejecución, personalización infinita, el compilador valida compatibilidad de políticas.",
    "Tags": "policybaseddesign crosscutting implementation templatemetaprogramming cross-cutting",
    "Category": "Cross-Cutting",
    "Page": "154"
  },
  {
    "FrontEN": "Why is Double Dispatch necessary and what problem does it solve?",
    "BackEN": "**Problem:** Single dispatch (virtual functions) only considers receiver type, not argument types.\n\n**Example Need:** In Visitor, we need to select behavior based on:\n- Element type (Circle, Rectangle, etc.)\n- Visitor type (RenderVisitor, ExportVisitor, etc.)\n\n**Solution:** Two virtual calls:\n1. `element->Accept(visitor)` - dispatches on element type\n2. `visitor.Visit(*this)` - dispatches on visitor type\n\nWithout double dispatch, you'd need dynamic_cast or if/else chains to determine types.",
    "FrontES": "¿Por qué es necesario el Doble Despacho y qué problema resuelve?",
    "BackES": "**Problema:** El despacho simple (funciones virtuales) solo considera el tipo del receptor, no los tipos de argumentos.\n\n**Ejemplo de necesidad:** En Visitor, necesitamos seleccionar el comportamiento basándonos en:\n- Tipo de elemento (Circle, Rectangle, etc.)\n- Tipo de visitante (RenderVisitor, ExportVisitor, etc.)\n\n**Solución:** Dos llamadas virtuales:\n1. `element->Accept(visitor)` - despacha en tipo de elemento\n2. `visitor.Visit(*this)` - despacha en tipo de visitante\n\nSin doble despacho, necesitarías dynamic_cast o cadenas if/else para determinar tipos.",
    "Tags": "doubledispatch crosscutting problemsolving visitor cross-cutting behavioral",
    "Category": "Behavioral",
    "Page": "194"
  },
  {
    "FrontEN": "What are the trade-offs between different Type Identifier approaches?",
    "BackEN": "**String Identifiers:**\n- ✓ Human-readable, serializable, cross-platform\n- ✗ Slower map lookup, larger memory, typo-prone\n\n**Integer Identifiers:**\n- ✓ Fast lookup, compact, efficient\n- ✗ Manual assignment, not self-documenting, collision risk\n\n**type_info (RTTI):**\n- ✓ Type-safe, automatic, compiler-generated\n- ✗ Not serializable, RTTI overhead, DLL issues\n\n**Recommendation:** Use type_info for internal systems, strings for serialization/config, integers for performance-critical code.",
    "FrontES": "¿Cuáles son las compensaciones entre diferentes enfoques de Identificador de Tipo?",
    "BackES": "**Identificadores de Cadena:**\n- ✓ Legibles por humanos, serializables, multiplataforma\n- ✗ Búsqueda en mapa más lenta, mayor memoria, propenso a errores tipográficos\n\n**Identificadores Enteros:**\n- ✓ Búsqueda rápida, compactos, eficientes\n- ✗ Asignación manual, no autodocumentado, riesgo de colisión\n\n**type_info (RTTI):**\n- ✓ Seguro en tipos, automático, generado por compilador\n- ✗ No serializable, sobrecarga de RTTI, problemas con DLL\n\n**Recomendación:** Usa type_info para sistemas internos, cadenas para serialización/configuración, enteros para código crítico en rendimiento.",
    "Tags": "typeidentifiers crosscutting tradeoffs implementation cross-cutting",
    "Category": "Cross-Cutting",
    "Page": "166"
  },
  {
    "FrontEN": "How does GenScatterHierarchy work with Typelists to generate Abstract Factories?",
    "BackEN": "**Mechanism:**\n1. Given typelist: `TYPELIST_3(Button, Menu, ScrollBar)`\n2. GenScatterHierarchy generates multiple inheritance:\n   ```cpp\n   class Factory : public FactoryUnit<Button>,\n                   public FactoryUnit<Menu>,\n                   public FactoryUnit<ScrollBar>\n   ```\n3. Each FactoryUnit provides `virtual T* Create()`\n4. Concrete factory implements all Create() methods\n\n**Advantage:** Add type to typelist → compiler automatically requires Create() implementation. No manual method writing needed.",
    "FrontES": "¿Cómo funciona GenScatterHierarchy con Typelists para generar Abstract Factories?",
    "BackES": "**Mecanismo:**\n1. Dado typelist: `TYPELIST_3(Button, Menu, ScrollBar)`\n2. GenScatterHierarchy genera herencia múltiple:\n   ```cpp\n   class Factory : public FactoryUnit<Button>,\n                   public FactoryUnit<Menu>,\n                   public FactoryUnit<ScrollBar>\n   ```\n3. Cada FactoryUnit proporciona `virtual T* Create()`\n4. La fábrica concreta implementa todos los métodos Create()\n\n**Ventaja:** Agregar tipo al typelist → el compilador automáticamente requiere implementación de Create(). No se necesita escritura manual de métodos.",
    "Tags": "typelistprogramming crosscutting abstractfactory genscatterhierarchy cross-cutting creational",
    "Category": "Creational",
    "Page": "184"
  },

  {
    "FrontEN": "What is the intent of the Visitor pattern?",
    "BackEN": "Allow adding operations to a class hierarchy without modifying the classes in that hierarchy. Transform classes into functions by bouncing back from the visited hierarchy to the visitor hierarchy.",
    "FrontES": "¿Cuál es la intención del patrón Visitor?",
    "BackES": "Permitir agregar operaciones a una jerarquía de clases sin modificar las clases en esa jerarquía. Transformar clases en funciones rebotando desde la jerarquía visitada a la jerarquía de visitantes.",
    "Tags": "intent visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "When would you use the Visitor pattern?",
    "BackEN": "• When you have a stable class hierarchy that rarely changes\n• When you need to add many operations to a hierarchy without modifying the classes\n• When you want to separate algorithms from the data structures they operate on\n• When operations need to work on objects of different types in a hierarchy",
    "FrontES": "¿Cuándo usarías el patrón Visitor?",
    "BackES": "• Cuando tienes una jerarquía de clases estable que rara vez cambia\n• Cuando necesitas agregar muchas operaciones a una jerarquía sin modificar las clases\n• Cuando quieres separar algoritmos de las estructuras de datos sobre las que operan\n• Cuando las operaciones necesitan trabajar sobre objetos de diferentes tipos en una jerarquía",
    "Tags": "use-case visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "What are the key participants in the Visitor pattern?",
    "BackEN": "• BaseVisitor: Strawman base class for the visitor hierarchy, provides RTTI capabilities\n• Visitor<T>: Template class that defines a pure virtual Visit function for type T\n• BaseVisitable: Base class for visitable hierarchy, declares pure virtual Accept function\n• ConcreteVisitable: Derived classes in the visited hierarchy, implement Accept to bounce to visitor\n• ConcreteVisitor: Derives from BaseVisitor and multiple Visitor<T> instantiations, implements Visit for each type",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Visitor?",
    "BackES": "• BaseVisitor: Clase base ficticia para la jerarquía de visitantes, proporciona capacidades RTTI\n• Visitor<T>: Clase plantilla que define una función Visit virtual pura para el tipo T\n• BaseVisitable: Clase base para la jerarquía visitable, declara función Accept virtual pura\n• ConcreteVisitable: Clases derivadas en la jerarquía visitada, implementan Accept para rebotar al visitante\n• ConcreteVisitor: Deriva de BaseVisitor y múltiples instanciaciones de Visitor<T>, implementa Visit para cada tipo",
    "Tags": "key-concepts visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Visitor pattern?",
    "BackEN": "Benefits:\n• Easy to add new operations without modifying existing classes\n• Operations are grouped together in visitor classes\n• Can accumulate state as visiting progresses\n• Can visit objects in different hierarchies in one visitor\n\nDrawbacks:\n• Hard to add new classes to the visited hierarchy\n• Breaks encapsulation by requiring public access to visited objects' internals\n• Circular dependencies between visitor and visited hierarchies\n• Complex to implement and maintain\n• Controversial pattern - considered problematic by some GoF members",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Visitor?",
    "BackES": "Beneficios:\n• Fácil agregar nuevas operaciones sin modificar clases existentes\n• Las operaciones se agrupan en clases visitantes\n• Puede acumular estado a medida que avanza la visita\n• Puede visitar objetos en diferentes jerarquías en un visitante\n\nDesventajas:\n• Difícil agregar nuevas clases a la jerarquía visitada\n• Rompe la encapsulación al requerir acceso público a los internos de los objetos visitados\n• Dependencias circulares entre jerarquías de visitante y visitado\n• Complejo de implementar y mantener\n• Patrón controvertido - considerado problemático por algunos miembros de GoF",
    "Tags": "benefits-drawbacks visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "What patterns are related to the Visitor pattern?",
    "BackEN": "• Acyclic Visitor: Variant that eliminates cyclic dependencies using dynamic_cast at runtime\n• Composite: Often used together - Visitor can traverse Composite structures\n• Iterator: Both traverse structures, but Visitor applies operations while Iterator just accesses",
    "FrontES": "¿Qué patrones están relacionados con el patrón Visitor?",
    "BackES": "• Acyclic Visitor: Variante que elimina dependencias cíclicas usando dynamic_cast en tiempo de ejecución\n• Composite: A menudo se usan juntos - Visitor puede recorrer estructuras Composite\n• Iterator: Ambos recorren estructuras, pero Visitor aplica operaciones mientras Iterator solo accede",
    "Tags": "related-patterns visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "What are key implementation considerations for the Visitor pattern?",
    "BackEN": "• Use DEFINE_VISITABLE() macro to inject Accept implementation into visited classes\n• AcceptImpl is a template function that captures the static type of *this\n• Can use overloading with Visit name instead of VisitTypeName for cleaner syntax\n• Must use dynamic_cast in correct order (most derived first) to handle inheritance properly\n• Can implement catch-all Visit(BaseType&) to handle unknown derived types\n• Use CatchAll policy to customize behavior when visitor doesn't match visited type",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Visitor?",
    "BackES": "• Usar macro DEFINE_VISITABLE() para inyectar implementación Accept en clases visitadas\n• AcceptImpl es una función plantilla que captura el tipo estático de *this\n• Puede usar sobrecarga con nombre Visit en lugar de VisitTypeName para sintaxis más limpia\n• Debe usar dynamic_cast en orden correcto (más derivado primero) para manejar herencia apropiadamente\n• Puede implementar Visit(BaseType&) genérico para manejar tipos derivados desconocidos\n• Usar política CatchAll para personalizar comportamiento cuando visitante no coincide con tipo visitado",
    "Tags": "implementation visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "What are real-world examples of the Visitor pattern?",
    "BackEN": "• Compiler AST traversal for code generation, optimization, type checking\n• Document object model operations (counting elements, rendering, exporting)\n• Scene graph operations in graphics engines\n• File system traversal with type-specific operations",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Visitor?",
    "BackES": "• Recorrido de AST de compilador para generación de código, optimización, verificación de tipos\n• Operaciones de modelo de objetos de documento (contar elementos, renderizar, exportar)\n• Operaciones de grafo de escena en motores gráficos\n• Recorrido de sistema de archivos con operaciones específicas por tipo",
    "Tags": "real-world visitor behavioral",
    "Category": "Behavioral",
    "Page": "210"
  },
  {
    "FrontEN": "```cpp\nclass BaseVisitor\n{\npublic:\n    virtual ~BaseVisitor() {}\n};\n\ntemplate <class T, typename R = void>\nclass Visitor\n{\npublic:\n    typedef R ReturnType;\n    virtual ReturnType Visit(T&) = 0;\n};\n```\nWhat pattern does this code implement?",
    "BackEN": "Pattern: Visitor Pattern\nKey elements: BaseVisitor provides RTTI anchor with virtual destructor, Visitor<T> template defines visit operation for type T with customizable return type",
    "FrontES": "```cpp\nclass BaseVisitor\n{\npublic:\n    virtual ~BaseVisitor() {}\n};\n\ntemplate <class T, typename R = void>\nclass Visitor\n{\npublic:\n    typedef R ReturnType;\n    virtual ReturnType Visit(T&) = 0;\n};\n```\n¿Qué patrón implementa este código?",
    "BackES": "Patrón: Visitor Pattern\nElementos clave: BaseVisitor proporciona ancla RTTI con destructor virtual, plantilla Visitor<T> define operación de visita para tipo T con tipo de retorno personalizable",
    "Tags": "code-example visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "216"
  },
  {
    "FrontEN": "```cpp\n#define DEFINE_VISITABLE() \\\n    virtual ReturnType Accept(BaseVisitor& guest) \\\n    { return AcceptImpl(*this, guest); }\n```\nWhat is the purpose of this macro in the Visitor pattern?",
    "BackEN": "Pattern: Visitor Pattern\nKey elements: Macro to easily inject Accept implementation into visitable classes while preserving correct static type of *this for proper dispatching",
    "FrontES": "```cpp\n#define DEFINE_VISITABLE() \\\n    virtual ReturnType Accept(BaseVisitor& guest) \\\n    { return AcceptImpl(*this, guest); }\n```\n¿Cuál es el propósito de esta macro en el patrón Visitor?",
    "BackES": "Patrón: Visitor Pattern\nElementos clave: Macro para inyectar fácilmente implementación Accept en clases visitables mientras preserva el tipo estático correcto de *this para despacho apropiado",
    "Tags": "code-example visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "218"
  },
  {
    "FrontEN": "```cpp\nclass DocStats : \n    public BaseVisitor,\n    public Visitor<Paragraph>,\n    public Visitor<RasterBitmap>\n{\npublic:\n    void Visit(Paragraph& par)\n    {\n        chars_ += par.NumChars();\n        words_ += par.NumWords();\n    }\n    void Visit(RasterBitmap&)\n    {\n        ++images_;\n    }\n};\n```\nWhat pattern does this demonstrate?",
    "BackEN": "Pattern: Visitor Pattern\nKey elements: Concrete visitor derives from BaseVisitor and Visitor<T> for each type it handles, implementing Visit for specific types with type-safe operations",
    "FrontES": "```cpp\nclass DocStats : \n    public BaseVisitor,\n    public Visitor<Paragraph>,\n    public Visitor<RasterBitmap>\n{\npublic:\n    void Visit(Paragraph& par)\n    {\n        chars_ += par.NumChars();\n        words_ += par.NumWords();\n    }\n    void Visit(RasterBitmap&)\n    {\n        ++images_;\n    }\n};\n```\n¿Qué patrón demuestra esto?",
    "BackES": "Patrón: Visitor Pattern\nElementos clave: Visitante concreto deriva de BaseVisitor y Visitor<T> para cada tipo que maneja, implementando Visit para tipos específicos con operaciones seguras de tipo",
    "Tags": "code-example visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "220"
  },
  {
    "FrontEN": "What is the intent of the Acyclic Visitor pattern?",
    "BackEN": "Eliminate cyclic dependencies in the Visitor pattern by using dynamic_cast to detect visitor type at runtime instead of declaring all Visit functions upfront.",
    "FrontES": "¿Cuál es la intención del patrón Acyclic Visitor?",
    "BackES": "Eliminar dependencias cíclicas en el patrón Visitor usando dynamic_cast para detectar el tipo de visitante en tiempo de ejecución en lugar de declarar todas las funciones Visit por adelantado.",
    "Tags": "intent acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "When would you use the Acyclic Visitor pattern?",
    "BackEN": "• When you need visitor pattern but want to avoid cyclic dependencies\n• When the hierarchy is less stable and you want easier addition of new types\n• When you can tolerate the performance cost of dynamic_cast\n• When you want better insulation between visitor and visited hierarchies",
    "FrontES": "¿Cuándo usarías el patrón Acyclic Visitor?",
    "BackES": "• Cuando necesitas el patrón visitor pero quieres evitar dependencias cíclicas\n• Cuando la jerarquía es menos estable y quieres facilitar la adición de nuevos tipos\n• Cuando puedes tolerar el costo de rendimiento de dynamic_cast\n• Cuando quieres mejor aislamiento entre jerarquías de visitante y visitado",
    "Tags": "use-case acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "What are the key participants in the Acyclic Visitor pattern?",
    "BackEN": "• BaseVisitor: Empty strawman class with only virtual destructor, provides RTTI anchor point\n• Visitor<T>: Template generating small visitor interfaces, one per visited type\n• ConcreteVisitor: Derives from BaseVisitor and Visitor<T> for each type it wants to visit\n• Visitable: Classes use dynamic_cast to test if visitor implements Visitor<ThisType>",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Acyclic Visitor?",
    "BackES": "• BaseVisitor: Clase ficticia vacía con solo destructor virtual, proporciona punto de anclaje RTTI\n• Visitor<T>: Plantilla que genera pequeñas interfaces de visitante, una por tipo visitado\n• ConcreteVisitor: Deriva de BaseVisitor y Visitor<T> para cada tipo que quiere visitar\n• Visitable: Las clases usan dynamic_cast para probar si el visitante implementa Visitor<ThisType>",
    "Tags": "key-concepts acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Acyclic Visitor pattern?",
    "BackEN": "Benefits:\n• Eliminates cyclic name dependencies\n• Easier to add new visited types\n• Better insulation between hierarchies\n• Each visited type only depends on its own visitor interface\n\nDrawbacks:\n• Slower than GoF Visitor due to dynamic_cast overhead\n• Must maintain parallel class hierarchies\n• Runtime cost increases with complexity of class hierarchies\n• Dynamic_cast performance varies by compiler implementation",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Acyclic Visitor?",
    "BackES": "Beneficios:\n• Elimina dependencias de nombres cíclicas\n• Más fácil agregar nuevos tipos visitados\n• Mejor aislamiento entre jerarquías\n• Cada tipo visitado solo depende de su propia interfaz de visitante\n\nDesventajas:\n• Más lento que el Visitor de GoF debido a sobrecarga de dynamic_cast\n• Debe mantener jerarquías de clases paralelas\n• El costo en tiempo de ejecución aumenta con la complejidad de las jerarquías de clases\n• El rendimiento de dynamic_cast varía según implementación del compilador",
    "Tags": "benefits-drawbacks acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "What are key implementation considerations for the Acyclic Visitor pattern?",
    "BackEN": "• BaseVisitor is just a virtual destructor, no Visit functions\n• Create separate Visitor<T> interface for each visited type\n• Use dynamic_cast in Accept to detect matching visitor\n• Provide CatchAll policy for handling unknown visitor/visited combinations\n• Can optionally call catch-all function when dynamic_cast fails",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Acyclic Visitor?",
    "BackES": "• BaseVisitor es solo un destructor virtual, sin funciones Visit\n• Crear interfaz Visitor<T> separada para cada tipo visitado\n• Usar dynamic_cast en Accept para detectar visitante coincidente\n• Proporcionar política CatchAll para manejar combinaciones visitante/visitado desconocidas\n• Puede opcionalmente llamar función catch-all cuando dynamic_cast falla",
    "Tags": "implementation acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "What are real-world examples of the Acyclic Visitor pattern?",
    "BackEN": "• Extensible plugin systems where new types are frequently added\n• Document processing systems with evolving element types",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Acyclic Visitor?",
    "BackES": "• Sistemas de plugins extensibles donde se agregan nuevos tipos frecuentemente\n• Sistemas de procesamiento de documentos con tipos de elementos en evolución",
    "Tags": "real-world acyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "211"
  },
  {
    "FrontEN": "```cpp\nclass ParagraphVisitor\n{\npublic:\n    virtual void VisitParagraph(Paragraph&) = 0;\n};\n\nvoid Paragraph::Accept(BaseVisitor& v)\n{\n    if (ParagraphVisitor* p = dynamic_cast<ParagraphVisitor*>(&v))\n    {\n        p->VisitParagraph(*this);\n    }\n    else\n    {\n        // optionally call catch-all\n    }\n}\n```\nWhat pattern does this demonstrate?",
    "BackEN": "Pattern: Acyclic Visitor\nKey elements: Uses dynamic_cast to detect if visitor can handle the specific type, eliminating compile-time dependencies between hierarchies",
    "FrontES": "```cpp\nclass ParagraphVisitor\n{\npublic:\n    virtual void VisitParagraph(Paragraph&) = 0;\n};\n\nvoid Paragraph::Accept(BaseVisitor& v)\n{\n    if (ParagraphVisitor* p = dynamic_cast<ParagraphVisitor*>(&v))\n    {\n        p->VisitParagraph(*this);\n    }\n    else\n    {\n        // optionally call catch-all\n    }\n}\n```\n¿Qué patrón demuestra esto?",
    "BackES": "Patrón: Acyclic Visitor\nElementos clave: Usa dynamic_cast para detectar si el visitante puede manejar el tipo específico, eliminando dependencias en tiempo de compilación entre jerarquías",
    "Tags": "code-example acyclic-visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "213"
  },
  {
    "FrontEN": "What is the intent of the Cyclic Visitor (GoF) pattern?",
    "BackEN": "Classic GoF Visitor implementation using compile-time binding where BaseVisitor declares all Visit functions upfront, providing maximum performance.",
    "FrontES": "¿Cuál es la intención del patrón Cyclic Visitor (GoF)?",
    "BackES": "Implementación clásica de Visitor de GoF usando enlace en tiempo de compilación donde BaseVisitor declara todas las funciones Visit por adelantado, proporcionando máximo rendimiento.",
    "Tags": "intent cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "When would you use the Cyclic Visitor (GoF) pattern?",
    "BackEN": "• When performance is critical\n• When the visited hierarchy is very stable\n• When you can tolerate cyclic dependencies\n• When compile-time type checking is preferred over runtime flexibility",
    "FrontES": "¿Cuándo usarías el patrón Cyclic Visitor (GoF)?",
    "BackES": "• Cuando el rendimiento es crítico\n• Cuando la jerarquía visitada es muy estable\n• Cuando puedes tolerar dependencias cíclicas\n• Cuando se prefiere verificación de tipo en tiempo de compilación sobre flexibilidad en tiempo de ejecución",
    "Tags": "use-case cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "What are the key participants in the Cyclic Visitor (GoF) pattern?",
    "BackEN": "• BaseVisitor: Declares pure virtual Visit function for every type in the hierarchy\n• ConcreteVisited: Calls visitor.Visit(*this) directly in Accept",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Cyclic Visitor (GoF)?",
    "BackES": "• BaseVisitor: Declara función Visit virtual pura para cada tipo en la jerarquía\n• ConcreteVisited: Llama visitor.Visit(*this) directamente en Accept",
    "Tags": "key-concepts cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Cyclic Visitor (GoF) pattern?",
    "BackEN": "Benefits:\n• Faster than Acyclic Visitor (no dynamic_cast)\n• Compile-time type safety\n• Compiler enforces implementation of all Visit functions\n• Simpler runtime behavior\n\nDrawbacks:\n• Cyclic dependencies between visitor and visited hierarchies\n• Hard to add new types to visited hierarchy\n• Must recompile all visitors when hierarchy changes\n• BaseVisitor becomes dependency bottleneck",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Cyclic Visitor (GoF)?",
    "BackES": "Beneficios:\n• Más rápido que Acyclic Visitor (sin dynamic_cast)\n• Seguridad de tipo en tiempo de compilación\n• El compilador fuerza implementación de todas las funciones Visit\n• Comportamiento en tiempo de ejecución más simple\n\nDesventajas:\n• Dependencias cíclicas entre jerarquías de visitante y visitado\n• Difícil agregar nuevos tipos a jerarquía visitada\n• Debe recompilar todos los visitantes cuando jerarquía cambia\n• BaseVisitor se convierte en cuello de botella de dependencias",
    "Tags": "benefits-drawbacks cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "What are key implementation considerations for the Cyclic Visitor (GoF) pattern?",
    "BackEN": "• Use typelist to generate BaseVisitor with Visit function for each type\n• CyclicVisitor template uses GenScatterHierarchy to inherit Visitor<T> for each T\n• Must use DEFINE_CYCLIC_VISITABLE macro in each visited class\n• Update typelist whenever adding new visited type\n• All concrete visitors must implement all Visit overloads",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Cyclic Visitor (GoF)?",
    "BackES": "• Usar typelist para generar BaseVisitor con función Visit para cada tipo\n• Plantilla CyclicVisitor usa GenScatterHierarchy para heredar Visitor<T> para cada T\n• Debe usar macro DEFINE_CYCLIC_VISITABLE en cada clase visitada\n• Actualizar typelist siempre que se agregue nuevo tipo visitado\n• Todos los visitantes concretos deben implementar todas las sobrecargas Visit",
    "Tags": "implementation cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "What are real-world examples of the Cyclic Visitor (GoF) pattern?",
    "BackEN": "• Performance-critical compiler passes\n• Game engines with stable object hierarchies\n• Real-time graphics rendering pipelines",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Cyclic Visitor (GoF)?",
    "BackES": "• Pases de compilador críticos de rendimiento\n• Motores de juegos con jerarquías de objetos estables\n• Pipelines de renderizado gráfico en tiempo real",
    "Tags": "real-world cyclic-visitor behavioral",
    "Category": "Behavioral",
    "Page": "221"
  },
  {
    "FrontEN": "```cpp\ntemplate <typename R, class TList>\nclass CyclicVisitor : public GenScatterHierarchy<TList, \n    Private::VisitorBinder<R>::Result>\n{\n    typedef R ReturnType;\n    template <class Visited>\n    ReturnType Visit(Visited& host)\n    {\n        Visitor<Visited>& subObj = *this;\n        return subObj.Visit(host);\n    }\n};\n```\nWhat pattern does this implement?",
    "BackEN": "Pattern: Cyclic Visitor (GoF)\nKey elements: Uses typelist and GenScatterHierarchy to automatically inherit Visitor<T> for each type, enabling compile-time type checking",
    "FrontES": "```cpp\ntemplate <typename R, class TList>\nclass CyclicVisitor : public GenScatterHierarchy<TList, \n    Private::VisitorBinder<R>::Result>\n{\n    typedef R ReturnType;\n    template <class Visited>\n    ReturnType Visit(Visited& host)\n    {\n        Visitor<Visited>& subObj = *this;\n        return subObj.Visit(host);\n    }\n};\n```\n¿Qué patrón implementa esto?",
    "BackES": "Patrón: Cyclic Visitor (GoF)\nElementos clave: Usa typelist y GenScatterHierarchy para heredar automáticamente Visitor<T> para cada tipo, habilitando verificación de tipo en tiempo de compilación",
    "Tags": "code-example cyclic-visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "222"
  },
  {
    "FrontEN": "```cpp\ntypedef CyclicVisitor<\n    void,\n    TYPELIST_3(DocElement, Paragraph, RasterBitmap)\n> MyVisitor;\n```\nWhat does this code define?",
    "BackEN": "Pattern: Cyclic Visitor (GoF)\nKey elements: Defining a cyclic visitor by specifying return type (void) and list of visited types using typelist, creating compile-time visitor interface",
    "FrontES": "```cpp\ntypedef CyclicVisitor<\n    void,\n    TYPELIST_3(DocElement, Paragraph, RasterBitmap)\n> MyVisitor;\n```\n¿Qué define este código?",
    "BackES": "Patrón: Cyclic Visitor (GoF)\nElementos clave: Definiendo un visitante cíclico especificando tipo de retorno (void) y lista de tipos visitados usando typelist, creando interfaz de visitante en tiempo de compilación",
    "Tags": "code-example cyclic-visitor behavioral cpp",
    "Category": "Behavioral",
    "Page": "223"
  },
  {
    "FrontEN": "Compare Visitor vs Acyclic Visitor",
    "BackEN": "Similarities:\n• Both enable adding operations to hierarchies without modifying them\n• Both use double dispatch mechanism\n• Both separate operations from data structures\n\nDifferences:\n• Visitor (GoF): Compile-time binding, faster, cyclic dependencies\n• Acyclic Visitor: Runtime binding with dynamic_cast, slower, no cyclic dependencies\n\nWhen to use each:\n• Visitor: When hierarchy is very stable and performance is critical\n• Acyclic Visitor: When hierarchy evolves frequently and flexibility is more important than speed",
    "FrontES": "Compara Visitor vs Acyclic Visitor",
    "BackES": "Similitudes:\n• Ambos permiten agregar operaciones a jerarquías sin modificarlas\n• Ambos usan mecanismo de despacho doble\n• Ambos separan operaciones de estructuras de datos\n\nDiferencias:\n• Visitor (GoF): Enlace en tiempo de compilación, más rápido, dependencias cíclicas\n• Acyclic Visitor: Enlace en tiempo de ejecución con dynamic_cast, más lento, sin dependencias cíclicas\n\nCuándo usar cada uno:\n• Visitor: Cuando la jerarquía es muy estable y el rendimiento es crítico\n• Acyclic Visitor: Cuando la jerarquía evoluciona frecuentemente y la flexibilidad es más importante que la velocidad",
    "Tags": "comparison visitor acyclic-visitor",
    "Category": "Comparison",
    "Page": "215"
  },
  {
    "FrontEN": "What is the intent of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "Dispatch a function call based on the dynamic types of multiple objects, extending single dispatch (virtual functions) to multiple objects.",
    "FrontES": "¿Cuál es la intención del patrón Multimethod (Double Dispatch)?",
    "BackES": "Despachar una llamada de función basada en los tipos dinámicos de múltiples objetos, extendiendo despacho único (funciones virtuales) a múltiples objetos.",
    "Tags": "intent multimethod behavioral",
    "Category": "Behavioral",
    "Page": "228"
  },
  {
    "FrontEN": "When would you use the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• When operation behavior depends on dynamic types of multiple objects\n• Collision detection in games (asteroid-ship, asteroid-asteroid, etc.)\n• Shape intersection calculations\n• Double dispatch on two polymorphic hierarchies\n• When single virtual dispatch is insufficient",
    "FrontES": "¿Cuándo usarías el patrón Multimethod (Double Dispatch)?",
    "BackES": "• Cuando el comportamiento de operación depende de tipos dinámicos de múltiples objetos\n• Detección de colisiones en juegos (asteroide-nave, asteroide-asteroide, etc.)\n• Cálculos de intersección de formas\n• Despacho doble en dos jerarquías polimórficas\n• Cuando el despacho virtual único es insuficiente",
    "Tags": "use-case multimethod behavioral",
    "Category": "Behavioral",
    "Page": "228"
  },
  {
    "FrontEN": "What are the key participants in the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• StaticDispatcher: Performs brute-force double type discovery using dynamic_cast chains\n• Executor: Class with overloaded Fire methods for each combination of types\n• BaseLhs/BaseRhs: Base types of the two polymorphic hierarchies",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Multimethod (Double Dispatch)?",
    "BackES": "• StaticDispatcher: Descubre tipos de runtime usando dynamic_cast recursivo, llama Fire() apropiado\n• Executor: Proporciona sobrecarga Fire() para cada combinación de tipos que maneja\n• DerivedToFront: Ordena tipos en typelist de más derivado a menos derivado para dynamic_cast correcto",
    "Tags": "key-concepts multimethod behavioral",
    "Category": "Behavioral",
    "Page": "228"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "Benefits:\n• Supports dispatching on multiple objects\n• Fast for small type sets (linear unrolled search)\n• Non-intrusive (no modification of existing hierarchies required)\n• Leverages C++ overloading rules at runtime\n• Compile-time detection of overload ambiguities\n\nDrawbacks:\n• Code size grows exponentially with number of types\n• Dependency bottleneck (dispatcher must know all types)\n• Order of dynamic_cast matters with inheritance\n• Maintenance burden increases rapidly with hierarchy size\n• Must manually sort types from most to least derived",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Multimethod (Double Dispatch)?",
    "BackES": "Beneficios:\n• Soporta despacho sobre múltiples objetos\n• Rápido para conjuntos de tipos pequeños (búsqueda lineal desenrollada)\n• No intrusivo (no se requiere modificación de jerarquías existentes)\n• Aprovecha reglas de sobrecarga de C++ en tiempo de ejecución\n• Detección en tiempo de compilación de ambigüedades de sobrecarga\n\nDesventajas:\n• Tamaño de código crece exponencialmente con número de tipos\n• Cuello de botella de dependencias (dispatcher debe conocer todos los tipos)\n• Orden de dynamic_cast importa con herencia\n• Carga de mantenimiento aumenta rápidamente con tamaño de jerarquía\n• Debe ordenar tipos manualmente de más a menos derivado",
    "Tags": "benefits-drawbacks multimethod behavioral",
    "Category": "Behavioral",
    "Page": "230"
  },
  {
    "FrontEN": "What patterns are related to the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Visitor: Visitor is a form of double dispatch specialized for adding operations to hierarchies\n• Strategy: Executor classes are strategies for handling different type combinations",
    "FrontES": "¿Qué patrones están relacionados con el patrón Multimethod (Double Dispatch)?",
    "BackES": "• Visitor: Visitor es una forma de despacho doble especializado para agregar operaciones a jerarquías\n• Strategy: Las clases Executor son estrategias para manejar diferentes combinaciones de tipos",
    "Tags": "related-patterns multimethod behavioral",
    "Category": "Behavioral",
    "Page": "228"
  },
  {
    "FrontEN": "What are key implementation considerations for the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Use typelists to specify all possible types for each argument\n• StaticDispatcher generates nested if-else chains at compile time\n• Use DerivedToFront to automatically sort types correctly\n• Executor must implement Fire overload for each type combination\n• Can reverse arguments in Executor for symmetric operations\n• OnError handles cases where type combination is not supported",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Multimethod (Double Dispatch)?",
    "BackES": "• Usar typelists para especificar todos los tipos posibles para cada argumento\n• StaticDispatcher genera cadenas if-else anidadas en tiempo de compilación\n• Usar DerivedToFront para ordenar tipos automáticamente correctamente\n• Executor debe implementar sobrecarga Fire para cada combinación de tipos\n• Puede invertir argumentos en Executor para operaciones simétricas\n• OnError maneja casos donde combinación de tipos no está soportada",
    "Tags": "implementation multimethod behavioral",
    "Category": "Behavioral",
    "Page": "232"
  },
  {
    "FrontEN": "What are real-world examples of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Game collision detection systems\n• CAD shape intersection algorithms\n• Type-based matrix multiplication optimization\n• Protocol message handling based on sender and receiver types\n• Robot interaction behaviors based on obstacle and robot types",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Multimethod (Double Dispatch)?",
    "BackES": "• Sistemas de detección de colisiones en juegos\n• Algoritmos de intersección de formas en CAD\n• Optimización de multiplicación de matrices basada en tipo\n• Manejo de mensajes de protocolo basado en tipos de emisor y receptor\n• Comportamientos de interacción de robot basados en tipos de obstáculo y robot",
    "Tags": "real-world multimethod behavioral",
    "Category": "Behavioral",
    "Page": "229"
  },
  {
    "FrontEN": "```cpp\nclass HatchingExecutor\n{\npublic:\n    void Fire(Rectangle&, Rectangle&) { /* ... */ }\n    void Fire(Rectangle&, Ellipse&) { /* ... */ }\n    void Fire(Ellipse&, Ellipse&) { /* ... */ }\n    void OnError(Shape&, Shape&) { /* ... */ }\n};\n\ntypedef StaticDispatcher<HatchingExecutor, Shape,\n    TYPELIST_3(Rectangle, Ellipse, Poly)> Dispatcher;\n```\nWhat pattern does this demonstrate?",
    "BackEN": "Pattern: Multimethod (Double Dispatch)\nKey elements: Executor with Fire overloads for each type combination, StaticDispatcher uses typelist to generate dispatch logic for runtime type discovery",
    "FrontES": "```cpp\nclass HatchingExecutor\n{\npublic:\n    void Fire(Rectangle&, Rectangle&) { /* ... */ }\n    void Fire(Rectangle&, Ellipse&) { /* ... */ }\n    void Fire(Ellipse&, Ellipse&) { /* ... */ }\n    void OnError(Shape&, Shape&) { /* ... */ }\n};\n\ntypedef StaticDispatcher<HatchingExecutor, Shape,\n    TYPELIST_3(Rectangle, Ellipse, Poly)> Dispatcher;\n```\n¿Qué patrón demuestra esto?",
    "BackES": "Patrón: Multimethod (Double Dispatch)\nElementos clave: Executor con sobrecargas Fire para cada combinación de tipos, StaticDispatcher usa typelist para generar lógica de despacho para descubrimiento de tipo en tiempo de ejecución",
    "Tags": "code-example multimethod behavioral cpp",
    "Category": "Behavioral",
    "Page": "235"
  },
  {
    "FrontEN": "Which patterns use the concept 'Double Dispatch'?",
    "BackEN": "Technique for selecting function implementation based on runtime types of two objects. Visitor achieves this through Accept/Visit callbacks. Multimethods use type discovery through dynamic_cast or other means.\n\nPatterns: Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Double Dispatch'?",
    "BackES": "Técnica para seleccionar implementación de función basada en tipos en tiempo de ejecución de dos objetos. Visitor logra esto a través de callbacks Accept/Visit. Multimethods usan descubrimiento de tipo a través de dynamic_cast u otros medios.\n\nPatrones: Visitor, Multimethod",
    "Tags": "cross-cutting double-dispatch",
    "Category": "Cross-Cutting",
    "Page": "210"
  },
  {
    "FrontEN": "Which patterns use the concept 'Runtime Type Information (RTTI)'?",
    "BackEN": "All multimethod implementations rely on RTTI to discover dynamic types. Acyclic Visitor and StaticDispatcher use dynamic_cast. BaseVisitor requires virtual destructor to enable RTTI. The cost of RTTI operations is a key performance consideration.\n\nPatterns: Visitor, Acyclic Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Runtime Type Information (RTTI)'?",
    "BackES": "Todas las implementaciones de multimethod dependen de RTTI para descubrir tipos dinámicos. Acyclic Visitor y StaticDispatcher usan dynamic_cast. BaseVisitor requiere destructor virtual para habilitar RTTI. El costo de operaciones RTTI es una consideración clave de rendimiento.\n\nPatrones: Visitor, Acyclic Visitor, Multimethod",
    "Tags": "cross-cutting rtti",
    "Category": "Cross-Cutting",
    "Page": "213"
  },
  {
    "FrontEN": "Which patterns use the concept 'Cyclic Dependencies'?",
    "BackEN": "Classic Visitor creates cycles: BaseVisitor depends on all visited types, visited types depend on BaseVisitor. This makes maintenance difficult. Acyclic Visitor eliminates this at the cost of runtime performance.\n\nPatterns: Visitor (GoF), Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Cyclic Dependencies'?",
    "BackES": "El Visitor clásico crea ciclos: BaseVisitor depende de todos los tipos visitados, los tipos visitados dependen de BaseVisitor. Esto dificulta el mantenimiento. Acyclic Visitor elimina esto al costo del rendimiento en tiempo de ejecución.\n\nPatrones: Visitor (GoF), Multimethod",
    "Tags": "cross-cutting cyclic-dependencies",
    "Category": "Cross-Cutting",
    "Page": "211"
  },
  {
    "FrontEN": "Which patterns use the concept 'Policy-Based Design'?",
    "BackEN": "Both patterns use policies (CatchAll) to customize behavior for error cases. This allows the library code to be generic while giving clients control over edge cases.\n\nPatterns: Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Policy-Based Design'?",
    "BackES": "Ambos patrones usan políticas (CatchAll) para personalizar comportamiento para casos de error. Esto permite que el código de biblioteca sea genérico mientras da a los clientes control sobre casos extremos.\n\nPatrones: Visitor, Multimethod",
    "Tags": "cross-cutting policy-based-design",
    "Category": "Cross-Cutting",
    "Page": "224"
  },
  {
    "FrontEN": "Which patterns use the concept 'Typelists'?",
    "BackEN": "Compile-time type lists enable automatic generation of visitor and dispatcher code. CyclicVisitor uses typelists with GenScatterHierarchy. StaticDispatcher recursively processes typelists to generate dynamic_cast chains.\n\nPatterns: Cyclic Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Typelists'?",
    "BackES": "Las listas de tipos en tiempo de compilación permiten la generación automática de código de visitante y dispatcher. CyclicVisitor usa typelists con GenScatterHierarchy. StaticDispatcher procesa recursivamente typelists para generar cadenas dynamic_cast.\n\nPatrones: Cyclic Visitor, Multimethod",
    "Tags": "cross-cutting typelists",
    "Category": "Cross-Cutting",
    "Page": "222"
  },
  {
    "FrontEN": "Which patterns use the concept 'Metaprogramming'?",
    "BackEN": "Template metaprogramming generates exponential amounts of dispatch code from compact specifications. DerivedToFront automatically sorts types. GenScatterHierarchy creates multiple inheritance structures.\n\nPatterns: Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Metaprogramming'?",
    "BackES": "La metaprogramación de plantillas genera cantidades exponenciales de código de despacho desde especificaciones compactas. DerivedToFront ordena tipos automáticamente. GenScatterHierarchy crea estructuras de herencia múltiple.\n\nPatrones: Visitor, Multimethod",
    "Tags": "cross-cutting metaprogramming",
    "Category": "Cross-Cutting",
    "Page": "222"
  },
  {
    "FrontEN": "Which patterns use the concept 'Separation of Concerns'?",
    "BackEN": "Visitor separates algorithms from data structures. Multimethod separates type discovery (dispatcher) from operations (executor). This improves maintainability and allows independent evolution.\n\nPatterns: Visitor, Multimethod",
    "FrontES": "¿Qué patrones usan el concepto 'Separation of Concerns'?",
    "BackES": "Visitor separa algoritmos de estructuras de datos. Multimethod separa descubrimiento de tipo (dispatcher) de operaciones (executor). Esto mejora mantenibilidad y permite evolución independiente.\n\nPatrones: Visitor, Multimethod",
    "Tags": "cross-cutting separation-of-concerns",
    "Category": "Cross-Cutting",
    "Page": "210"
  },
  {
    "FrontEN": "What are common misuses of the Visitor pattern?",
    "BackEN": "• Using it for unstable hierarchies that change frequently\n• Forgetting to implement Accept in derived classes (leads to runtime bugs)\n• Not ordering dynamic_cast from most to least derived types\n• Creating too many visitor classes for one-off operations\n• Breaking encapsulation by exposing too many internals of visited classes\n• Using Visitor when simple virtual functions would suffice",
    "FrontES": "¿Cuáles son los usos incorrectos comunes del patrón Visitor?",
    "BackES": "• Usarlo para jerarquías inestables que cambian frecuentemente\n• Olvidar implementar Accept en clases derivadas (lleva a bugs en tiempo de ejecución)\n• No ordenar dynamic_cast de tipos más a menos derivados\n• Crear demasiadas clases visitantes para operaciones puntuales\n• Romper encapsulación exponiendo demasiados internos de clases visitadas\n• Usar Visitor cuando funciones virtuales simples serían suficientes",
    "Tags": "anti-pattern visitor behavioral",
    "Category": "Behavioral",
    "Page": "212"
  },
  {
    "FrontEN": "What are common misuses of the Multimethod pattern?",
    "BackEN": "• Using it when number of types is very large (exponential code growth)\n• Not using DerivedToFront to sort types correctly\n• Forgetting to handle all type combinations in Executor\n• Using for single dispatch when virtual functions would work\n• Not providing OnError handler for unsupported type combinations\n• Making hierarchies depend on dispatcher instead of keeping it separate",
    "FrontES": "¿Cuáles son los usos incorrectos comunes del patrón Multimethod?",
    "BackES": "• Usarlo cuando el número de tipos es muy grande (crecimiento exponencial de código)\n• No usar DerivedToFront para ordenar tipos correctamente\n• Olvidar manejar todas las combinaciones de tipos en Executor\n• Usar para despacho único cuando funciones virtuales funcionarían\n• No proporcionar manejador OnError para combinaciones de tipos no soportadas\n• Hacer que jerarquías dependan de dispatcher en lugar de mantenerlo separado",
    "Tags": "anti-pattern multimethod behavioral",
    "Category": "Behavioral",
    "Page": "230"
  },

  {
    "FrontEN": "What is the intent of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "Enable dispatching of function calls based on the runtime types of multiple objects simultaneously, extending the concept of virtual functions to work with multiple polymorphic parameters.",
    "FrontES": "¿Cuál es la intención del patrón Multimethod (Despacho Doble)?",
    "BackES": "Permitir el despacho de llamadas a funciones basándose en los tipos en tiempo de ejecución de múltiples objetos simultáneamente, extendiendo el concepto de funciones virtuales para trabajar con múltiples parámetros polimórficos.",
    "Tags": "intent multimethod behavioral",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "When would you use the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• When you need to dispatch behavior based on the runtime types of two or more objects\n• When implementing collision detection, intersection algorithms, or operations between polymorphic object hierarchies\n• When you want to avoid nested dynamic_cast chains or visitor pattern complexity\n• When implementing operations like rendering different shapes on different output devices",
    "FrontES": "¿Cuándo usarías el patrón Multimethod (Despacho Doble)?",
    "BackES": "• Cuando necesitas despachar comportamiento basándote en los tipos en tiempo de ejecución de dos o más objetos\n• Al implementar detección de colisiones, algoritmos de intersección, u operaciones entre jerarquías de objetos polimórficos\n• Cuando quieres evitar cadenas anidadas de dynamic_cast o la complejidad del patrón visitor\n• Al implementar operaciones como renderizar diferentes formas en diferentes dispositivos de salida",
    "Tags": "use-case multimethod behavioral",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What are the key participants in the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• StaticDispatcher: Compile-time double dispatcher driven by typelists, generates code at compile time for all type combinations\n• BasicDispatcher: Runtime double dispatcher using a map keyed by type_info pairs, performs logarithmic-time lookups\n• BasicFastDispatcher: Constant-time dispatcher using a matrix indexed by unique class IDs assigned to each type\n• FnDispatcher: Higher-level dispatcher that wraps BasicDispatcher/BasicFastDispatcher and provides automatic casting via trampolines\n• FunctorDispatcher: Dispatcher that works with functor objects instead of function pointers, allowing stateful callbacks\n• Executor: Class providing overloaded Fire methods for each type combination in static dispatch",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Multimethod (Despacho Doble)?",
    "BackES": "• StaticDispatcher: Despachador doble en tiempo de compilación impulsado por typelists, genera código en tiempo de compilación para todas las combinaciones de tipos\n• BasicDispatcher: Despachador doble en tiempo de ejecución usando un mapa indexado por pares de type_info, realiza búsquedas en tiempo logarítmico\n• BasicFastDispatcher: Despachador de tiempo constante usando una matriz indexada por IDs únicos de clase asignados a cada tipo\n• FnDispatcher: Despachador de nivel superior que envuelve BasicDispatcher/BasicFastDispatcher y proporciona conversión automática mediante trampolines\n• FunctorDispatcher: Despachador que trabaja con objetos functor en lugar de punteros a funciones, permitiendo callbacks con estado\n• Executor: Clase que proporciona métodos Fire sobrecargados para cada combinación de tipos en despacho estático",
    "Tags": "key-concepts multimethod behavioral",
    "Category": "Behavioral",
    "Page": "240"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "Benefits:\n• Eliminates nested dynamic_cast chains and simplifies code\n• Provides compile-time safety for registered type combinations\n• Allows selection between different performance/coupling trade-offs (static vs. logarithmic vs. constant-time)\n• Supports symmetric dispatching where order of arguments doesn't matter\n• Automates casting from base types to derived types\n• Non-intrusive - doesn't require modifying existing class hierarchies (except for constant-time version)\n\nDrawbacks:\n• Static dispatcher introduces heavy compile-time dependencies on all types in the hierarchy\n• Doesn't fully handle inheritance - you must register handlers for each concrete type combination\n• Map-based dispatcher has logarithmic lookup time overhead\n• Constant-time dispatcher requires modifying classes with IMPLEMENT_INDEXABLE_CLASS macro\n• More complex than single dispatch virtual functions\n• Error handling when no matching handler is found requires careful design",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Multimethod (Despacho Doble)?",
    "BackES": "Beneficios:\n• Elimina cadenas anidadas de dynamic_cast y simplifica el código\n• Proporciona seguridad en tiempo de compilación para combinaciones de tipos registrados\n• Permite seleccionar entre diferentes compensaciones de rendimiento/acoplamiento (estático vs. logarítmico vs. tiempo constante)\n• Soporta despacho simétrico donde el orden de los argumentos no importa\n• Automatiza la conversión de tipos base a tipos derivados\n• No intrusivo - no requiere modificar jerarquías de clases existentes (excepto para la versión de tiempo constante)\n\nDesventajas:\n• El despachador estático introduce fuertes dependencias en tiempo de compilación en todos los tipos de la jerarquía\n• No maneja completamente la herencia - debes registrar manejadores para cada combinación de tipos concretos\n• El despachador basado en mapas tiene sobrecarga de tiempo de búsqueda logarítmico\n• El despachador de tiempo constante requiere modificar clases con la macro IMPLEMENT_INDEXABLE_CLASS\n• Más complejo que funciones virtuales de despacho simple\n• El manejo de errores cuando no se encuentra un manejador coincidente requiere un diseño cuidadoso",
    "Tags": "benefits-drawbacks multimethod behavioral",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What patterns are related to the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Visitor: Visitor achieves double dispatch through double indirection (accept/visit). Multimethods provide a more direct and flexible solution for multiple dispatch scenarios.\n• Strategy: Multimethods can be seen as strategies selected based on multiple object types rather than a single object's state.\n• Command: FunctorDispatcher stores Command-like objects (functors) that encapsulate operations to be performed.",
    "FrontES": "¿Qué patrones están relacionados con el patrón Multimethod (Despacho Doble)?",
    "BackES": "• Visitor: Visitor logra despacho doble mediante doble indirección (accept/visit). Multimethods proporciona una solución más directa y flexible para escenarios de despacho múltiple.\n• Strategy: Los multimethods pueden verse como estrategias seleccionadas basándose en múltiples tipos de objetos en lugar del estado de un solo objeto.\n• Command: FunctorDispatcher almacena objetos similares a Command (functors) que encapsulan operaciones a realizar.",
    "Tags": "related-patterns multimethod behavioral",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "Which patterns use the concept 'Trampoline Functions (Thunks)'?",
    "BackEN": "Small intermediate functions that perform type adjustments (casting) before calling the actual handler function. Trampolines enable storing a uniform function pointer type while supporting handlers with different parameter types. The compiler can inline trampoline calls for zero runtime overhead.\n\nPatterns: Multimethod (Double Dispatch)",
    "FrontES": "¿Qué patrones usan el concepto 'Funciones Trampolín (Thunks)'?",
    "BackES": "Pequeñas funciones intermedias que realizan ajustes de tipos (conversión) antes de llamar a la función manejadora real. Los trampolines permiten almacenar un tipo de puntero de función uniforme mientras soportan manejadores con diferentes tipos de parámetros. El compilador puede hacer inline de las llamadas trampolín para cero sobrecarga en tiempo de ejecución.\n\nPatrones: Multimethod (Despacho Doble)",
    "Tags": "cross-cutting trampoline-functions",
    "Category": "Cross-Cutting",
    "Page": "243"
  },
  {
    "FrontEN": "Which patterns use the concept 'Compile-Time vs. Runtime Dispatch Trade-offs'?",
    "BackEN": "StaticDispatcher generates all dispatch code at compile time (fast execution, heavy dependencies, closed set of types). BasicDispatcher performs runtime lookups (flexible, open set of types, logarithmic cost). BasicFastDispatcher uses runtime indexing with compile-time type assignment (fastest, requires class modification).\n\nPatterns: Multimethod (Double Dispatch)",
    "FrontES": "¿Qué patrones usan el concepto 'Compensaciones entre Despacho en Tiempo de Compilación vs. Tiempo de Ejecución'?",
    "BackES": "StaticDispatcher genera todo el código de despacho en tiempo de compilación (ejecución rápida, dependencias pesadas, conjunto cerrado de tipos). BasicDispatcher realiza búsquedas en tiempo de ejecución (flexible, conjunto abierto de tipos, costo logarítmico). BasicFastDispatcher usa indexación en tiempo de ejecución con asignación de tipos en tiempo de compilación (más rápido, requiere modificación de clases).\n\nPatrones: Multimethod (Despacho Doble)",
    "Tags": "cross-cutting compile-time-runtime",
    "Category": "Cross-Cutting",
    "Page": "237"
  },
  {
    "FrontEN": "Which patterns use the concept 'Policy-Based Design for Orthogonal Concerns'?",
    "BackEN": "Casting strategy (DynamicCaster vs. StaticCaster) and dispatcher backend (BasicDispatcher vs. BasicFastDispatcher) are implemented as policies, allowing mix-and-match combinations. This separates concerns: type discovery mechanism, casting safety, and handler invocation.\n\nPatterns: Multimethod (Double Dispatch)",
    "FrontES": "¿Qué patrones usan el concepto 'Diseño Basado en Políticas para Preocupaciones Ortogonales'?",
    "BackES": "La estrategia de conversión (DynamicCaster vs. StaticCaster) y el backend del despachador (BasicDispatcher vs. BasicFastDispatcher) se implementan como políticas, permitiendo combinaciones mezclables. Esto separa preocupaciones: mecanismo de descubrimiento de tipos, seguridad de conversión e invocación de manejadores.\n\nPatrones: Multimethod (Despacho Doble)",
    "Tags": "cross-cutting policy-based-design",
    "Category": "Cross-Cutting",
    "Page": "251"
  },
  {
    "FrontEN": "Which patterns use the concept 'Non-Type Template Parameters'?",
    "BackEN": "FnDispatcher uses pointers to functions as non-type template parameters, enabling the compiler to hardcode function addresses in trampolines without storing them at runtime. This eliminates double indirection while maintaining type safety.\n\nPatterns: Multimethod (Double Dispatch)",
    "FrontES": "¿Qué patrones usan el concepto 'Parámetros de Plantilla No Tipo'?",
    "BackES": "FnDispatcher usa punteros a funciones como parámetros de plantilla no tipo, permitiendo que el compilador codifique las direcciones de funciones en trampolines sin almacenarlas en tiempo de ejecución. Esto elimina la doble indirección mientras mantiene la seguridad de tipos.\n\nPatrones: Multimethod (Despacho Doble)",
    "Tags": "cross-cutting non-type-template-parameters",
    "Category": "Cross-Cutting",
    "Page": "243"
  },
  {
    "FrontEN": "```cpp\nclass HatchingExecutor {\npublic:\n    void Fire(Rectangle&, Rectangle&);\n    void Fire(Rectangle&, Ellipse&);\n    void Fire(Ellipse&, Ellipse&);\n    void OnError(Shape&, Shape&);\n};\n\ntypedef StaticDispatcher<\n    HatchingExecutor,\n    Shape,\n    TYPELIST_3(Rectangle, Ellipse, Poly)\n> HatchingDispatcher;\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Multimethod (Double Dispatch)\nKey elements: Static dispatcher generates code at compile time for all type combinations in the typelist, providing compile-time type safety and fast execution.",
    "FrontES": "```cpp\nclass HatchingExecutor {\npublic:\n    void Fire(Rectangle&, Rectangle&);\n    void Fire(Rectangle&, Ellipse&);\n    void Fire(Ellipse&, Ellipse&);\n    void OnError(Shape&, Shape&);\n};\n\ntypedef StaticDispatcher<\n    HatchingExecutor,\n    Shape,\n    TYPELIST_3(Rectangle, Ellipse, Poly)\n> HatchingDispatcher;\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Multimethod (Despacho Doble)\nElementos clave: El despachador estático genera código en tiempo de compilación para todas las combinaciones de tipos en la typelist, proporcionando seguridad de tipos en tiempo de compilación y ejecución rápida.",
    "Tags": "code-example multimethod behavioral cpp",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "```cpp\ntypedef FnDispatcher<Shape> Dispatcher;\n\nvoid HatchRectanglePoly(Rectangle& r, Poly& p) {\n    // Work with concrete types directly\n}\n\nDispatcher disp;\ndisp.Add<Rectangle, Poly, HatchRectanglePoly>();\ndisp.Go(*s1, *s2); // Automatic lookup, casting, and invocation\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Multimethod (Double Dispatch)\nKey elements: FnDispatcher uses trampoline functions to automatically cast from base types (Shape&) to derived types (Rectangle&, Poly&) before invoking the callback.",
    "FrontES": "```cpp\ntypedef FnDispatcher<Shape> Dispatcher;\n\nvoid HatchRectanglePoly(Rectangle& r, Poly& p) {\n    // Trabaja con tipos concretos directamente\n}\n\nDispatcher disp;\ndisp.Add<Rectangle, Poly, HatchRectanglePoly>();\ndisp.Go(*s1, *s2); // Búsqueda, conversión e invocación automática\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Multimethod (Despacho Doble)\nElementos clave: FnDispatcher usa funciones trampolín para convertir automáticamente de tipos base (Shape&) a tipos derivados (Rectangle&, Poly&) antes de invocar el callback.",
    "Tags": "code-example multimethod behavioral cpp",
    "Category": "Behavioral",
    "Page": "244"
  },
  {
    "FrontEN": "```cpp\ntypedef StaticDispatcher<\n    HatchingExecutor,\n    Shape,\n    TYPELIST_2(Rectangle, Ellipse),\n    Shape,\n    TYPELIST_2(Rectangle, Ellipse),\n    void,\n    true  // symmetric = true\n> SymmetricDispatcher;\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Multimethod (Double Dispatch)\nKey elements: Symmetric dispatching eliminates the need to implement handlers for both Fire(A,B) and Fire(B,A) when the operation is commutative.",
    "FrontES": "```cpp\ntypedef StaticDispatcher<\n    HatchingExecutor,\n    Shape,\n    TYPELIST_2(Rectangle, Ellipse),\n    Shape,\n    TYPELIST_2(Rectangle, Ellipse),\n    void,\n    true  // symmetric = true\n> SymmetricDispatcher;\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Multimethod (Despacho Doble)\nElementos clave: El despacho simétrico elimina la necesidad de implementar manejadores tanto para Fire(A,B) como para Fire(B,A) cuando la operación es conmutativa.",
    "Tags": "code-example multimethod behavioral cpp",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What are key implementation considerations for the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Use StaticDispatcher when you have a closed set of types known at compile time and want maximum type safety\n• Use BasicDispatcher (map-based) when you need runtime registration and can tolerate logarithmic lookup time\n• Use BasicFastDispatcher when performance is critical and you can modify class definitions\n• Consider using AssocVector instead of std::map for better cache performance in write-once, read-many scenarios\n• Implement symmetry support to reduce code duplication when operation order doesn't matter (e.g., A intersects B == B intersects A)\n• Use casting policies to choose between dynamic_cast (safe with virtual inheritance) and static_cast (faster for simple hierarchies)\n• Trampoline functions enable automatic casting without storing function pointers with different signatures",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Multimethod (Despacho Doble)?",
    "BackES": "• Usa StaticDispatcher cuando tienes un conjunto cerrado de tipos conocido en tiempo de compilación y quieres máxima seguridad de tipos\n• Usa BasicDispatcher (basado en mapas) cuando necesitas registro en tiempo de ejecución y puedes tolerar tiempo de búsqueda logarítmico\n• Usa BasicFastDispatcher cuando el rendimiento es crítico y puedes modificar definiciones de clases\n• Considera usar AssocVector en lugar de std::map para mejor rendimiento de caché en escenarios de escribir una vez, leer muchas veces\n• Implementa soporte de simetría para reducir duplicación de código cuando el orden de operación no importa (ej., A intersecta B == B intersecta A)\n• Usa políticas de conversión para elegir entre dynamic_cast (seguro con herencia virtual) y static_cast (más rápido para jerarquías simples)\n• Las funciones trampolín permiten conversión automática sin almacenar punteros de función con diferentes firmas",
    "Tags": "implementation multimethod behavioral",
    "Category": "Behavioral",
    "Page": "240"
  },
  {
    "FrontEN": "What are real-world examples of the Multimethod (Double Dispatch) pattern?",
    "BackEN": "• Collision detection systems in game engines (spaceship vs. asteroid, bullet vs. shield, etc.)\n• Intersection algorithms in CAD/graphics systems (line-line, line-circle, circle-polygon)\n• Rendering systems that dispatch based on both shape type and output device type\n• Expression evaluation systems that handle operations between different numeric types\n• File format conversion utilities that dispatch based on source and destination formats",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Multimethod (Despacho Doble)?",
    "BackES": "• Sistemas de detección de colisiones en motores de juegos (nave espacial vs. asteroide, bala vs. escudo, etc.)\n• Algoritmos de intersección en sistemas CAD/gráficos (línea-línea, línea-círculo, círculo-polígono)\n• Sistemas de renderizado que despachan basándose tanto en el tipo de forma como en el tipo de dispositivo de salida\n• Sistemas de evaluación de expresiones que manejan operaciones entre diferentes tipos numéricos\n• Utilidades de conversión de formato de archivo que despachan basándose en formatos de origen y destino",
    "Tags": "real-world multimethod behavioral",
    "Category": "Behavioral",
    "Page": "253"
  },
  {
    "FrontEN": "What is StaticDispatcher in the Multimethod pattern?",
    "BackEN": "A compile-time double dispatcher driven by typelists that generates code at compile time for all type combinations. It provides the fastest execution and best type safety but introduces heavy compile-time dependencies on all types in the hierarchy.",
    "FrontES": "¿Qué es StaticDispatcher en el patrón Multimethod?",
    "BackES": "Un despachador doble en tiempo de compilación impulsado por typelists que genera código en tiempo de compilación para todas las combinaciones de tipos. Proporciona la ejecución más rápida y la mejor seguridad de tipos pero introduce fuertes dependencias en tiempo de compilación en todos los tipos de la jerarquía.",
    "Tags": "key-concepts multimethod behavioral static-dispatcher",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What is BasicDispatcher in the Multimethod pattern?",
    "BackEN": "A runtime double dispatcher using a map (or AssocVector) keyed by type_info pairs that performs logarithmic-time lookups. It allows runtime registration of handlers and doesn't require compile-time knowledge of all types, but has slower lookup performance than StaticDispatcher.",
    "FrontES": "¿Qué es BasicDispatcher en el patrón Multimethod?",
    "BackES": "Un despachador doble en tiempo de ejecución usando un mapa (o AssocVector) indexado por pares de type_info que realiza búsquedas en tiempo logarítmico. Permite el registro en tiempo de ejecución de manejadores y no requiere conocimiento en tiempo de compilación de todos los tipos, pero tiene un rendimiento de búsqueda más lento que StaticDispatcher.",
    "Tags": "key-concepts multimethod behavioral basic-dispatcher",
    "Category": "Behavioral",
    "Page": "240"
  },
  {
    "FrontEN": "What is BasicFastDispatcher in the Multimethod pattern?",
    "BackEN": "A constant-time dispatcher using a matrix indexed by unique class IDs assigned to each type. It provides the fastest runtime performance but requires modifying class definitions with the IMPLEMENT_INDEXABLE_CLASS macro.",
    "FrontES": "¿Qué es BasicFastDispatcher en el patrón Multimethod?",
    "BackES": "Un despachador de tiempo constante usando una matriz indexada por IDs únicos de clase asignados a cada tipo. Proporciona el rendimiento en tiempo de ejecución más rápido pero requiere modificar definiciones de clases con la macro IMPLEMENT_INDEXABLE_CLASS.",
    "Tags": "key-concepts multimethod behavioral fast-dispatcher",
    "Category": "Behavioral",
    "Page": "252"
  },
  {
    "FrontEN": "What is FnDispatcher in the Multimethod pattern?",
    "BackEN": "A higher-level dispatcher that wraps BasicDispatcher or BasicFastDispatcher and provides automatic casting via trampoline functions. It eliminates the need for manual casting in handler functions by using compile-time techniques to generate type-safe trampolines.",
    "FrontES": "¿Qué es FnDispatcher en el patrón Multimethod?",
    "BackES": "Un despachador de nivel superior que envuelve BasicDispatcher o BasicFastDispatcher y proporciona conversión automática mediante funciones trampolín. Elimina la necesidad de conversión manual en funciones manejadoras usando técnicas en tiempo de compilación para generar trampolines seguros en cuanto a tipos.",
    "Tags": "key-concepts multimethod behavioral fn-dispatcher",
    "Category": "Behavioral",
    "Page": "244"
  },
  {
    "FrontEN": "What is FunctorDispatcher in the Multimethod pattern?",
    "BackEN": "A dispatcher that works with functor objects instead of function pointers, allowing stateful callbacks. It can store any callable object that implements operator() with the appropriate signature, providing more flexibility than simple function pointers.",
    "FrontES": "¿Qué es FunctorDispatcher en el patrón Multimethod?",
    "BackES": "Un despachador que trabaja con objetos functor en lugar de punteros a funciones, permitiendo callbacks con estado. Puede almacenar cualquier objeto invocable que implemente operator() con la firma apropiada, proporcionando más flexibilidad que simples punteros a funciones.",
    "Tags": "key-concepts multimethod behavioral functor-dispatcher",
    "Category": "Behavioral",
    "Page": "246"
  },
  {
    "FrontEN": "Compare Multimethod (Double Dispatch) vs Visitor pattern",
    "BackEN": "Similarities:\n• Both achieve double dispatch\n• Both allow operations to be defined outside the class hierarchy\n• Both work with polymorphic object hierarchies\n\nDifferences:\n• Multimethod uses direct type-based dispatch; Visitor uses double indirection (accept/visit)\n• Multimethod is more flexible for multiple dispatch scenarios; Visitor is limited to single dispatch with double indirection\n• Multimethod requires less boilerplate code; Visitor requires implementing accept() in every class\n\nWhen to use each:\n• Multimethod: When you need to dispatch on multiple object types simultaneously and want direct, flexible dispatch\n• Visitor: When you need to add operations to a stable class hierarchy without modifying the classes",
    "FrontES": "Compara Multimethod (Despacho Doble) vs patrón Visitor",
    "BackES": "Similitudes:\n• Ambos logran despacho doble\n• Ambos permiten que las operaciones se definan fuera de la jerarquía de clases\n• Ambos trabajan con jerarquías de objetos polimórficos\n\nDiferencias:\n• Multimethod usa despacho directo basado en tipos; Visitor usa doble indirección (accept/visit)\n• Multimethod es más flexible para escenarios de despacho múltiple; Visitor está limitado a despacho simple con doble indirección\n• Multimethod requiere menos código repetitivo; Visitor requiere implementar accept() en cada clase\n\nCuándo usar cada uno:\n• Multimethod: Cuando necesitas despachar sobre múltiples tipos de objetos simultáneamente y quieres despacho directo y flexible\n• Visitor: Cuando necesitas agregar operaciones a una jerarquía de clases estable sin modificar las clases",
    "Tags": "comparison multimethod visitor",
    "Category": "Comparison",
    "Page": "237"
  },
  {
    "FrontEN": "How does symmetric dispatching work in the Multimethod pattern?",
    "BackEN": "Symmetric dispatching allows a single handler function to handle both Fire(A, B) and Fire(B, A) when the operation is commutative (order doesn't matter). The dispatcher automatically registers both orderings to call the same handler, eliminating code duplication. For example, in collision detection, spaceship-asteroid and asteroid-spaceship collisions can use the same handler.",
    "FrontES": "¿Cómo funciona el despacho simétrico en el patrón Multimethod?",
    "BackES": "El despacho simétrico permite que una sola función manejadora maneje tanto Fire(A, B) como Fire(B, A) cuando la operación es conmutativa (el orden no importa). El despachador registra automáticamente ambos ordenamientos para llamar al mismo manejador, eliminando la duplicación de código. Por ejemplo, en la detección de colisiones, las colisiones nave espacial-asteroide y asteroide-nave espacial pueden usar el mismo manejador.",
    "Tags": "implementation multimethod behavioral symmetry",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What are trampoline functions and how are they used in multimethods?",
    "BackEN": "Trampoline functions (thunks) are small intermediate functions that perform type adjustments (casting) before calling the actual handler function. They enable storing a uniform function pointer type while supporting handlers with different parameter types. The compiler hardcodes the target function address in the trampoline, allowing it to be inlined for zero runtime overhead.",
    "FrontES": "¿Qué son las funciones trampolín y cómo se usan en multimethods?",
    "BackES": "Las funciones trampolín (thunks) son pequeñas funciones intermedias que realizan ajustes de tipos (conversión) antes de llamar a la función manejadora real. Permiten almacenar un tipo de puntero de función uniforme mientras soportan manejadores con diferentes tipos de parámetros. El compilador codifica la dirección de la función objetivo en el trampolín, permitiendo que se haga inline para cero sobrecarga en tiempo de ejecución.",
    "Tags": "implementation multimethod behavioral trampoline",
    "Category": "Behavioral",
    "Page": "243"
  },
  {
    "FrontEN": "What is the difference between dynamic_cast and static_cast in multimethod casting policies?",
    "BackEN": "dynamic_cast: Safe for all inheritance scenarios including virtual inheritance and diamond hierarchies, but slower. It performs runtime type checking and can handle complex class relationships.\n\nstatic_cast: Faster but only works correctly with simple inheritance hierarchies (no virtual inheritance or multiple base occurrences). It performs compile-time casting without runtime checks.\n\nUse DynamicCaster policy for safety, StaticCaster policy for performance in simple hierarchies.",
    "FrontES": "¿Cuál es la diferencia entre dynamic_cast y static_cast en las políticas de conversión de multimethod?",
    "BackES": "dynamic_cast: Seguro para todos los escenarios de herencia incluyendo herencia virtual y jerarquías de diamante, pero más lento. Realiza verificación de tipos en tiempo de ejecución y puede manejar relaciones de clases complejas.\n\nstatic_cast: Más rápido pero solo funciona correctamente con jerarquías de herencia simples (sin herencia virtual o múltiples ocurrencias de base). Realiza conversión en tiempo de compilación sin verificaciones en tiempo de ejecución.\n\nUsa la política DynamicCaster para seguridad, la política StaticCaster para rendimiento en jerarquías simples.",
    "Tags": "implementation multimethod behavioral casting",
    "Category": "Behavioral",
    "Page": "248"
  },
  {
    "FrontEN": "Why does BasicDispatcher use AssocVector instead of std::map?",
    "BackEN": "AssocVector (sorted vector with binary search) performs better than std::map for write-once, read-many scenarios typical in dispatchers. It offers:\n• About twice the lookup speed\n• Much smaller working set (better cache performance)\n• Lower memory overhead\n\nThe trade-off is linear-time insertions/deletions, which is acceptable since dispatchers typically register all handlers once at startup and then perform many lookups.",
    "FrontES": "¿Por qué BasicDispatcher usa AssocVector en lugar de std::map?",
    "BackES": "AssocVector (vector ordenado con búsqueda binaria) funciona mejor que std::map para escenarios de escribir una vez, leer muchas veces típicos en despachadores. Ofrece:\n• Aproximadamente el doble de velocidad de búsqueda\n• Conjunto de trabajo mucho más pequeño (mejor rendimiento de caché)\n• Menor sobrecarga de memoria\n\nEl compromiso son inserciones/eliminaciones en tiempo lineal, lo cual es aceptable ya que los despachadores típicamente registran todos los manejadores una vez al inicio y luego realizan muchas búsquedas.",
    "Tags": "implementation multimethod behavioral performance",
    "Category": "Behavioral",
    "Page": "241"
  },
  {
    "FrontEN": "How does the constant-time dispatcher (BasicFastDispatcher) achieve O(1) lookup?",
    "BackEN": "It assigns each class a unique integral ID (stored as a static variable) and uses a 2D matrix indexed by these IDs. When dispatching:\n1. Fetch ID from each object via virtual function (2 virtual calls)\n2. Index into matrix: callbacks[idLhs][idRhs]\n3. Invoke the handler\n\nTotal cost: 2 virtual calls + matrix indexing + function call = constant time. Requires adding IMPLEMENT_INDEXABLE_CLASS macro to each class.",
    "FrontES": "¿Cómo logra el despachador de tiempo constante (BasicFastDispatcher) búsqueda O(1)?",
    "BackES": "Asigna a cada clase un ID integral único (almacenado como variable estática) y usa una matriz 2D indexada por estos IDs. Al despachar:\n1. Obtener ID de cada objeto mediante función virtual (2 llamadas virtuales)\n2. Indexar en la matriz: callbacks[idLhs][idRhs]\n3. Invocar el manejador\n\nCosto total: 2 llamadas virtuales + indexación de matriz + llamada a función = tiempo constante. Requiere agregar la macro IMPLEMENT_INDEXABLE_CLASS a cada clase.",
    "Tags": "implementation multimethod behavioral performance",
    "Category": "Behavioral",
    "Page": "253"
  },
  {
    "FrontEN": "What problem does the Multimethod pattern solve that single dispatch cannot?",
    "BackEN": "Single dispatch (virtual functions) selects behavior based on the runtime type of one object. Multimethod enables dispatching based on the runtime types of multiple objects simultaneously. Example: In collision detection, the behavior depends on both colliding object types (spaceship-asteroid needs different handling than spaceship-shield), which single dispatch cannot express directly without nested type checks.",
    "FrontES": "¿Qué problema resuelve el patrón Multimethod que el despacho simple no puede?",
    "BackES": "El despacho simple (funciones virtuales) selecciona comportamiento basándose en el tipo en tiempo de ejecución de un objeto. Multimethod permite despachar basándose en los tipos en tiempo de ejecución de múltiples objetos simultáneamente. Ejemplo: En la detección de colisiones, el comportamiento depende de ambos tipos de objetos en colisión (nave espacial-asteroide necesita manejo diferente que nave espacial-escudo), lo cual el despacho simple no puede expresar directamente sin verificaciones de tipos anidadas.",
    "Tags": "intent multimethod behavioral problem-solving",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "What is the Executor class in StaticDispatcher?",
    "BackEN": "A class that provides overloaded Fire methods for each type combination in the static dispatch. The Executor must implement:\n• Fire(ConcreteType1&, ConcreteType2&) for every combination of types in the typelists\n• OnError(BaseType1&, BaseType2&) for error handling when an unknown type is encountered\n\nStaticDispatcher calls the appropriate Fire method after determining the concrete types.",
    "FrontES": "¿Qué es la clase Executor en StaticDispatcher?",
    "BackES": "Una clase que proporciona métodos Fire sobrecargados para cada combinación de tipos en el despacho estático. El Executor debe implementar:\n• Fire(ConcreteType1&, ConcreteType2&) para cada combinación de tipos en las typelists\n• OnError(BaseType1&, BaseType2&) para manejo de errores cuando se encuentra un tipo desconocido\n\nStaticDispatcher llama al método Fire apropiado después de determinar los tipos concretos.",
    "Tags": "key-concepts multimethod behavioral executor",
    "Category": "Behavioral",
    "Page": "237"
  },
  {
    "FrontEN": "How does FnDispatcher use non-type template parameters?",
    "BackEN": "FnDispatcher accepts function pointers as non-type template parameters:\n\ntemplate <class Lhs, class Rhs, ResultType (*callback)(Lhs&, Rhs&)>\nvoid Add()\n\nThis allows the compiler to hardcode the function address in the generated trampoline code, eliminating the need to store it at runtime. The trampoline can inline the call to the callback, achieving zero overhead despite the indirection.",
    "FrontES": "¿Cómo usa FnDispatcher los parámetros de plantilla no tipo?",
    "BackES": "FnDispatcher acepta punteros a funciones como parámetros de plantilla no tipo:\n\ntemplate <class Lhs, class Rhs, ResultType (*callback)(Lhs&, Rhs&)>\nvoid Add()\n\nEsto permite que el compilador codifique la dirección de la función en el código trampolín generado, eliminando la necesidad de almacenarla en tiempo de ejecución. El trampolín puede hacer inline de la llamada al callback, logrando cero sobrecarga a pesar de la indirección.",
    "Tags": "implementation multimethod behavioral templates",
    "Category": "Behavioral",
    "Page": "244"
  },

  {
    "FrontEN": "What is the intent of the Scoped Locking pattern?",
    "BackEN": "Ensure proper pairing of mutex acquire and release operations by using RAII (Resource Acquisition Is Initialization) to automatically manage lock lifetime through constructor/destructor pairs.",
    "FrontES": "¿Cuál es la intención del patrón Scoped Locking?",
    "BackES": "Asegurar el emparejamiento adecuado de las operaciones de adquisición y liberación de mutex mediante el uso de RAII (Resource Acquisition Is Initialization) para gestionar automáticamente la vida útil del bloqueo a través de pares constructor/destructor.",
    "Tags": "intent scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "When would you use the Scoped Locking pattern?",
    "BackEN": "• When you need to ensure mutex release even in presence of exceptions\n• When functions have multiple return paths that make manual lock management error-prone\n• When you want to guarantee correct pairing of acquire/release operations through language invariants\n• When implementing thread-safe member functions that need automatic synchronization",
    "FrontES": "¿Cuándo usarías el patrón Scoped Locking?",
    "BackES": "• Cuando necesitas garantizar la liberación del mutex incluso en presencia de excepciones\n• Cuando las funciones tienen múltiples rutas de retorno que hacen que la gestión manual del bloqueo sea propensa a errores\n• Cuando quieres garantizar el emparejamiento correcto de las operaciones de adquisición/liberación a través de invariantes del lenguaje\n• Cuando implementas funciones miembro seguras para hilos que necesitan sincronización automática",
    "Tags": "use-case scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What are the key participants in the Scoped Locking pattern?",
    "BackEN": "• Mutex: Provides Acquire() and Release() functions for mutual exclusive access to resources\n• Lock: RAII wrapper that calls Acquire() in constructor and Release() in destructor\n• Protected Resource: The shared object or data that needs synchronized access (e.g., BankAccount)",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Scoped Locking?",
    "BackES": "• Mutex: Proporciona funciones Acquire() y Release() para acceso mutuamente exclusivo a recursos\n• Lock: Envoltorio RAII que llama a Acquire() en el constructor y Release() en el destructor\n• Recurso Protegido: El objeto o datos compartidos que necesitan acceso sincronizado (ej., BankAccount)",
    "Tags": "key-concepts scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Scoped Locking pattern?",
    "BackEN": "Benefits:\n• Automatic lock release prevents deadlocks from forgotten Release() calls\n• Exception-safe - locks are released even when exceptions are thrown\n• Simplifies code - no need to track all return paths\n• Compiler-enforced correctness through RAII idiom\n\nDrawbacks:\n• Requires careful scope management to control lock duration\n• May hold locks longer than necessary if scope is too broad\n• Cannot manually release lock before scope ends (without additional mechanisms)",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Scoped Locking?",
    "BackES": "Beneficios:\n• La liberación automática del bloqueo previene deadlocks por llamadas olvidadas a Release()\n• Seguro ante excepciones - los bloqueos se liberan incluso cuando se lanzan excepciones\n• Simplifica el código - no es necesario rastrear todas las rutas de retorno\n• Corrección garantizada por el compilador mediante el idioma RAII\n\nDesventajas:\n• Requiere gestión cuidadosa del ámbito para controlar la duración del bloqueo\n• Puede mantener bloqueos más tiempo del necesario si el ámbito es demasiado amplio\n• No puede liberar manualmente el bloqueo antes de que termine el ámbito (sin mecanismos adicionales)",
    "Tags": "benefits-drawbacks scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What patterns are related to the Scoped Locking pattern?",
    "BackEN": "• RAII (Resource Acquisition Is Initialization): Scoped Locking is a specific application of RAII for synchronization primitives\n• Policy-Based Design: ThreadingModel policy allows selecting different locking strategies at compile time",
    "FrontES": "¿Qué patrones están relacionados con el patrón Scoped Locking?",
    "BackES": "• RAII (Resource Acquisition Is Initialization): Scoped Locking es una aplicación específica de RAII para primitivas de sincronización\n• Diseño Basado en Políticas: La política ThreadingModel permite seleccionar diferentes estrategias de bloqueo en tiempo de compilación",
    "Tags": "related-patterns scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "```cpp\nclass BankAccount\n{\npublic:\n  void Deposit(double amount, const char* user)\n  {\n    mtx_.Acquire();\n    ... perform deposit transaction ...\n    mtx_.Release();\n  }\nprivate:\n  Mutex mtx_;\n};\n```\nWhat are the problems with this code?",
    "BackEN": "Pattern: Manual mutex management (anti-pattern)\nKey problems:\n• Release() might not be called if exceptions occur during the transaction\n• Multiple return paths require Release() in each path\n• Error-prone and violates exception safety\n• Should use Scoped Locking pattern instead with RAII-based Lock object",
    "FrontES": "```cpp\nclass BankAccount\n{\npublic:\n  void Deposit(double amount, const char* user)\n  {\n    mtx_.Acquire();\n    ... perform deposit transaction ...\n    mtx_.Release();\n  }\nprivate:\n  Mutex mtx_;\n};\n```\n¿Cuáles son los problemas con este código?",
    "BackES": "Patrón: Gestión manual de mutex (anti-patrón)\nProblemas clave:\n• Release() podría no ser llamado si ocurren excepciones durante la transacción\n• Múltiples rutas de retorno requieren Release() en cada ruta\n• Propenso a errores y viola la seguridad ante excepciones\n• Debería usar el patrón Scoped Locking con un objeto Lock basado en RAII",
    "Tags": "code-example scoped-locking fundamentals cpp anti-pattern",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "```cpp\nclass BankAccount : public ObjectLevelLockable<BankAccount>\n{\npublic:\n  void Deposit(double amount, const char* user)\n  {\n    Lock lock(*this);\n    ... perform deposit transaction ...\n  }\n};\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Scoped Locking with RAII\nKey elements:\n• Lock object constructed on the stack\n• Constructor calls Acquire() on the mutex\n• Destructor automatically calls Release() when lock goes out of scope\n• Exception-safe - mutex released even if transaction throws\n• No manual Release() calls needed",
    "FrontES": "```cpp\nclass BankAccount : public ObjectLevelLockable<BankAccount>\n{\npublic:\n  void Deposit(double amount, const char* user)\n  {\n    Lock lock(*this);\n    ... perform deposit transaction ...\n  }\n};\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Scoped Locking con RAII\nElementos clave:\n• Objeto Lock construido en la pila\n• El constructor llama a Acquire() en el mutex\n• El destructor automáticamente llama a Release() cuando el lock sale del ámbito\n• Seguro ante excepciones - el mutex se libera incluso si la transacción lanza excepciones\n• No se necesitan llamadas manuales a Release()",
    "Tags": "code-example scoped-locking fundamentals cpp",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What are key implementation considerations for the Scoped Locking pattern?",
    "BackEN": "• Allocate Lock objects on the stack, not the heap\n• Place Lock declaration at the beginning of the critical section\n• Ensure the Lock's lifetime matches the critical section duration\n• Use curly braces to create artificial scopes if needed to limit lock duration",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Scoped Locking?",
    "BackES": "• Asignar objetos Lock en la pila, no en el heap\n• Colocar la declaración del Lock al principio de la sección crítica\n• Asegurar que la vida útil del Lock coincida con la duración de la sección crítica\n• Usar llaves para crear ámbitos artificiales si es necesario para limitar la duración del bloqueo",
    "Tags": "implementation scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What are real-world examples of the Scoped Locking pattern?",
    "BackEN": "• std::lock_guard in C++11 standard library\n• std::unique_lock in C++11 standard library\n• Java's synchronized blocks (implicit scoped locking)\n• C# lock statement\n• Loki library's Lock class in ThreadingModel policy",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Scoped Locking?",
    "BackES": "• std::lock_guard en la biblioteca estándar de C++11\n• std::unique_lock en la biblioteca estándar de C++11\n• Bloques synchronized de Java (scoped locking implícito)\n• Declaración lock de C#\n• Clase Lock de la biblioteca Loki en la política ThreadingModel",
    "Tags": "real-world scoped-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "What is the intent of the Object-Level Locking pattern?",
    "BackEN": "Allocate one mutex per object instance to provide fine-grained synchronization where each object can be locked independently.",
    "FrontES": "¿Cuál es la intención del patrón Object-Level Locking?",
    "BackES": "Asignar un mutex por instancia de objeto para proporcionar sincronización de grano fino donde cada objeto puede ser bloqueado independientemente.",
    "Tags": "intent object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "When would you use the Object-Level Locking pattern?",
    "BackEN": "• When you need fine-grained concurrency control\n• When different instances of a class can be safely accessed simultaneously\n• When the overhead of one mutex per object is acceptable\n• When objects are not frequently copied (to avoid mutex copying overhead)",
    "FrontES": "¿Cuándo usarías el patrón Object-Level Locking?",
    "BackES": "• Cuando necesitas control de concurrencia de grano fino\n• Cuando diferentes instancias de una clase pueden ser accedidas simultáneamente de forma segura\n• Cuando el overhead de un mutex por objeto es aceptable\n• Cuando los objetos no se copian frecuentemente (para evitar el overhead de copiar mutex)",
    "Tags": "use-case object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the key participants in the Object-Level Locking pattern?",
    "BackEN": "• ObjectLevelLockable<Host>: Policy class template that provides object-level locking semantics\n• Lock: Nested class that locks a specific object instance for its lifetime\n• Host: The class that inherits from ObjectLevelLockable to gain thread-safety",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Object-Level Locking?",
    "BackES": "• ObjectLevelLockable<Host>: Plantilla de clase política que proporciona semántica de bloqueo a nivel de objeto\n• Lock: Clase anidada que bloquea una instancia específica de objeto durante su vida útil\n• Host: La clase que hereda de ObjectLevelLockable para obtener seguridad de hilos",
    "Tags": "key-concepts object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Object-Level Locking pattern?",
    "BackEN": "Benefits:\n• Allows concurrent access to different objects\n• Provides fine-grained synchronization\n• Maximizes parallelism\n• More scalable for systems with many objects\n\nDrawbacks:\n• Higher memory overhead - one mutex per object\n• Copying objects becomes more expensive\n• More mutexes to manage overall\n• May be overkill for small, frequently created objects",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Object-Level Locking?",
    "BackES": "Beneficios:\n• Permite acceso concurrente a diferentes objetos\n• Proporciona sincronización de grano fino\n• Maximiza el paralelismo\n• Más escalable para sistemas con muchos objetos\n\nDesventajas:\n• Mayor overhead de memoria - un mutex por objeto\n• Copiar objetos se vuelve más costoso\n• Más mutexes para gestionar en general\n• Puede ser excesivo para objetos pequeños y frecuentemente creados",
    "Tags": "benefits-drawbacks object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What patterns are related to the Object-Level Locking pattern?",
    "BackEN": "• Class-Level Locking: Alternative strategy that uses one mutex per class instead of per object\n• Policy-Based Design: Object-Level Locking is implemented as a policy in the ThreadingModel",
    "FrontES": "¿Qué patrones están relacionados con el patrón Object-Level Locking?",
    "BackES": "• Class-Level Locking: Estrategia alternativa que usa un mutex por clase en lugar de por objeto\n• Diseño Basado en Políticas: Object-Level Locking está implementado como una política en ThreadingModel",
    "Tags": "related-patterns object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "```cpp\ntemplate <typename Host>\nclass ObjectLevelLockable\n{\npublic:\n  class Lock\n  {\n  public:\n    Lock(Host& obj); // Must pass object reference\n    ...\n  };\n  ...\n};\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Object-Level Locking policy template\nKey elements:\n• Template parameterized on Host type\n• Lock constructor requires object reference\n• Each object has its own mutex\n• Enables per-instance synchronization",
    "FrontES": "```cpp\ntemplate <typename Host>\nclass ObjectLevelLockable\n{\npublic:\n  class Lock\n  {\n  public:\n    Lock(Host& obj); // Must pass object reference\n    ...\n  };\n  ...\n};\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Plantilla de política Object-Level Locking\nElementos clave:\n• Plantilla parametrizada en el tipo Host\n• El constructor de Lock requiere referencia al objeto\n• Cada objeto tiene su propio mutex\n• Permite sincronización por instancia",
    "Tags": "code-example object-level-locking fundamentals cpp",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are key implementation considerations for the Object-Level Locking pattern?",
    "BackEN": "• Each object stores its own mutex as a member variable\n• Lock constructor requires a reference to the specific object to lock\n• Cannot construct ObjectLevelLockable<T>::Lock without passing a T object\n• Per-object locking enables true parallel access to different instances",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Object-Level Locking?",
    "BackES": "• Cada objeto almacena su propio mutex como variable miembro\n• El constructor de Lock requiere una referencia al objeto específico a bloquear\n• No se puede construir ObjectLevelLockable<T>::Lock sin pasar un objeto T\n• El bloqueo por objeto permite verdadero acceso paralelo a diferentes instancias",
    "Tags": "implementation object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are real-world examples of the Object-Level Locking pattern?",
    "BackEN": "• Database row-level locking\n• File-level locking in file systems\n• Individual object monitors in Java\n• Per-connection locks in network servers",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Object-Level Locking?",
    "BackES": "• Bloqueo a nivel de fila en bases de datos\n• Bloqueo a nivel de archivo en sistemas de archivos\n• Monitores de objetos individuales en Java\n• Bloqueos por conexión en servidores de red",
    "Tags": "real-world object-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What is the intent of the Class-Level Locking pattern?",
    "BackEN": "Use a single static mutex shared by all instances of a class to reduce memory overhead when fine-grained object-level locking is not needed.",
    "FrontES": "¿Cuál es la intención del patrón Class-Level Locking?",
    "BackES": "Usar un único mutex estático compartido por todas las instancias de una clase para reducir el overhead de memoria cuando no se necesita bloqueo de grano fino a nivel de objeto.",
    "Tags": "intent class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "When would you use the Class-Level Locking pattern?",
    "BackEN": "• When memory overhead of per-object mutexes is too high\n• When objects are small and frequently copied (e.g., String)\n• When concurrent operations on different instances are rare\n• When the coarser granularity of locking is acceptable for performance",
    "FrontES": "¿Cuándo usarías el patrón Class-Level Locking?",
    "BackES": "• Cuando el overhead de memoria de los mutexes por objeto es demasiado alto\n• Cuando los objetos son pequeños y se copian frecuentemente (ej., String)\n• Cuando las operaciones concurrentes en diferentes instancias son raras\n• Cuando la granularidad más gruesa del bloqueo es aceptable para el rendimiento",
    "Tags": "use-case class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the key participants in the Class-Level Locking pattern?",
    "BackEN": "• ClassLevelLockable<Host>: Policy class template that provides class-level locking semantics\n• Lock: Nested class that locks the entire class for its lifetime\n• Static Mutex: Single mutex shared by all instances of the class",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Class-Level Locking?",
    "BackES": "• ClassLevelLockable<Host>: Plantilla de clase política que proporciona semántica de bloqueo a nivel de clase\n• Lock: Clase anidada que bloquea toda la clase durante su vida útil\n• Mutex Estático: Mutex único compartido por todas las instancias de la clase",
    "Tags": "key-concepts class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Class-Level Locking pattern?",
    "BackEN": "Benefits:\n• Minimal memory overhead - one mutex per class regardless of instance count\n• Objects remain small and cheap to copy\n• Simpler mental model - no per-object state to track\n• Effective for rarely-locked small objects\n\nDrawbacks:\n• Reduces parallelism - only one operation at a time across all instances\n• Can become a bottleneck if instances are frequently accessed\n• All objects blocked even when operating on different instances\n• Less scalable than object-level locking",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Class-Level Locking?",
    "BackES": "Beneficios:\n• Overhead de memoria mínimo - un mutex por clase sin importar el número de instancias\n• Los objetos permanecen pequeños y económicos de copiar\n• Modelo mental más simple - no hay estado por objeto que rastrear\n• Efectivo para objetos pequeños que se bloquean raramente\n\nDesventajas:\n• Reduce el paralelismo - solo una operación a la vez en todas las instancias\n• Puede convertirse en un cuello de botella si las instancias se acceden frecuentemente\n• Todos los objetos bloqueados incluso al operar en diferentes instancias\n• Menos escalable que el bloqueo a nivel de objeto",
    "Tags": "benefits-drawbacks class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What patterns are related to the Class-Level Locking pattern?",
    "BackEN": "• Object-Level Locking: Alternative that provides finer-grained locking at the cost of memory\n• Singleton: Class-level locking often used with Singleton to ensure thread-safe initialization",
    "FrontES": "¿Qué patrones están relacionados con el patrón Class-Level Locking?",
    "BackES": "• Object-Level Locking: Alternativa que proporciona bloqueo de grano más fino al costo de memoria\n• Singleton: El bloqueo a nivel de clase a menudo se usa con Singleton para asegurar inicialización segura para hilos",
    "Tags": "related-patterns class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "```cpp\ntemplate <typename Host>\nclass ClassLevelLockable\n{\npublic:\n  class Lock\n  {\n  public:\n    Lock();           // No object needed\n    Lock(Host& obj);  // Object optional (ignored)\n    ...\n  };\n  ...\n};\n```\nWhat pattern does this code demonstrate?",
    "BackEN": "Pattern: Class-Level Locking policy template\nKey elements:\n• Lock can be created without object reference\n• Uses static mutex shared by all instances\n• Object parameter optional for interface uniformity\n• All instances share the same lock",
    "FrontES": "```cpp\ntemplate <typename Host>\nclass ClassLevelLockable\n{\npublic:\n  class Lock\n  {\n  public:\n    Lock();           // No object needed\n    Lock(Host& obj);  // Object optional (ignored)\n    ...\n  };\n  ...\n};\n```\n¿Qué patrón demuestra este código?",
    "BackES": "Patrón: Plantilla de política Class-Level Locking\nElementos clave:\n• Lock se puede crear sin referencia al objeto\n• Usa mutex estático compartido por todas las instancias\n• Parámetro de objeto opcional para uniformidad de interfaz\n• Todas las instancias comparten el mismo bloqueo",
    "Tags": "code-example class-level-locking fundamentals cpp",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are key implementation considerations for the Class-Level Locking pattern?",
    "BackEN": "• Uses a static mutex member shared by all instances\n• Lock class can optionally take an object reference (for interface uniformity) but ignores it\n• Lock() constructor with no arguments is available for ClassLevelLockable\n• The locking operation blocks all instances of the class type",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Class-Level Locking?",
    "BackES": "• Usa un miembro mutex estático compartido por todas las instancias\n• La clase Lock puede tomar opcionalmente una referencia al objeto (para uniformidad de interfaz) pero la ignora\n• El constructor Lock() sin argumentos está disponible para ClassLevelLockable\n• La operación de bloqueo bloquea todas las instancias del tipo de clase",
    "Tags": "implementation class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are real-world examples of the Class-Level Locking pattern?",
    "BackEN": "• String classes with thread-safe operations\n• Small value objects that need occasional synchronization\n• Singleton implementations requiring thread-safe initialization\n• Shared counters or ID generators",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Class-Level Locking?",
    "BackES": "• Clases String con operaciones seguras para hilos\n• Objetos de valor pequeños que necesitan sincronización ocasional\n• Implementaciones Singleton que requieren inicialización segura para hilos\n• Contadores compartidos o generadores de ID",
    "Tags": "real-world class-level-locking fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "Compare Object-Level Locking vs Class-Level Locking",
    "BackEN": "Similarities:\n• Both provide thread synchronization\n• Both use RAII-based Lock objects\n• Both implemented as policies in Loki's ThreadingModel\n• Both provide uniform Lock interface\n\nDifferences:\n• Object-Level: one mutex per instance; Class-Level: one mutex per class\n• Object-Level: allows concurrent access to different objects; Class-Level: serializes all access\n• Object-Level: higher memory cost; Class-Level: minimal memory overhead\n• Object-Level: better scalability; Class-Level: potential bottleneck\n\nWhen to use each:\n• Object-Level: When you need maximum parallelism and can afford per-object mutex overhead\n• Class-Level: When objects are small/frequently copied (like String) and coarse locking is acceptable",
    "FrontES": "Compara Object-Level Locking vs Class-Level Locking",
    "BackES": "Similitudes:\n• Ambos proporcionan sincronización de hilos\n• Ambos usan objetos Lock basados en RAII\n• Ambos implementados como políticas en ThreadingModel de Loki\n• Ambos proporcionan interfaz Lock uniforme\n\nDiferencias:\n• Object-Level: un mutex por instancia; Class-Level: un mutex por clase\n• Object-Level: permite acceso concurrente a diferentes objetos; Class-Level: serializa todo el acceso\n• Object-Level: mayor costo de memoria; Class-Level: overhead de memoria mínimo\n• Object-Level: mejor escalabilidad; Class-Level: cuello de botella potencial\n\nCuándo usar cada uno:\n• Object-Level: Cuando necesitas máximo paralelismo y puedes costear el overhead de mutex por objeto\n• Class-Level: Cuando los objetos son pequeños/se copian frecuentemente (como String) y el bloqueo grueso es aceptable",
    "Tags": "comparison object-level-locking class-level-locking",
    "Category": "Comparison",
    "Page": "267"
  },
  {
    "FrontEN": "What is the intent of the Policy-Based Threading Model pattern?",
    "BackEN": "Use compile-time policy selection to choose between different threading strategies (single-threaded, object-level locking, class-level locking) with a uniform interface.",
    "FrontES": "¿Cuál es la intención del patrón Policy-Based Threading Model?",
    "BackES": "Usar selección de política en tiempo de compilación para elegir entre diferentes estrategias de threading (single-threaded, bloqueo a nivel de objeto, bloqueo a nivel de clase) con una interfaz uniforme.",
    "Tags": "intent policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "When would you use the Policy-Based Threading Model pattern?",
    "BackEN": "• When you need to support multiple threading models with the same code\n• When threading requirements may change during development\n• When you want to easily switch between thread-safe and single-threaded builds\n• When building reusable generic components that work in different threading contexts",
    "FrontES": "¿Cuándo usarías el patrón Policy-Based Threading Model?",
    "BackES": "• Cuando necesitas soportar múltiples modelos de threading con el mismo código\n• Cuando los requisitos de threading pueden cambiar durante el desarrollo\n• Cuando quieres cambiar fácilmente entre compilaciones thread-safe y single-threaded\n• Cuando construyes componentes genéricos reutilizables que funcionan en diferentes contextos de threading",
    "Tags": "use-case policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the key participants in the Policy-Based Threading Model pattern?",
    "BackEN": "• ThreadingModel Policy: Template parameter that defines the locking strategy\n• SingleThreaded: No-op implementation for single-threaded environments\n• ObjectLevelLockable: Implementation providing per-object locking\n• ClassLevelLockable: Implementation providing per-class locking\n• Lock/ReadLock: Nested class with uniform interface across all policies",
    "FrontES": "¿Cuáles son los participantes clave en el patrón Policy-Based Threading Model?",
    "BackES": "• Política ThreadingModel: Parámetro de plantilla que define la estrategia de bloqueo\n• SingleThreaded: Implementación no-op para entornos single-threaded\n• ObjectLevelLockable: Implementación que proporciona bloqueo por objeto\n• ClassLevelLockable: Implementación que proporciona bloqueo por clase\n• Lock/ReadLock: Clase anidada con interfaz uniforme en todas las políticas",
    "Tags": "key-concepts policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the benefits and drawbacks of the Policy-Based Threading Model pattern?",
    "BackEN": "Benefits:\n• Uniform interface across different threading models\n• Zero overhead for single-threaded model (empty Lock class)\n• Easy to change threading strategy by changing base class\n• Type-safe compile-time selection\n• No runtime polymorphism overhead\n\nDrawbacks:\n• Requires recompilation to change threading model\n• Can increase code size if multiple instantiations are used\n• Learning curve for policy-based design pattern\n• Cannot mix threading models within same object dynamically",
    "FrontES": "¿Cuáles son los beneficios y desventajas del patrón Policy-Based Threading Model?",
    "BackES": "Beneficios:\n• Interfaz uniforme en diferentes modelos de threading\n• Cero overhead para modelo single-threaded (clase Lock vacía)\n• Fácil cambiar estrategia de threading cambiando clase base\n• Selección segura de tipos en tiempo de compilación\n• Sin overhead de polimorfismo en tiempo de ejecución\n\nDesventajas:\n• Requiere recompilación para cambiar modelo de threading\n• Puede aumentar el tamaño del código si se usan múltiples instanciaciones\n• Curva de aprendizaje para patrón de diseño basado en políticas\n• No se pueden mezclar modelos de threading dentro del mismo objeto dinámicamente",
    "Tags": "benefits-drawbacks policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What patterns are related to the Policy-Based Threading Model pattern?",
    "BackEN": "• Strategy Pattern: Policy-based design is compile-time strategy selection vs runtime strategy\n• Template Method: Both use inheritance to vary behavior, but policies are compile-time\n• Null Object: SingleThreaded is essentially a Null Object for threading",
    "FrontES": "¿Qué patrones están relacionados con el patrón Policy-Based Threading Model?",
    "BackES": "• Patrón Strategy: El diseño basado en políticas es selección de estrategia en tiempo de compilación vs en tiempo de ejecución\n• Template Method: Ambos usan herencia para variar el comportamiento, pero las políticas son en tiempo de compilación\n• Null Object: SingleThreaded es esencialmente un Null Object para threading",
    "Tags": "related-patterns policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are key implementation considerations for the Policy-Based Threading Model pattern?",
    "BackEN": "• All ThreadingModel implementations provide Lock and optionally ReadLock nested classes\n• SingleThreaded provides empty mock-up classes with no actual locking\n• VolatileType inner class conditionally applies volatile modifier based on threading model\n• Uniform interface enables syntactic consistency across threading models",
    "FrontES": "¿Cuáles son las consideraciones clave de implementación para el patrón Policy-Based Threading Model?",
    "BackES": "• Todas las implementaciones de ThreadingModel proporcionan clases anidadas Lock y opcionalmente ReadLock\n• SingleThreaded proporciona clases mock-up vacías sin bloqueo real\n• La clase interna VolatileType aplica condicionalmente el modificador volatile basándose en el modelo de threading\n• La interfaz uniforme permite consistencia sintáctica entre modelos de threading",
    "Tags": "implementation policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are real-world examples of the Policy-Based Threading Model pattern?",
    "BackEN": "• C++ Standard Library allocator policies\n• Loki library's SmartPtr policies\n• Boost threading policies\n• Generic component libraries that support multiple configurations",
    "FrontES": "¿Cuáles son ejemplos del mundo real del patrón Policy-Based Threading Model?",
    "BackES": "• Políticas de asignador de la Biblioteca Estándar de C++\n• Políticas de SmartPtr de la biblioteca Loki\n• Políticas de threading de Boost\n• Bibliotecas de componentes genéricos que soportan múltiples configuraciones",
    "Tags": "real-world policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What are the three ThreadingModel policy implementations in Loki?",
    "BackEN": "1. SingleThreaded: No threading strategy at all. Lock and ReadLock are empty mock-ups with zero overhead.\n\n2. ObjectLevelLockable: Object-level locking semantics. One mutex per object is stored. The Lock inner class locks the mutex.\n\n3. ClassLevelLockable: Class-level locking semantics. One mutex per class is stored. The Lock inner class locks the mutex (and implicitly all objects of a type).",
    "FrontES": "¿Cuáles son las tres implementaciones de política ThreadingModel en Loki?",
    "BackES": "1. SingleThreaded: Sin estrategia de threading en absoluto. Lock y ReadLock son mock-ups vacíos con overhead cero.\n\n2. ObjectLevelLockable: Semántica de bloqueo a nivel de objeto. Se almacena un mutex por objeto. La clase interna Lock bloquea el mutex.\n\n3. ClassLevelLockable: Semántica de bloqueo a nivel de clase. Se almacena un mutex por clase. La clase interna Lock bloquea el mutex (e implícitamente todos los objetos de un tipo).",
    "Tags": "key-concepts policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "268"
  },
  {
    "FrontEN": "Which patterns use the concept 'RAII (Resource Acquisition Is Initialization)'?",
    "BackEN": "All locking patterns use RAII to ensure proper resource cleanup. The Lock object acquires the mutex in its constructor and releases it in its destructor, guaranteeing correct cleanup even with exceptions.\n\nPatterns: Scoped Locking, Object-Level Locking, Class-Level Locking",
    "FrontES": "¿Qué patrones usan el concepto 'RAII (Resource Acquisition Is Initialization)'?",
    "BackES": "Todos los patrones de bloqueo usan RAII para asegurar la limpieza adecuada de recursos. El objeto Lock adquiere el mutex en su constructor y lo libera en su destructor, garantizando una limpieza correcta incluso con excepciones.\n\nPatrones: Scoped Locking, Object-Level Locking, Class-Level Locking",
    "Tags": "cross-cutting raii",
    "Category": "Cross-Cutting",
    "Page": "266"
  },
  {
    "FrontEN": "Which patterns use the concept 'Policy-Based Design'?",
    "BackEN": "The ThreadingModel uses policy-based design to select locking strategies at compile time. This allows the same client code to work with different threading models by simply changing a template parameter.\n\nPatterns: Policy-Based Threading Model, Object-Level Locking, Class-Level Locking",
    "FrontES": "¿Qué patrones usan el concepto 'Diseño Basado en Políticas'?",
    "BackES": "El ThreadingModel usa diseño basado en políticas para seleccionar estrategias de bloqueo en tiempo de compilación. Esto permite que el mismo código del cliente funcione con diferentes modelos de threading simplemente cambiando un parámetro de plantilla.\n\nPatrones: Policy-Based Threading Model, Object-Level Locking, Class-Level Locking",
    "Tags": "cross-cutting policy-based-design",
    "Category": "Cross-Cutting",
    "Page": "267"
  },
  {
    "FrontEN": "Which patterns use the concept 'Separation of Concerns'?",
    "BackEN": "Threading concerns are separated from business logic. Classes inherit threading behavior from policies rather than implementing synchronization directly, keeping code focused and modular.\n\nPatterns: Policy-Based Threading Model, Object-Level Locking, Class-Level Locking",
    "FrontES": "¿Qué patrones usan el concepto 'Separación de Preocupaciones'?",
    "BackES": "Las preocupaciones de threading están separadas de la lógica de negocio. Las clases heredan el comportamiento de threading de las políticas en lugar de implementar la sincronización directamente, manteniendo el código enfocado y modular.\n\nPatrones: Policy-Based Threading Model, Object-Level Locking, Class-Level Locking",
    "Tags": "cross-cutting separation-of-concerns",
    "Category": "Cross-Cutting",
    "Page": "267"
  },
  {
    "FrontEN": "Which patterns use the concept 'Zero-Cost Abstraction'?",
    "BackEN": "The SingleThreaded policy provides empty Lock classes that compile to zero overhead, demonstrating zero-cost abstraction - you don't pay for features you don't use.\n\nPatterns: Policy-Based Threading Model",
    "FrontES": "¿Qué patrones usan el concepto 'Abstracción de Costo Cero'?",
    "BackES": "La política SingleThreaded proporciona clases Lock vacías que se compilan con overhead cero, demostrando abstracción de costo cero - no pagas por características que no usas.\n\nPatrones: Policy-Based Threading Model",
    "Tags": "cross-cutting zero-cost-abstraction",
    "Category": "Cross-Cutting",
    "Page": "268"
  },
  {
    "FrontEN": "Which patterns use the concept 'Exception Safety'?",
    "BackEN": "RAII-based locking ensures exception safety by guaranteeing mutex release even when exceptions are thrown, preventing deadlocks from forgotten cleanup.\n\nPatterns: Scoped Locking, Object-Level Locking, Class-Level Locking",
    "FrontES": "¿Qué patrones usan el concepto 'Seguridad ante Excepciones'?",
    "BackES": "El bloqueo basado en RAII asegura la seguridad ante excepciones garantizando la liberación del mutex incluso cuando se lanzan excepciones, previniendo deadlocks por limpieza olvidada.\n\nPatrones: Scoped Locking, Object-Level Locking, Class-Level Locking",
    "Tags": "cross-cutting exception-safety",
    "Category": "Cross-Cutting",
    "Page": "266"
  },
  {
    "FrontEN": "What is a Mutex and what are its basic functions?",
    "BackEN": "A mutex (Mutual Exclusive) allows threads mutually exclusive access to a resource.\n\nBasic functions:\n• Acquire: Called by thread needing exclusive access. Only one thread can acquire. Others block in wait state.\n• Release: Called by owning thread. Thread scheduler chooses one waiting thread and gives it mutex ownership.\n\nEffect: Code between Acquire() and Release() is atomic with respect to the mutex object.",
    "FrontES": "¿Qué es un Mutex y cuáles son sus funciones básicas?",
    "BackES": "Un mutex (Mutual Exclusive) permite a los hilos acceso mutuamente exclusivo a un recurso.\n\nFunciones básicas:\n• Acquire: Llamada por un hilo que necesita acceso exclusivo. Solo un hilo puede adquirir. Los demás se bloquean en estado de espera.\n• Release: Llamada por el hilo propietario. El planificador de hilos elige un hilo en espera y le da la propiedad del mutex.\n\nEfecto: El código entre Acquire() y Release() es atómico con respecto al objeto mutex.",
    "Tags": "key-concepts mutex fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  },
  {
    "FrontEN": "Why does Loki not define its own mutex implementation?",
    "BackEN": "For portability reasons. Most developers already use a multithreading library that defines its own mutexes, and it would be awkward to duplicate their functionality.\n\nInstead, Loki relies on higher-level locking semantics (ClassLevelLockable, ObjectLevelLockable) that are implemented in terms of existing mutexes from external libraries.",
    "FrontES": "¿Por qué Loki no define su propia implementación de mutex?",
    "BackES": "Por razones de portabilidad. La mayoría de los desarrolladores ya usan una biblioteca de multithreading que define sus propios mutexes, y sería incómodo duplicar su funcionalidad.\n\nEn su lugar, Loki se basa en semánticas de bloqueo de más alto nivel (ClassLevelLockable, ObjectLevelLockable) que están implementadas en términos de mutexes existentes de bibliotecas externas.",
    "Tags": "implementation fundamentals loki",
    "Category": "Fundamentals",
    "Page": "267"
  },
  {
    "FrontEN": "What is the purpose of Loki's VolatileType inner class?",
    "BackEN": "VolatileType conditionally applies the volatile modifier based on threading model:\n\n• For ClassLevelLockable and ObjectLevelLockable: evaluates to volatile Widget\n• For SingleThreaded: evaluates to plain Widget\n\nReason: In multithreaded environments, volatile prevents compiler optimizations on shared variables. In single-threaded code, avoiding volatile enables important optimizations.",
    "FrontES": "¿Cuál es el propósito de la clase interna VolatileType de Loki?",
    "BackES": "VolatileType aplica condicionalmente el modificador volatile basándose en el modelo de threading:\n\n• Para ClassLevelLockable y ObjectLevelLockable: se evalúa como volatile Widget\n• Para SingleThreaded: se evalúa como Widget simple\n\nRazón: En entornos multithreaded, volatile previene optimizaciones del compilador en variables compartidas. En código single-threaded, evitar volatile permite optimizaciones importantes.",
    "Tags": "implementation policy-based-threading-model fundamentals",
    "Category": "Fundamentals",
    "Page": "269"
  },
  {
    "FrontEN": "What common mistake occurs when using manual mutex Acquire/Release?",
    "BackEN": "Failing to call Release() for each Acquire() has deadly effects - the mutex stays locked forever and all other threads trying to acquire it block permanently.\n\nCommon causes:\n• Exceptions thrown between Acquire() and Release()\n• Multiple return paths that forget to call Release()\n• Early returns that skip Release()\n\nSolution: Use Scoped Locking pattern with RAII to guarantee Release() is called.",
    "FrontES": "¿Qué error común ocurre al usar Acquire/Release manual de mutex?",
    "BackES": "Fallar al llamar Release() por cada Acquire() tiene efectos mortales - el mutex permanece bloqueado para siempre y todos los demás hilos que intentan adquirirlo se bloquean permanentemente.\n\nCausas comunes:\n• Excepciones lanzadas entre Acquire() y Release()\n• Múltiples rutas de retorno que olvidan llamar a Release()\n• Retornos tempranos que omiten Release()\n\nSolución: Usar el patrón Scoped Locking con RAII para garantizar que Release() sea llamado.",
    "Tags": "anti-pattern mutex fundamentals",
    "Category": "Fundamentals",
    "Page": "266"
  }
]